var api, city, cityIndex, cityMap, county, i, index, j, k, len, len1, len2, locations, locationsFormat, locationsJSON, province, provinceIndex, provinceMap, ref, ref1, ref2, sub_location, three_location;

api = 'https://apis.map.qq.com/ws/district/v1/list?key=4GKBZ-OD5WR-OPVWO-WU3DT-GU2O5-PFF24&output=jsonp&callback=citydata_callback&citydata_callback=jQuery19108119565888266771_1486712726810&_=1486712726811';

sub_location = [
  {
    "name": "北京",
    "c": [
      {
        "name": "东城"
      }, {
        "name": "西城"
      }, {
        "name": "朝阳"
      }, {
        "name": "丰台"
      }, {
        "name": "石景山"
      }, {
        "name": "海淀"
      }, {
        "name": "门头沟"
      }, {
        "name": "房山"
      }, {
        "name": "通州"
      }, {
        "name": "顺义"
      }, {
        "name": "昌平"
      }, {
        "name": "大兴"
      }, {
        "name": "怀柔"
      }, {
        "name": "平谷"
      }, {
        "name": "密云"
      }, {
        "name": "延庆"
      }
    ]
  }, {
    "name": "天津",
    "c": [
      {
        "name": "和平"
      }, {
        "name": "河东"
      }, {
        "name": "河西"
      }, {
        "name": "南开"
      }, {
        "name": "河北"
      }, {
        "name": "红桥"
      }, {
        "name": "东丽"
      }, {
        "name": "西青"
      }, {
        "name": "津南"
      }, {
        "name": "北辰"
      }, {
        "name": "武清"
      }, {
        "name": "宝坻"
      }, {
        "name": "滨海"
      }, {
        "name": "宁河"
      }, {
        "name": "静海"
      }, {
        "name": "蓟州"
      }
    ]
  }, {
    "name": "河北",
    "c": [
      {
        "name": "石家庄"
      }, {
        "name": "唐山"
      }, {
        "name": "秦皇岛"
      }, {
        "name": "邯郸"
      }, {
        "name": "邢台"
      }, {
        "name": "保定"
      }, {
        "name": "张家口"
      }, {
        "name": "承德"
      }, {
        "name": "沧州"
      }, {
        "name": "廊坊"
      }, {
        "name": "衡水"
      }, {
        "name": "定州"
      }, {
        "name": "辛集"
      }
    ]
  }, {
    "name": "山西",
    "c": [
      {
        "name": "太原"
      }, {
        "name": "大同"
      }, {
        "name": "阳泉"
      }, {
        "name": "长治"
      }, {
        "name": "晋城"
      }, {
        "name": "朔州"
      }, {
        "name": "晋中"
      }, {
        "name": "运城"
      }, {
        "name": "忻州"
      }, {
        "name": "临汾"
      }, {
        "name": "吕梁"
      }
    ]
  }, {
    "name": "内蒙古",
    "c": [
      {
        "name": "呼和浩特"
      }, {
        "name": "包头"
      }, {
        "name": "乌海"
      }, {
        "name": "赤峰"
      }, {
        "name": "通辽"
      }, {
        "name": "鄂尔多斯"
      }, {
        "name": "呼伦贝尔"
      }, {
        "name": "巴彦淖尔"
      }, {
        "name": "乌兰察布"
      }, {
        "name": "兴安"
      }, {
        "name": "锡林郭勒"
      }, {
        "name": "阿拉善"
      }
    ]
  }, {
    "name": "辽宁",
    "c": [
      {
        "name": "沈阳"
      }, {
        "name": "大连"
      }, {
        "name": "鞍山"
      }, {
        "name": "抚顺"
      }, {
        "name": "本溪"
      }, {
        "name": "丹东"
      }, {
        "name": "锦州"
      }, {
        "name": "营口"
      }, {
        "name": "阜新"
      }, {
        "name": "辽阳"
      }, {
        "name": "盘锦"
      }, {
        "name": "铁岭"
      }, {
        "name": "朝阳"
      }, {
        "name": "葫芦岛"
      }
    ]
  }, {
    "name": "吉林",
    "c": [
      {
        "name": "长春"
      }, {
        "name": "吉林"
      }, {
        "name": "四平"
      }, {
        "name": "辽源"
      }, {
        "name": "通化"
      }, {
        "name": "白山"
      }, {
        "name": "松原"
      }, {
        "name": "白城"
      }, {
        "name": "延边"
      }
    ]
  }, {
    "name": "黑龙江",
    "c": [
      {
        "name": "哈尔滨"
      }, {
        "name": "齐齐哈尔"
      }, {
        "name": "鸡西"
      }, {
        "name": "鹤岗"
      }, {
        "name": "双鸭山"
      }, {
        "name": "大庆"
      }, {
        "name": "伊春"
      }, {
        "name": "佳木斯"
      }, {
        "name": "七台河"
      }, {
        "name": "牡丹江"
      }, {
        "name": "黑河"
      }, {
        "name": "绥化"
      }, {
        "name": "大兴安岭"
      }
    ]
  }, {
    "name": "上海",
    "c": [
      {
        "name": "黄浦"
      }, {
        "name": "徐汇"
      }, {
        "name": "长宁"
      }, {
        "name": "静安"
      }, {
        "name": "普陀"
      }, {
        "name": "虹口"
      }, {
        "name": "杨浦"
      }, {
        "name": "闵行"
      }, {
        "name": "宝山"
      }, {
        "name": "嘉定"
      }, {
        "name": "浦东"
      }, {
        "name": "金山"
      }, {
        "name": "松江"
      }, {
        "name": "青浦"
      }, {
        "name": "奉贤"
      }, {
        "name": "崇明"
      }
    ]
  }, {
    "name": "江苏",
    "c": [
      {
        "name": "南京"
      }, {
        "name": "无锡"
      }, {
        "name": "徐州"
      }, {
        "name": "常州"
      }, {
        "name": "苏州"
      }, {
        "name": "南通"
      }, {
        "name": "连云港"
      }, {
        "name": "淮安"
      }, {
        "name": "盐城"
      }, {
        "name": "扬州"
      }, {
        "name": "镇江"
      }, {
        "name": "泰州"
      }, {
        "name": "宿迁"
      }
    ]
  }, {
    "name": "浙江",
    "c": [
      {
        "name": "杭州"
      }, {
        "name": "宁波"
      }, {
        "name": "温州"
      }, {
        "name": "嘉兴"
      }, {
        "name": "湖州"
      }, {
        "name": "绍兴"
      }, {
        "name": "金华"
      }, {
        "name": "衢州"
      }, {
        "name": "舟山"
      }, {
        "name": "台州"
      }, {
        "name": "丽水"
      }
    ]
  }, {
    "name": "安徽",
    "c": [
      {
        "name": "合肥"
      }, {
        "name": "芜湖"
      }, {
        "name": "蚌埠"
      }, {
        "name": "淮南"
      }, {
        "name": "马鞍山"
      }, {
        "name": "淮北"
      }, {
        "name": "铜陵"
      }, {
        "name": "安庆"
      }, {
        "name": "黄山"
      }, {
        "name": "滁州"
      }, {
        "name": "阜阳"
      }, {
        "name": "宿州"
      }, {
        "name": "六安"
      }, {
        "name": "亳州"
      }, {
        "name": "池州"
      }, {
        "name": "宣城"
      }
    ]
  }, {
    "name": "福建",
    "c": [
      {
        "name": "福州"
      }, {
        "name": "厦门"
      }, {
        "name": "莆田"
      }, {
        "name": "三明"
      }, {
        "name": "泉州"
      }, {
        "name": "漳州"
      }, {
        "name": "南平"
      }, {
        "name": "龙岩"
      }, {
        "name": "宁德"
      }
    ]
  }, {
    "name": "江西",
    "c": [
      {
        "name": "南昌"
      }, {
        "name": "景德镇"
      }, {
        "name": "萍乡"
      }, {
        "name": "九江"
      }, {
        "name": "新余"
      }, {
        "name": "鹰潭"
      }, {
        "name": "赣州"
      }, {
        "name": "吉安"
      }, {
        "name": "宜春"
      }, {
        "name": "抚州"
      }, {
        "name": "上饶"
      }
    ]
  }, {
    "name": "山东",
    "c": [
      {
        "name": "济南"
      }, {
        "name": "青岛"
      }, {
        "name": "淄博"
      }, {
        "name": "枣庄"
      }, {
        "name": "东营"
      }, {
        "name": "烟台"
      }, {
        "name": "潍坊"
      }, {
        "name": "济宁"
      }, {
        "name": "泰安"
      }, {
        "name": "威海"
      }, {
        "name": "日照"
      }, {
        "name": "莱芜"
      }, {
        "name": "临沂"
      }, {
        "name": "德州"
      }, {
        "name": "聊城"
      }, {
        "name": "滨州"
      }, {
        "name": "菏泽"
      }
    ]
  }, {
    "name": "河南",
    "c": [
      {
        "name": "郑州"
      }, {
        "name": "开封"
      }, {
        "name": "洛阳"
      }, {
        "name": "平顶山"
      }, {
        "name": "安阳"
      }, {
        "name": "鹤壁"
      }, {
        "name": "新乡"
      }, {
        "name": "焦作"
      }, {
        "name": "濮阳"
      }, {
        "name": "许昌"
      }, {
        "name": "漯河"
      }, {
        "name": "三门峡"
      }, {
        "name": "南阳"
      }, {
        "name": "商丘"
      }, {
        "name": "信阳"
      }, {
        "name": "周口"
      }, {
        "name": "驻马店"
      }, {
        "name": "济源"
      }
    ]
  }, {
    "name": "湖北",
    "c": [
      {
        "name": "武汉"
      }, {
        "name": "黄石"
      }, {
        "name": "十堰"
      }, {
        "name": "宜昌"
      }, {
        "name": "襄阳"
      }, {
        "name": "鄂州"
      }, {
        "name": "荆门"
      }, {
        "name": "孝感"
      }, {
        "name": "荆州"
      }, {
        "name": "黄冈"
      }, {
        "name": "咸宁"
      }, {
        "name": "随州"
      }, {
        "name": "恩施"
      }, {
        "name": "仙桃"
      }, {
        "name": "潜江"
      }, {
        "name": "天门"
      }, {
        "name": "神农架"
      }
    ]
  }, {
    "name": "湖南",
    "c": [
      {
        "name": "长沙"
      }, {
        "name": "株洲"
      }, {
        "name": "湘潭"
      }, {
        "name": "衡阳"
      }, {
        "name": "邵阳"
      }, {
        "name": "岳阳"
      }, {
        "name": "常德"
      }, {
        "name": "张家界"
      }, {
        "name": "益阳"
      }, {
        "name": "郴州"
      }, {
        "name": "永州"
      }, {
        "name": "怀化"
      }, {
        "name": "娄底"
      }, {
        "name": "湘西"
      }
    ]
  }, {
    "name": "广东",
    "c": [
      {
        "name": "广州"
      }, {
        "name": "韶关"
      }, {
        "name": "深圳"
      }, {
        "name": "珠海"
      }, {
        "name": "汕头"
      }, {
        "name": "佛山"
      }, {
        "name": "江门"
      }, {
        "name": "湛江"
      }, {
        "name": "茂名"
      }, {
        "name": "肇庆"
      }, {
        "name": "惠州"
      }, {
        "name": "梅州"
      }, {
        "name": "汕尾"
      }, {
        "name": "河源"
      }, {
        "name": "阳江"
      }, {
        "name": "清远"
      }, {
        "name": "东莞"
      }, {
        "name": "中山"
      }, {
        "name": "潮州"
      }, {
        "name": "揭阳"
      }, {
        "name": "云浮"
      }
    ]
  }, {
    "name": "广西",
    "c": [
      {
        "name": "南宁"
      }, {
        "name": "柳州"
      }, {
        "name": "桂林"
      }, {
        "name": "梧州"
      }, {
        "name": "北海"
      }, {
        "name": "防城港"
      }, {
        "name": "钦州"
      }, {
        "name": "贵港"
      }, {
        "name": "玉林"
      }, {
        "name": "百色"
      }, {
        "name": "贺州"
      }, {
        "name": "河池"
      }, {
        "name": "来宾"
      }, {
        "name": "崇左"
      }
    ]
  }, {
    "name": "海南",
    "c": [
      {
        "name": "海口"
      }, {
        "name": "三亚"
      }, {
        "name": "三沙"
      }, {
        "name": "儋州"
      }, {
        "name": "五指山"
      }, {
        "name": "琼海"
      }, {
        "name": "文昌"
      }, {
        "name": "万宁"
      }, {
        "name": "东方"
      }, {
        "name": "定安"
      }, {
        "name": "屯昌"
      }, {
        "name": "澄迈"
      }, {
        "name": "临高"
      }, {
        "name": "白沙"
      }, {
        "name": "昌江"
      }, {
        "name": "乐东"
      }, {
        "name": "陵水"
      }, {
        "name": "保亭"
      }, {
        "name": "琼中"
      }
    ]
  }, {
    "name": "重庆",
    "c": [
      {
        "name": "万州"
      }, {
        "name": "涪陵"
      }, {
        "name": "渝中"
      }, {
        "name": "大渡口"
      }, {
        "name": "江北"
      }, {
        "name": "沙坪坝"
      }, {
        "name": "九龙坡"
      }, {
        "name": "南岸"
      }, {
        "name": "北碚"
      }, {
        "name": "綦江"
      }, {
        "name": "大足"
      }, {
        "name": "渝北"
      }, {
        "name": "巴南"
      }, {
        "name": "黔江"
      }, {
        "name": "长寿"
      }, {
        "name": "江津"
      }, {
        "name": "合川"
      }, {
        "name": "永川"
      }, {
        "name": "南川"
      }, {
        "name": "璧山"
      }, {
        "name": "铜梁"
      }, {
        "name": "潼南"
      }, {
        "name": "荣昌"
      }, {
        "name": "开州"
      }, {
        "name": "梁平"
      }, {
        "name": "城口"
      }, {
        "name": "丰都"
      }, {
        "name": "垫江"
      }, {
        "name": "武隆"
      }, {
        "name": "忠县"
      }, {
        "name": "云阳"
      }, {
        "name": "奉节"
      }, {
        "name": "巫山"
      }, {
        "name": "巫溪"
      }, {
        "name": "石柱"
      }, {
        "name": "秀山"
      }, {
        "name": "酉阳"
      }, {
        "name": "彭水"
      }
    ]
  }, {
    "name": "四川",
    "c": [
      {
        "name": "成都"
      }, {
        "name": "自贡"
      }, {
        "name": "攀枝花"
      }, {
        "name": "泸州"
      }, {
        "name": "德阳"
      }, {
        "name": "绵阳"
      }, {
        "name": "广元"
      }, {
        "name": "遂宁"
      }, {
        "name": "内江"
      }, {
        "name": "乐山"
      }, {
        "name": "南充"
      }, {
        "name": "眉山"
      }, {
        "name": "宜宾"
      }, {
        "name": "广安"
      }, {
        "name": "达州"
      }, {
        "name": "雅安"
      }, {
        "name": "巴中"
      }, {
        "name": "资阳"
      }, {
        "name": "阿坝"
      }, {
        "name": "甘孜"
      }, {
        "name": "凉山"
      }
    ]
  }, {
    "name": "贵州",
    "c": [
      {
        "name": "贵阳"
      }, {
        "name": "六盘水"
      }, {
        "name": "遵义"
      }, {
        "name": "安顺"
      }, {
        "name": "毕节"
      }, {
        "name": "铜仁"
      }, {
        "name": "黔西南"
      }, {
        "name": "黔东南"
      }, {
        "name": "黔南"
      }
    ]
  }, {
    "name": "云南",
    "c": [
      {
        "name": "昆明"
      }, {
        "name": "曲靖"
      }, {
        "name": "玉溪"
      }, {
        "name": "保山"
      }, {
        "name": "昭通"
      }, {
        "name": "丽江"
      }, {
        "name": "普洱"
      }, {
        "name": "临沧"
      }, {
        "name": "楚雄"
      }, {
        "name": "红河"
      }, {
        "name": "文山"
      }, {
        "name": "西双版纳"
      }, {
        "name": "大理"
      }, {
        "name": "德宏"
      }, {
        "name": "怒江"
      }, {
        "name": "迪庆"
      }
    ]
  }, {
    "name": "西藏",
    "c": [
      {
        "name": "拉萨"
      }, {
        "name": "日喀则"
      }, {
        "name": "昌都"
      }, {
        "name": "林芝"
      }, {
        "name": "山南"
      }, {
        "name": "那曲"
      }, {
        "name": "阿里"
      }
    ]
  }, {
    "name": "陕西",
    "c": [
      {
        "name": "西安"
      }, {
        "name": "铜川"
      }, {
        "name": "宝鸡"
      }, {
        "name": "咸阳"
      }, {
        "name": "渭南"
      }, {
        "name": "延安"
      }, {
        "name": "汉中"
      }, {
        "name": "榆林"
      }, {
        "name": "安康"
      }, {
        "name": "商洛"
      }
    ]
  }, {
    "name": "甘肃",
    "c": [
      {
        "name": "兰州"
      }, {
        "name": "嘉峪关"
      }, {
        "name": "金昌"
      }, {
        "name": "白银"
      }, {
        "name": "天水"
      }, {
        "name": "武威"
      }, {
        "name": "张掖"
      }, {
        "name": "平凉"
      }, {
        "name": "酒泉"
      }, {
        "name": "庆阳"
      }, {
        "name": "定西"
      }, {
        "name": "陇南"
      }, {
        "name": "临夏"
      }, {
        "name": "甘南"
      }
    ]
  }, {
    "name": "青海",
    "c": [
      {
        "name": "西宁"
      }, {
        "name": "海东"
      }, {
        "name": "海北"
      }, {
        "name": "黄南"
      }, {
        "name": "海南"
      }, {
        "name": "果洛"
      }, {
        "name": "玉树"
      }, {
        "name": "海西"
      }
    ]
  }, {
    "name": "宁夏",
    "c": [
      {
        "name": "银川"
      }, {
        "name": "石嘴山"
      }, {
        "name": "吴忠"
      }, {
        "name": "固原"
      }, {
        "name": "中卫"
      }
    ]
  }, {
    "name": "新疆",
    "c": [
      {
        "name": "乌鲁木齐"
      }, {
        "name": "克拉玛依"
      }, {
        "name": "吐鲁番"
      }, {
        "name": "哈密"
      }, {
        "name": "昌吉"
      }, {
        "name": "博州"
      }, {
        "name": "巴州"
      }, {
        "name": "阿克苏"
      }, {
        "name": "克州"
      }, {
        "name": "喀什"
      }, {
        "name": "和田"
      }, {
        "name": "伊犁"
      }, {
        "name": "塔城"
      }, {
        "name": "阿勒泰"
      }, {
        "name": "石河子"
      }, {
        "name": "阿拉尔"
      }, {
        "name": "图木舒克"
      }, {
        "name": "五家渠"
      }, {
        "name": "北屯"
      }, {
        "name": "铁门关"
      }, {
        "name": "双河"
      }, {
        "name": "可克达拉"
      }
    ]
  }, {
    "name": "台湾",
    "c": []
  }, {
    "name": "香港",
    "c": [
      {
        "name": "香港"
      }, {
        "name": "中西区"
      }, {
        "name": "东区"
      }, {
        "name": "九龙"
      }, {
        "name": "观塘区"
      }, {
        "name": "南区"
      }, {
        "name": "深水埗区"
      }, {
        "name": "湾仔区"
      }, {
        "name": "黄大仙区"
      }, {
        "name": "油尖旺区"
      }, {
        "name": "离岛区"
      }, {
        "name": "葵青区"
      }, {
        "name": "北区"
      }, {
        "name": "西贡区"
      }, {
        "name": "沙田区"
      }, {
        "name": "屯门区"
      }, {
        "name": "大埔区"
      }, {
        "name": "荃湾区"
      }, {
        "name": "元朗区"
      }
    ]
  }, {
    "name": "澳门",
    "c": [
      {
        "name": "澳门"
      }, {
        "name": "澳门半岛"
      }, {
        "name": "凼仔"
      }, {
        "name": "路凼城"
      }, {
        "name": "路环"
      }
    ]
  }
];

three_location = [
  {
    "name": "北京市",
    "c": [
      {
        "name": "东城区",
        "c": []
      }, {
        "name": "西城区",
        "c": []
      }, {
        "name": "朝阳区",
        "c": []
      }, {
        "name": "丰台区",
        "c": []
      }, {
        "name": "石景山区",
        "c": []
      }, {
        "name": "海淀区",
        "c": []
      }, {
        "name": "门头沟区",
        "c": []
      }, {
        "name": "房山区",
        "c": []
      }, {
        "name": "通州区",
        "c": []
      }, {
        "name": "顺义区",
        "c": []
      }, {
        "name": "昌平区",
        "c": []
      }, {
        "name": "大兴区",
        "c": []
      }, {
        "name": "怀柔区",
        "c": []
      }, {
        "name": "平谷区",
        "c": []
      }, {
        "name": "密云区",
        "c": []
      }, {
        "name": "延庆区",
        "c": []
      }
    ]
  }, {
    "name": "天津市",
    "c": [
      {
        "name": "和平区",
        "c": []
      }, {
        "name": "河东区",
        "c": []
      }, {
        "name": "河西区",
        "c": []
      }, {
        "name": "南开区",
        "c": []
      }, {
        "name": "河北区",
        "c": []
      }, {
        "name": "红桥区",
        "c": []
      }, {
        "name": "东丽区",
        "c": []
      }, {
        "name": "西青区",
        "c": []
      }, {
        "name": "津南区",
        "c": []
      }, {
        "name": "北辰区",
        "c": []
      }, {
        "name": "武清区",
        "c": []
      }, {
        "name": "宝坻区",
        "c": []
      }, {
        "name": "滨海新区",
        "c": []
      }, {
        "name": "宁河区",
        "c": []
      }, {
        "name": "静海区",
        "c": []
      }, {
        "name": "蓟州区",
        "c": []
      }
    ]
  }, {
    "name": "河北省",
    "c": [
      {
        "name": "石家庄市",
        "c": [
          {
            "name": "长安区"
          }, {
            "name": "桥西区"
          }, {
            "name": "新华区"
          }, {
            "name": "井陉矿区"
          }, {
            "name": "裕华区"
          }, {
            "name": "藁城区"
          }, {
            "name": "鹿泉区"
          }, {
            "name": "栾城区"
          }, {
            "name": "井陉县"
          }, {
            "name": "正定县"
          }, {
            "name": "行唐县"
          }, {
            "name": "灵寿县"
          }, {
            "name": "高邑县"
          }, {
            "name": "深泽县"
          }, {
            "name": "赞皇县"
          }, {
            "name": "无极县"
          }, {
            "name": "平山县"
          }, {
            "name": "元氏县"
          }, {
            "name": "赵县"
          }, {
            "name": "晋州市"
          }, {
            "name": "新乐市"
          }
        ]
      }, {
        "name": "唐山市",
        "c": [
          {
            "name": "路南区"
          }, {
            "name": "路北区"
          }, {
            "name": "古冶区"
          }, {
            "name": "开平区"
          }, {
            "name": "丰南区"
          }, {
            "name": "丰润区"
          }, {
            "name": "曹妃甸区"
          }, {
            "name": "滦县"
          }, {
            "name": "滦南县"
          }, {
            "name": "乐亭县"
          }, {
            "name": "迁西县"
          }, {
            "name": "玉田县"
          }, {
            "name": "遵化市"
          }, {
            "name": "迁安市"
          }
        ]
      }, {
        "name": "秦皇岛市",
        "c": [
          {
            "name": "海港区"
          }, {
            "name": "山海关区"
          }, {
            "name": "北戴河区"
          }, {
            "name": "抚宁区"
          }, {
            "name": "青龙满族自治县"
          }, {
            "name": "昌黎县"
          }, {
            "name": "卢龙县"
          }
        ]
      }, {
        "name": "邯郸市",
        "c": [
          {
            "name": "邯山区"
          }, {
            "name": "丛台区"
          }, {
            "name": "复兴区"
          }, {
            "name": "峰峰矿区"
          }, {
            "name": "邯郸县"
          }, {
            "name": "临漳县"
          }, {
            "name": "成安县"
          }, {
            "name": "大名县"
          }, {
            "name": "涉县"
          }, {
            "name": "磁县"
          }, {
            "name": "肥乡县"
          }, {
            "name": "永年县"
          }, {
            "name": "邱县"
          }, {
            "name": "鸡泽县"
          }, {
            "name": "广平县"
          }, {
            "name": "馆陶县"
          }, {
            "name": "魏县"
          }, {
            "name": "曲周县"
          }, {
            "name": "武安市"
          }
        ]
      }, {
        "name": "邢台市",
        "c": [
          {
            "name": "桥东区"
          }, {
            "name": "桥西区"
          }, {
            "name": "邢台县"
          }, {
            "name": "临城县"
          }, {
            "name": "内丘县"
          }, {
            "name": "柏乡县"
          }, {
            "name": "隆尧县"
          }, {
            "name": "任县"
          }, {
            "name": "南和县"
          }, {
            "name": "宁晋县"
          }, {
            "name": "巨鹿县"
          }, {
            "name": "新河县"
          }, {
            "name": "广宗县"
          }, {
            "name": "平乡县"
          }, {
            "name": "威县"
          }, {
            "name": "清河县"
          }, {
            "name": "临西县"
          }, {
            "name": "南宫市"
          }, {
            "name": "沙河市"
          }
        ]
      }, {
        "name": "保定市",
        "c": [
          {
            "name": "竞秀区"
          }, {
            "name": "莲池区"
          }, {
            "name": "满城区"
          }, {
            "name": "清苑区"
          }, {
            "name": "徐水区"
          }, {
            "name": "涞水县"
          }, {
            "name": "阜平县"
          }, {
            "name": "定兴县"
          }, {
            "name": "唐县"
          }, {
            "name": "高阳县"
          }, {
            "name": "容城县"
          }, {
            "name": "涞源县"
          }, {
            "name": "望都县"
          }, {
            "name": "安新县"
          }, {
            "name": "易县"
          }, {
            "name": "曲阳县"
          }, {
            "name": "蠡县"
          }, {
            "name": "顺平县"
          }, {
            "name": "博野县"
          }, {
            "name": "雄县"
          }, {
            "name": "涿州市"
          }, {
            "name": "安国市"
          }, {
            "name": "高碑店市"
          }
        ]
      }, {
        "name": "张家口市",
        "c": [
          {
            "name": "桥东区"
          }, {
            "name": "桥西区"
          }, {
            "name": "宣化区"
          }, {
            "name": "下花园区"
          }, {
            "name": "万全区"
          }, {
            "name": "崇礼区"
          }, {
            "name": "张北县"
          }, {
            "name": "康保县"
          }, {
            "name": "沽源县"
          }, {
            "name": "尚义县"
          }, {
            "name": "蔚县"
          }, {
            "name": "阳原县"
          }, {
            "name": "怀安县"
          }, {
            "name": "怀来县"
          }, {
            "name": "涿鹿县"
          }, {
            "name": "赤城县"
          }
        ]
      }, {
        "name": "承德市",
        "c": [
          {
            "name": "双桥区"
          }, {
            "name": "双滦区"
          }, {
            "name": "鹰手营子矿区"
          }, {
            "name": "承德县"
          }, {
            "name": "兴隆县"
          }, {
            "name": "平泉县"
          }, {
            "name": "滦平县"
          }, {
            "name": "隆化县"
          }, {
            "name": "丰宁满族自治县"
          }, {
            "name": "宽城满族自治县"
          }, {
            "name": "围场满族蒙古族自治县"
          }
        ]
      }, {
        "name": "沧州市",
        "c": [
          {
            "name": "新华区"
          }, {
            "name": "运河区"
          }, {
            "name": "沧县"
          }, {
            "name": "青县"
          }, {
            "name": "东光县"
          }, {
            "name": "海兴县"
          }, {
            "name": "盐山县"
          }, {
            "name": "肃宁县"
          }, {
            "name": "南皮县"
          }, {
            "name": "吴桥县"
          }, {
            "name": "献县"
          }, {
            "name": "孟村回族自治县"
          }, {
            "name": "泊头市"
          }, {
            "name": "任丘市"
          }, {
            "name": "黄骅市"
          }, {
            "name": "河间市"
          }
        ]
      }, {
        "name": "廊坊市",
        "c": [
          {
            "name": "安次区"
          }, {
            "name": "广阳区"
          }, {
            "name": "固安县"
          }, {
            "name": "永清县"
          }, {
            "name": "香河县"
          }, {
            "name": "大城县"
          }, {
            "name": "文安县"
          }, {
            "name": "大厂回族自治县"
          }, {
            "name": "霸州市"
          }, {
            "name": "三河市"
          }
        ]
      }, {
        "name": "衡水市",
        "c": [
          {
            "name": "桃城区"
          }, {
            "name": "冀州区"
          }, {
            "name": "枣强县"
          }, {
            "name": "武邑县"
          }, {
            "name": "武强县"
          }, {
            "name": "饶阳县"
          }, {
            "name": "安平县"
          }, {
            "name": "故城县"
          }, {
            "name": "景县"
          }, {
            "name": "阜城县"
          }, {
            "name": "深州市"
          }
        ]
      }, {
        "name": "定州市",
        "c": []
      }, {
        "name": "辛集市",
        "c": []
      }
    ]
  }, {
    "name": "山西省",
    "c": [
      {
        "name": "太原市",
        "c": [
          {
            "name": "小店区"
          }, {
            "name": "迎泽区"
          }, {
            "name": "杏花岭区"
          }, {
            "name": "尖草坪区"
          }, {
            "name": "万柏林区"
          }, {
            "name": "晋源区"
          }, {
            "name": "清徐县"
          }, {
            "name": "阳曲县"
          }, {
            "name": "娄烦县"
          }, {
            "name": "古交市"
          }
        ]
      }, {
        "name": "大同市",
        "c": [
          {
            "name": "城区"
          }, {
            "name": "矿区"
          }, {
            "name": "南郊区"
          }, {
            "name": "新荣区"
          }, {
            "name": "阳高县"
          }, {
            "name": "天镇县"
          }, {
            "name": "广灵县"
          }, {
            "name": "灵丘县"
          }, {
            "name": "浑源县"
          }, {
            "name": "左云县"
          }, {
            "name": "大同县"
          }
        ]
      }, {
        "name": "阳泉市",
        "c": [
          {
            "name": "城区"
          }, {
            "name": "矿区"
          }, {
            "name": "郊区"
          }, {
            "name": "平定县"
          }, {
            "name": "盂县"
          }
        ]
      }, {
        "name": "长治市",
        "c": [
          {
            "name": "城区"
          }, {
            "name": "郊区"
          }, {
            "name": "长治县"
          }, {
            "name": "襄垣县"
          }, {
            "name": "屯留县"
          }, {
            "name": "平顺县"
          }, {
            "name": "黎城县"
          }, {
            "name": "壶关县"
          }, {
            "name": "长子县"
          }, {
            "name": "武乡县"
          }, {
            "name": "沁县"
          }, {
            "name": "沁源县"
          }, {
            "name": "潞城市"
          }
        ]
      }, {
        "name": "晋城市",
        "c": [
          {
            "name": "城区"
          }, {
            "name": "沁水县"
          }, {
            "name": "阳城县"
          }, {
            "name": "陵川县"
          }, {
            "name": "泽州县"
          }, {
            "name": "高平市"
          }
        ]
      }, {
        "name": "朔州市",
        "c": [
          {
            "name": "朔城区"
          }, {
            "name": "平鲁区"
          }, {
            "name": "山阴县"
          }, {
            "name": "应县"
          }, {
            "name": "右玉县"
          }, {
            "name": "怀仁县"
          }
        ]
      }, {
        "name": "晋中市",
        "c": [
          {
            "name": "榆次区"
          }, {
            "name": "榆社县"
          }, {
            "name": "左权县"
          }, {
            "name": "和顺县"
          }, {
            "name": "昔阳县"
          }, {
            "name": "寿阳县"
          }, {
            "name": "太谷县"
          }, {
            "name": "祁县"
          }, {
            "name": "平遥县"
          }, {
            "name": "灵石县"
          }, {
            "name": "介休市"
          }
        ]
      }, {
        "name": "运城市",
        "c": [
          {
            "name": "盐湖区"
          }, {
            "name": "临猗县"
          }, {
            "name": "万荣县"
          }, {
            "name": "闻喜县"
          }, {
            "name": "稷山县"
          }, {
            "name": "新绛县"
          }, {
            "name": "绛县"
          }, {
            "name": "垣曲县"
          }, {
            "name": "夏县"
          }, {
            "name": "平陆县"
          }, {
            "name": "芮城县"
          }, {
            "name": "永济市"
          }, {
            "name": "河津市"
          }
        ]
      }, {
        "name": "忻州市",
        "c": [
          {
            "name": "忻府区"
          }, {
            "name": "定襄县"
          }, {
            "name": "五台县"
          }, {
            "name": "代县"
          }, {
            "name": "繁峙县"
          }, {
            "name": "宁武县"
          }, {
            "name": "静乐县"
          }, {
            "name": "神池县"
          }, {
            "name": "五寨县"
          }, {
            "name": "岢岚县"
          }, {
            "name": "河曲县"
          }, {
            "name": "保德县"
          }, {
            "name": "偏关县"
          }, {
            "name": "原平市"
          }
        ]
      }, {
        "name": "临汾市",
        "c": [
          {
            "name": "尧都区"
          }, {
            "name": "曲沃县"
          }, {
            "name": "翼城县"
          }, {
            "name": "襄汾县"
          }, {
            "name": "洪洞县"
          }, {
            "name": "古县"
          }, {
            "name": "安泽县"
          }, {
            "name": "浮山县"
          }, {
            "name": "吉县"
          }, {
            "name": "乡宁县"
          }, {
            "name": "大宁县"
          }, {
            "name": "隰县"
          }, {
            "name": "永和县"
          }, {
            "name": "蒲县"
          }, {
            "name": "汾西县"
          }, {
            "name": "侯马市"
          }, {
            "name": "霍州市"
          }
        ]
      }, {
        "name": "吕梁市",
        "c": [
          {
            "name": "离石区"
          }, {
            "name": "文水县"
          }, {
            "name": "交城县"
          }, {
            "name": "兴县"
          }, {
            "name": "临县"
          }, {
            "name": "柳林县"
          }, {
            "name": "石楼县"
          }, {
            "name": "岚县"
          }, {
            "name": "方山县"
          }, {
            "name": "中阳县"
          }, {
            "name": "交口县"
          }, {
            "name": "孝义市"
          }, {
            "name": "汾阳市"
          }
        ]
      }
    ]
  }, {
    "name": "内蒙古自治区",
    "c": [
      {
        "name": "呼和浩特市",
        "c": [
          {
            "name": "新城区"
          }, {
            "name": "回民区"
          }, {
            "name": "玉泉区"
          }, {
            "name": "赛罕区"
          }, {
            "name": "土默特左旗"
          }, {
            "name": "托克托县"
          }, {
            "name": "和林格尔县"
          }, {
            "name": "清水河县"
          }, {
            "name": "武川县"
          }
        ]
      }, {
        "name": "包头市",
        "c": [
          {
            "name": "东河区"
          }, {
            "name": "昆都仑区"
          }, {
            "name": "青山区"
          }, {
            "name": "石拐区"
          }, {
            "name": "白云鄂博矿区"
          }, {
            "name": "九原区"
          }, {
            "name": "土默特右旗"
          }, {
            "name": "固阳县"
          }, {
            "name": "达尔罕茂明安联合旗"
          }
        ]
      }, {
        "name": "乌海市",
        "c": [
          {
            "name": "海勃湾区"
          }, {
            "name": "海南区"
          }, {
            "name": "乌达区"
          }
        ]
      }, {
        "name": "赤峰市",
        "c": [
          {
            "name": "红山区"
          }, {
            "name": "元宝山区"
          }, {
            "name": "松山区"
          }, {
            "name": "阿鲁科尔沁旗"
          }, {
            "name": "巴林左旗"
          }, {
            "name": "巴林右旗"
          }, {
            "name": "林西县"
          }, {
            "name": "克什克腾旗"
          }, {
            "name": "翁牛特旗"
          }, {
            "name": "喀喇沁旗"
          }, {
            "name": "宁城县"
          }, {
            "name": "敖汉旗"
          }
        ]
      }, {
        "name": "通辽市",
        "c": [
          {
            "name": "科尔沁区"
          }, {
            "name": "科尔沁左翼中旗"
          }, {
            "name": "科尔沁左翼后旗"
          }, {
            "name": "开鲁县"
          }, {
            "name": "库伦旗"
          }, {
            "name": "奈曼旗"
          }, {
            "name": "扎鲁特旗"
          }, {
            "name": "霍林郭勒市"
          }
        ]
      }, {
        "name": "鄂尔多斯市",
        "c": [
          {
            "name": "东胜区"
          }, {
            "name": "达拉特旗"
          }, {
            "name": "准格尔旗"
          }, {
            "name": "鄂托克前旗"
          }, {
            "name": "鄂托克旗"
          }, {
            "name": "杭锦旗"
          }, {
            "name": "乌审旗"
          }, {
            "name": "伊金霍洛旗"
          }
        ]
      }, {
        "name": "呼伦贝尔市",
        "c": [
          {
            "name": "海拉尔区"
          }, {
            "name": "扎赉诺尔区"
          }, {
            "name": "阿荣旗"
          }, {
            "name": "莫力达瓦达斡尔族自治旗"
          }, {
            "name": "鄂伦春自治旗"
          }, {
            "name": "鄂温克族自治旗"
          }, {
            "name": "陈巴尔虎旗"
          }, {
            "name": "新巴尔虎左旗"
          }, {
            "name": "新巴尔虎右旗"
          }, {
            "name": "满洲里市"
          }, {
            "name": "牙克石市"
          }, {
            "name": "扎兰屯市"
          }, {
            "name": "额尔古纳市"
          }, {
            "name": "根河市"
          }
        ]
      }, {
        "name": "巴彦淖尔市",
        "c": [
          {
            "name": "临河区"
          }, {
            "name": "五原县"
          }, {
            "name": "磴口县"
          }, {
            "name": "乌拉特前旗"
          }, {
            "name": "乌拉特中旗"
          }, {
            "name": "乌拉特后旗"
          }, {
            "name": "杭锦后旗"
          }
        ]
      }, {
        "name": "乌兰察布市",
        "c": [
          {
            "name": "集宁区"
          }, {
            "name": "卓资县"
          }, {
            "name": "化德县"
          }, {
            "name": "商都县"
          }, {
            "name": "兴和县"
          }, {
            "name": "凉城县"
          }, {
            "name": "察哈尔右翼前旗"
          }, {
            "name": "察哈尔右翼中旗"
          }, {
            "name": "察哈尔右翼后旗"
          }, {
            "name": "四子王旗"
          }, {
            "name": "丰镇市"
          }
        ]
      }, {
        "name": "兴安盟",
        "c": [
          {
            "name": "乌兰浩特市"
          }, {
            "name": "阿尔山市"
          }, {
            "name": "科尔沁右翼前旗"
          }, {
            "name": "科尔沁右翼中旗"
          }, {
            "name": "扎赉特旗"
          }, {
            "name": "突泉县"
          }
        ]
      }, {
        "name": "锡林郭勒盟",
        "c": [
          {
            "name": "二连浩特市"
          }, {
            "name": "锡林浩特市"
          }, {
            "name": "阿巴嘎旗"
          }, {
            "name": "苏尼特左旗"
          }, {
            "name": "苏尼特右旗"
          }, {
            "name": "东乌珠穆沁旗"
          }, {
            "name": "西乌珠穆沁旗"
          }, {
            "name": "太仆寺旗"
          }, {
            "name": "镶黄旗"
          }, {
            "name": "正镶白旗"
          }, {
            "name": "正蓝旗"
          }, {
            "name": "多伦县"
          }
        ]
      }, {
        "name": "阿拉善盟",
        "c": [
          {
            "name": "阿拉善左旗"
          }, {
            "name": "阿拉善右旗"
          }, {
            "name": "额济纳旗"
          }
        ]
      }
    ]
  }, {
    "name": "辽宁省",
    "c": [
      {
        "name": "沈阳市",
        "c": [
          {
            "name": "和平区"
          }, {
            "name": "沈河区"
          }, {
            "name": "大东区"
          }, {
            "name": "皇姑区"
          }, {
            "name": "铁西区"
          }, {
            "name": "苏家屯区"
          }, {
            "name": "浑南区"
          }, {
            "name": "沈北新区"
          }, {
            "name": "于洪区"
          }, {
            "name": "辽中区"
          }, {
            "name": "康平县"
          }, {
            "name": "法库县"
          }, {
            "name": "新民市"
          }
        ]
      }, {
        "name": "大连市",
        "c": [
          {
            "name": "中山区"
          }, {
            "name": "西岗区"
          }, {
            "name": "沙河口区"
          }, {
            "name": "甘井子区"
          }, {
            "name": "旅顺口区"
          }, {
            "name": "金州区"
          }, {
            "name": "普兰店区"
          }, {
            "name": "长海县"
          }, {
            "name": "瓦房店市"
          }, {
            "name": "庄河市"
          }
        ]
      }, {
        "name": "鞍山市",
        "c": [
          {
            "name": "铁东区"
          }, {
            "name": "铁西区"
          }, {
            "name": "立山区"
          }, {
            "name": "千山区"
          }, {
            "name": "台安县"
          }, {
            "name": "岫岩满族自治县"
          }, {
            "name": "海城市"
          }
        ]
      }, {
        "name": "抚顺市",
        "c": [
          {
            "name": "新抚区"
          }, {
            "name": "东洲区"
          }, {
            "name": "望花区"
          }, {
            "name": "顺城区"
          }, {
            "name": "抚顺县"
          }, {
            "name": "新宾满族自治县"
          }, {
            "name": "清原满族自治县"
          }
        ]
      }, {
        "name": "本溪市",
        "c": [
          {
            "name": "平山区"
          }, {
            "name": "溪湖区"
          }, {
            "name": "明山区"
          }, {
            "name": "南芬区"
          }, {
            "name": "本溪满族自治县"
          }, {
            "name": "桓仁满族自治县"
          }
        ]
      }, {
        "name": "丹东市",
        "c": [
          {
            "name": "元宝区"
          }, {
            "name": "振兴区"
          }, {
            "name": "振安区"
          }, {
            "name": "宽甸满族自治县"
          }, {
            "name": "东港市"
          }, {
            "name": "凤城市"
          }
        ]
      }, {
        "name": "锦州市",
        "c": [
          {
            "name": "古塔区"
          }, {
            "name": "凌河区"
          }, {
            "name": "太和区"
          }, {
            "name": "黑山县"
          }, {
            "name": "义县"
          }, {
            "name": "凌海市"
          }, {
            "name": "北镇市"
          }
        ]
      }, {
        "name": "营口市",
        "c": [
          {
            "name": "站前区"
          }, {
            "name": "西市区"
          }, {
            "name": "鲅鱼圈区"
          }, {
            "name": "老边区"
          }, {
            "name": "盖州市"
          }, {
            "name": "大石桥市"
          }
        ]
      }, {
        "name": "阜新市",
        "c": [
          {
            "name": "海州区"
          }, {
            "name": "新邱区"
          }, {
            "name": "太平区"
          }, {
            "name": "清河门区"
          }, {
            "name": "细河区"
          }, {
            "name": "阜新蒙古族自治县"
          }, {
            "name": "彰武县"
          }
        ]
      }, {
        "name": "辽阳市",
        "c": [
          {
            "name": "白塔区"
          }, {
            "name": "文圣区"
          }, {
            "name": "宏伟区"
          }, {
            "name": "弓长岭区"
          }, {
            "name": "太子河区"
          }, {
            "name": "辽阳县"
          }, {
            "name": "灯塔市"
          }
        ]
      }, {
        "name": "盘锦市",
        "c": [
          {
            "name": "双台子区"
          }, {
            "name": "兴隆台区"
          }, {
            "name": "大洼区"
          }, {
            "name": "盘山县"
          }
        ]
      }, {
        "name": "铁岭市",
        "c": [
          {
            "name": "银州区"
          }, {
            "name": "清河区"
          }, {
            "name": "铁岭县"
          }, {
            "name": "西丰县"
          }, {
            "name": "昌图县"
          }, {
            "name": "调兵山市"
          }, {
            "name": "开原市"
          }
        ]
      }, {
        "name": "朝阳市",
        "c": [
          {
            "name": "双塔区"
          }, {
            "name": "龙城区"
          }, {
            "name": "朝阳县"
          }, {
            "name": "建平县"
          }, {
            "name": "喀喇沁左翼蒙古族自治县"
          }, {
            "name": "北票市"
          }, {
            "name": "凌源市"
          }
        ]
      }, {
        "name": "葫芦岛市",
        "c": [
          {
            "name": "连山区"
          }, {
            "name": "龙港区"
          }, {
            "name": "南票区"
          }, {
            "name": "绥中县"
          }, {
            "name": "建昌县"
          }, {
            "name": "兴城市"
          }
        ]
      }
    ]
  }, {
    "name": "吉林省",
    "c": [
      {
        "name": "长春市",
        "c": [
          {
            "name": "南关区"
          }, {
            "name": "宽城区"
          }, {
            "name": "朝阳区"
          }, {
            "name": "二道区"
          }, {
            "name": "绿园区"
          }, {
            "name": "双阳区"
          }, {
            "name": "九台区"
          }, {
            "name": "农安县"
          }, {
            "name": "榆树市"
          }, {
            "name": "德惠市"
          }
        ]
      }, {
        "name": "吉林市",
        "c": [
          {
            "name": "昌邑区"
          }, {
            "name": "龙潭区"
          }, {
            "name": "船营区"
          }, {
            "name": "丰满区"
          }, {
            "name": "永吉县"
          }, {
            "name": "蛟河市"
          }, {
            "name": "桦甸市"
          }, {
            "name": "舒兰市"
          }, {
            "name": "磐石市"
          }
        ]
      }, {
        "name": "四平市",
        "c": [
          {
            "name": "铁西区"
          }, {
            "name": "铁东区"
          }, {
            "name": "梨树县"
          }, {
            "name": "伊通满族自治县"
          }, {
            "name": "公主岭市"
          }, {
            "name": "双辽市"
          }
        ]
      }, {
        "name": "辽源市",
        "c": [
          {
            "name": "龙山区"
          }, {
            "name": "西安区"
          }, {
            "name": "东丰县"
          }, {
            "name": "东辽县"
          }
        ]
      }, {
        "name": "通化市",
        "c": [
          {
            "name": "东昌区"
          }, {
            "name": "二道江区"
          }, {
            "name": "通化县"
          }, {
            "name": "辉南县"
          }, {
            "name": "柳河县"
          }, {
            "name": "梅河口市"
          }, {
            "name": "集安市"
          }
        ]
      }, {
        "name": "白山市",
        "c": [
          {
            "name": "浑江区"
          }, {
            "name": "江源区"
          }, {
            "name": "抚松县"
          }, {
            "name": "靖宇县"
          }, {
            "name": "长白朝鲜族自治县"
          }, {
            "name": "临江市"
          }
        ]
      }, {
        "name": "松原市",
        "c": [
          {
            "name": "宁江区"
          }, {
            "name": "前郭尔罗斯蒙古族自治县"
          }, {
            "name": "长岭县"
          }, {
            "name": "乾安县"
          }, {
            "name": "扶余市"
          }
        ]
      }, {
        "name": "白城市",
        "c": [
          {
            "name": "洮北区"
          }, {
            "name": "镇赉县"
          }, {
            "name": "通榆县"
          }, {
            "name": "洮南市"
          }, {
            "name": "大安市"
          }
        ]
      }, {
        "name": "延边朝鲜族自治州",
        "c": [
          {
            "name": "延吉市"
          }, {
            "name": "图们市"
          }, {
            "name": "敦化市"
          }, {
            "name": "珲春市"
          }, {
            "name": "龙井市"
          }, {
            "name": "和龙市"
          }, {
            "name": "汪清县"
          }, {
            "name": "安图县"
          }
        ]
      }
    ]
  }, {
    "name": "黑龙江省",
    "c": [
      {
        "name": "哈尔滨市",
        "c": [
          {
            "name": "道里区"
          }, {
            "name": "南岗区"
          }, {
            "name": "道外区"
          }, {
            "name": "平房区"
          }, {
            "name": "松北区"
          }, {
            "name": "香坊区"
          }, {
            "name": "呼兰区"
          }, {
            "name": "阿城区"
          }, {
            "name": "双城区"
          }, {
            "name": "依兰县"
          }, {
            "name": "方正县"
          }, {
            "name": "宾县"
          }, {
            "name": "巴彦县"
          }, {
            "name": "木兰县"
          }, {
            "name": "通河县"
          }, {
            "name": "延寿县"
          }, {
            "name": "尚志市"
          }, {
            "name": "五常市"
          }
        ]
      }, {
        "name": "齐齐哈尔市",
        "c": [
          {
            "name": "龙沙区"
          }, {
            "name": "建华区"
          }, {
            "name": "铁锋区"
          }, {
            "name": "昂昂溪区"
          }, {
            "name": "富拉尔基区"
          }, {
            "name": "碾子山区"
          }, {
            "name": "梅里斯达斡尔族区"
          }, {
            "name": "龙江县"
          }, {
            "name": "依安县"
          }, {
            "name": "泰来县"
          }, {
            "name": "甘南县"
          }, {
            "name": "富裕县"
          }, {
            "name": "克山县"
          }, {
            "name": "克东县"
          }, {
            "name": "拜泉县"
          }, {
            "name": "讷河市"
          }
        ]
      }, {
        "name": "鸡西市",
        "c": [
          {
            "name": "鸡冠区"
          }, {
            "name": "恒山区"
          }, {
            "name": "滴道区"
          }, {
            "name": "梨树区"
          }, {
            "name": "城子河区"
          }, {
            "name": "麻山区"
          }, {
            "name": "鸡东县"
          }, {
            "name": "虎林市"
          }, {
            "name": "密山市"
          }
        ]
      }, {
        "name": "鹤岗市",
        "c": [
          {
            "name": "向阳区"
          }, {
            "name": "工农区"
          }, {
            "name": "南山区"
          }, {
            "name": "兴安区"
          }, {
            "name": "东山区"
          }, {
            "name": "兴山区"
          }, {
            "name": "萝北县"
          }, {
            "name": "绥滨县"
          }
        ]
      }, {
        "name": "双鸭山市",
        "c": [
          {
            "name": "尖山区"
          }, {
            "name": "岭东区"
          }, {
            "name": "四方台区"
          }, {
            "name": "宝山区"
          }, {
            "name": "集贤县"
          }, {
            "name": "友谊县"
          }, {
            "name": "宝清县"
          }, {
            "name": "饶河县"
          }
        ]
      }, {
        "name": "大庆市",
        "c": [
          {
            "name": "萨尔图区"
          }, {
            "name": "龙凤区"
          }, {
            "name": "让胡路区"
          }, {
            "name": "红岗区"
          }, {
            "name": "大同区"
          }, {
            "name": "肇州县"
          }, {
            "name": "肇源县"
          }, {
            "name": "林甸县"
          }, {
            "name": "杜尔伯特蒙古族自治县"
          }
        ]
      }, {
        "name": "伊春市",
        "c": [
          {
            "name": "伊春区"
          }, {
            "name": "南岔区"
          }, {
            "name": "友好区"
          }, {
            "name": "西林区"
          }, {
            "name": "翠峦区"
          }, {
            "name": "新青区"
          }, {
            "name": "美溪区"
          }, {
            "name": "金山屯区"
          }, {
            "name": "五营区"
          }, {
            "name": "乌马河区"
          }, {
            "name": "汤旺河区"
          }, {
            "name": "带岭区"
          }, {
            "name": "乌伊岭区"
          }, {
            "name": "红星区"
          }, {
            "name": "上甘岭区"
          }, {
            "name": "嘉荫县"
          }, {
            "name": "铁力市"
          }
        ]
      }, {
        "name": "佳木斯市",
        "c": [
          {
            "name": "向阳区"
          }, {
            "name": "前进区"
          }, {
            "name": "东风区"
          }, {
            "name": "郊区"
          }, {
            "name": "桦南县"
          }, {
            "name": "桦川县"
          }, {
            "name": "汤原县"
          }, {
            "name": "抚远市"
          }, {
            "name": "同江市"
          }, {
            "name": "富锦市"
          }
        ]
      }, {
        "name": "七台河市",
        "c": [
          {
            "name": "新兴区"
          }, {
            "name": "桃山区"
          }, {
            "name": "茄子河区"
          }, {
            "name": "勃利县"
          }
        ]
      }, {
        "name": "牡丹江市",
        "c": [
          {
            "name": "东安区"
          }, {
            "name": "阳明区"
          }, {
            "name": "爱民区"
          }, {
            "name": "西安区"
          }, {
            "name": "林口县"
          }, {
            "name": "绥芬河市"
          }, {
            "name": "海林市"
          }, {
            "name": "宁安市"
          }, {
            "name": "穆棱市"
          }, {
            "name": "东宁市"
          }
        ]
      }, {
        "name": "黑河市",
        "c": [
          {
            "name": "爱辉区"
          }, {
            "name": "嫩江县"
          }, {
            "name": "逊克县"
          }, {
            "name": "孙吴县"
          }, {
            "name": "北安市"
          }, {
            "name": "五大连池市"
          }
        ]
      }, {
        "name": "绥化市",
        "c": [
          {
            "name": "北林区"
          }, {
            "name": "望奎县"
          }, {
            "name": "兰西县"
          }, {
            "name": "青冈县"
          }, {
            "name": "庆安县"
          }, {
            "name": "明水县"
          }, {
            "name": "绥棱县"
          }, {
            "name": "安达市"
          }, {
            "name": "肇东市"
          }, {
            "name": "海伦市"
          }
        ]
      }, {
        "name": "大兴安岭地区",
        "c": [
          {
            "name": "呼玛县"
          }, {
            "name": "塔河县"
          }, {
            "name": "漠河县"
          }
        ]
      }
    ]
  }, {
    "name": "上海市",
    "c": [
      {
        "name": "黄浦区",
        "c": []
      }, {
        "name": "徐汇区",
        "c": []
      }, {
        "name": "长宁区",
        "c": []
      }, {
        "name": "静安区",
        "c": []
      }, {
        "name": "普陀区",
        "c": []
      }, {
        "name": "虹口区",
        "c": []
      }, {
        "name": "杨浦区",
        "c": []
      }, {
        "name": "闵行区",
        "c": []
      }, {
        "name": "宝山区",
        "c": []
      }, {
        "name": "嘉定区",
        "c": []
      }, {
        "name": "浦东新区",
        "c": []
      }, {
        "name": "金山区",
        "c": []
      }, {
        "name": "松江区",
        "c": []
      }, {
        "name": "青浦区",
        "c": []
      }, {
        "name": "奉贤区",
        "c": []
      }, {
        "name": "崇明区",
        "c": []
      }
    ]
  }, {
    "name": "江苏省",
    "c": [
      {
        "name": "南京市",
        "c": [
          {
            "name": "玄武区"
          }, {
            "name": "秦淮区"
          }, {
            "name": "建邺区"
          }, {
            "name": "鼓楼区"
          }, {
            "name": "浦口区"
          }, {
            "name": "栖霞区"
          }, {
            "name": "雨花台区"
          }, {
            "name": "江宁区"
          }, {
            "name": "六合区"
          }, {
            "name": "溧水区"
          }, {
            "name": "高淳区"
          }
        ]
      }, {
        "name": "无锡市",
        "c": [
          {
            "name": "锡山区"
          }, {
            "name": "惠山区"
          }, {
            "name": "滨湖区"
          }, {
            "name": "梁溪区"
          }, {
            "name": "新吴区"
          }, {
            "name": "江阴市"
          }, {
            "name": "宜兴市"
          }
        ]
      }, {
        "name": "徐州市",
        "c": [
          {
            "name": "鼓楼区"
          }, {
            "name": "云龙区"
          }, {
            "name": "贾汪区"
          }, {
            "name": "泉山区"
          }, {
            "name": "铜山区"
          }, {
            "name": "丰县"
          }, {
            "name": "沛县"
          }, {
            "name": "睢宁县"
          }, {
            "name": "新沂市"
          }, {
            "name": "邳州市"
          }
        ]
      }, {
        "name": "常州市",
        "c": [
          {
            "name": "天宁区"
          }, {
            "name": "钟楼区"
          }, {
            "name": "新北区"
          }, {
            "name": "武进区"
          }, {
            "name": "金坛区"
          }, {
            "name": "溧阳市"
          }
        ]
      }, {
        "name": "苏州市",
        "c": [
          {
            "name": "虎丘区"
          }, {
            "name": "吴中区"
          }, {
            "name": "相城区"
          }, {
            "name": "姑苏区"
          }, {
            "name": "吴江区"
          }, {
            "name": "常熟市"
          }, {
            "name": "张家港市"
          }, {
            "name": "昆山市"
          }, {
            "name": "太仓市"
          }
        ]
      }, {
        "name": "南通市",
        "c": [
          {
            "name": "崇川区"
          }, {
            "name": "港闸区"
          }, {
            "name": "通州区"
          }, {
            "name": "海安县"
          }, {
            "name": "如东县"
          }, {
            "name": "启东市"
          }, {
            "name": "如皋市"
          }, {
            "name": "海门市"
          }
        ]
      }, {
        "name": "连云港市",
        "c": [
          {
            "name": "连云区"
          }, {
            "name": "海州区"
          }, {
            "name": "赣榆区"
          }, {
            "name": "东海县"
          }, {
            "name": "灌云县"
          }, {
            "name": "灌南县"
          }
        ]
      }, {
        "name": "淮安市",
        "c": [
          {
            "name": "淮安区"
          }, {
            "name": "淮阴区"
          }, {
            "name": "清江浦区"
          }, {
            "name": "洪泽区"
          }, {
            "name": "涟水县"
          }, {
            "name": "盱眙县"
          }, {
            "name": "金湖县"
          }
        ]
      }, {
        "name": "盐城市",
        "c": [
          {
            "name": "亭湖区"
          }, {
            "name": "盐都区"
          }, {
            "name": "大丰区"
          }, {
            "name": "响水县"
          }, {
            "name": "滨海县"
          }, {
            "name": "阜宁县"
          }, {
            "name": "射阳县"
          }, {
            "name": "建湖县"
          }, {
            "name": "东台市"
          }
        ]
      }, {
        "name": "扬州市",
        "c": [
          {
            "name": "广陵区"
          }, {
            "name": "邗江区"
          }, {
            "name": "江都区"
          }, {
            "name": "宝应县"
          }, {
            "name": "仪征市"
          }, {
            "name": "高邮市"
          }
        ]
      }, {
        "name": "镇江市",
        "c": [
          {
            "name": "京口区"
          }, {
            "name": "润州区"
          }, {
            "name": "丹徒区"
          }, {
            "name": "丹阳市"
          }, {
            "name": "扬中市"
          }, {
            "name": "句容市"
          }
        ]
      }, {
        "name": "泰州市",
        "c": [
          {
            "name": "海陵区"
          }, {
            "name": "高港区"
          }, {
            "name": "姜堰区"
          }, {
            "name": "兴化市"
          }, {
            "name": "靖江市"
          }, {
            "name": "泰兴市"
          }
        ]
      }, {
        "name": "宿迁市",
        "c": [
          {
            "name": "宿城区"
          }, {
            "name": "宿豫区"
          }, {
            "name": "沭阳县"
          }, {
            "name": "泗阳县"
          }, {
            "name": "泗洪县"
          }
        ]
      }
    ]
  }, {
    "name": "浙江省",
    "c": [
      {
        "name": "杭州市",
        "c": [
          {
            "name": "上城区"
          }, {
            "name": "下城区"
          }, {
            "name": "江干区"
          }, {
            "name": "拱墅区"
          }, {
            "name": "西湖区"
          }, {
            "name": "滨江区"
          }, {
            "name": "萧山区"
          }, {
            "name": "余杭区"
          }, {
            "name": "富阳区"
          }, {
            "name": "桐庐县"
          }, {
            "name": "淳安县"
          }, {
            "name": "建德市"
          }, {
            "name": "临安市"
          }
        ]
      }, {
        "name": "宁波市",
        "c": [
          {
            "name": "海曙区"
          }, {
            "name": "江东区"
          }, {
            "name": "江北区"
          }, {
            "name": "北仑区"
          }, {
            "name": "镇海区"
          }, {
            "name": "鄞州区"
          }, {
            "name": "象山县"
          }, {
            "name": "宁海县"
          }, {
            "name": "余姚市"
          }, {
            "name": "慈溪市"
          }, {
            "name": "奉化市"
          }
        ]
      }, {
        "name": "温州市",
        "c": [
          {
            "name": "鹿城区"
          }, {
            "name": "龙湾区"
          }, {
            "name": "瓯海区"
          }, {
            "name": "洞头区"
          }, {
            "name": "永嘉县"
          }, {
            "name": "平阳县"
          }, {
            "name": "苍南县"
          }, {
            "name": "文成县"
          }, {
            "name": "泰顺县"
          }, {
            "name": "瑞安市"
          }, {
            "name": "乐清市"
          }
        ]
      }, {
        "name": "嘉兴市",
        "c": [
          {
            "name": "南湖区"
          }, {
            "name": "秀洲区"
          }, {
            "name": "嘉善县"
          }, {
            "name": "海盐县"
          }, {
            "name": "海宁市"
          }, {
            "name": "平湖市"
          }, {
            "name": "桐乡市"
          }
        ]
      }, {
        "name": "湖州市",
        "c": [
          {
            "name": "吴兴区"
          }, {
            "name": "南浔区"
          }, {
            "name": "德清县"
          }, {
            "name": "长兴县"
          }, {
            "name": "安吉县"
          }
        ]
      }, {
        "name": "绍兴市",
        "c": [
          {
            "name": "越城区"
          }, {
            "name": "柯桥区"
          }, {
            "name": "上虞区"
          }, {
            "name": "新昌县"
          }, {
            "name": "诸暨市"
          }, {
            "name": "嵊州市"
          }
        ]
      }, {
        "name": "金华市",
        "c": [
          {
            "name": "婺城区"
          }, {
            "name": "金东区"
          }, {
            "name": "武义县"
          }, {
            "name": "浦江县"
          }, {
            "name": "磐安县"
          }, {
            "name": "兰溪市"
          }, {
            "name": "义乌市"
          }, {
            "name": "东阳市"
          }, {
            "name": "永康市"
          }
        ]
      }, {
        "name": "衢州市",
        "c": [
          {
            "name": "柯城区"
          }, {
            "name": "衢江区"
          }, {
            "name": "常山县"
          }, {
            "name": "开化县"
          }, {
            "name": "龙游县"
          }, {
            "name": "江山市"
          }
        ]
      }, {
        "name": "舟山市",
        "c": [
          {
            "name": "定海区"
          }, {
            "name": "普陀区"
          }, {
            "name": "岱山县"
          }, {
            "name": "嵊泗县"
          }
        ]
      }, {
        "name": "台州市",
        "c": [
          {
            "name": "椒江区"
          }, {
            "name": "黄岩区"
          }, {
            "name": "路桥区"
          }, {
            "name": "玉环县"
          }, {
            "name": "三门县"
          }, {
            "name": "天台县"
          }, {
            "name": "仙居县"
          }, {
            "name": "温岭市"
          }, {
            "name": "临海市"
          }
        ]
      }, {
        "name": "丽水市",
        "c": [
          {
            "name": "莲都区"
          }, {
            "name": "青田县"
          }, {
            "name": "缙云县"
          }, {
            "name": "遂昌县"
          }, {
            "name": "松阳县"
          }, {
            "name": "云和县"
          }, {
            "name": "庆元县"
          }, {
            "name": "景宁畲族自治县"
          }, {
            "name": "龙泉市"
          }
        ]
      }
    ]
  }, {
    "name": "安徽省",
    "c": [
      {
        "name": "合肥市",
        "c": [
          {
            "name": "瑶海区"
          }, {
            "name": "庐阳区"
          }, {
            "name": "蜀山区"
          }, {
            "name": "包河区"
          }, {
            "name": "长丰县"
          }, {
            "name": "肥东县"
          }, {
            "name": "肥西县"
          }, {
            "name": "庐江县"
          }, {
            "name": "巢湖市"
          }
        ]
      }, {
        "name": "芜湖市",
        "c": [
          {
            "name": "镜湖区"
          }, {
            "name": "弋江区"
          }, {
            "name": "鸠江区"
          }, {
            "name": "三山区"
          }, {
            "name": "芜湖县"
          }, {
            "name": "繁昌县"
          }, {
            "name": "南陵县"
          }, {
            "name": "无为县"
          }
        ]
      }, {
        "name": "蚌埠市",
        "c": [
          {
            "name": "龙子湖区"
          }, {
            "name": "蚌山区"
          }, {
            "name": "禹会区"
          }, {
            "name": "淮上区"
          }, {
            "name": "怀远县"
          }, {
            "name": "五河县"
          }, {
            "name": "固镇县"
          }
        ]
      }, {
        "name": "淮南市",
        "c": [
          {
            "name": "大通区"
          }, {
            "name": "田家庵区"
          }, {
            "name": "谢家集区"
          }, {
            "name": "八公山区"
          }, {
            "name": "潘集区"
          }, {
            "name": "凤台县"
          }, {
            "name": "寿县"
          }
        ]
      }, {
        "name": "马鞍山市",
        "c": [
          {
            "name": "花山区"
          }, {
            "name": "雨山区"
          }, {
            "name": "博望区"
          }, {
            "name": "当涂县"
          }, {
            "name": "含山县"
          }, {
            "name": "和县"
          }
        ]
      }, {
        "name": "淮北市",
        "c": [
          {
            "name": "杜集区"
          }, {
            "name": "相山区"
          }, {
            "name": "烈山区"
          }, {
            "name": "濉溪县"
          }
        ]
      }, {
        "name": "铜陵市",
        "c": [
          {
            "name": "铜官区"
          }, {
            "name": "义安区"
          }, {
            "name": "郊区"
          }, {
            "name": "枞阳县"
          }
        ]
      }, {
        "name": "安庆市",
        "c": [
          {
            "name": "迎江区"
          }, {
            "name": "大观区"
          }, {
            "name": "宜秀区"
          }, {
            "name": "怀宁县"
          }, {
            "name": "潜山县"
          }, {
            "name": "太湖县"
          }, {
            "name": "宿松县"
          }, {
            "name": "望江县"
          }, {
            "name": "岳西县"
          }, {
            "name": "桐城市"
          }
        ]
      }, {
        "name": "黄山市",
        "c": [
          {
            "name": "屯溪区"
          }, {
            "name": "黄山区"
          }, {
            "name": "徽州区"
          }, {
            "name": "歙县"
          }, {
            "name": "休宁县"
          }, {
            "name": "黟县"
          }, {
            "name": "祁门县"
          }
        ]
      }, {
        "name": "滁州市",
        "c": [
          {
            "name": "琅琊区"
          }, {
            "name": "南谯区"
          }, {
            "name": "来安县"
          }, {
            "name": "全椒县"
          }, {
            "name": "定远县"
          }, {
            "name": "凤阳县"
          }, {
            "name": "天长市"
          }, {
            "name": "明光市"
          }
        ]
      }, {
        "name": "阜阳市",
        "c": [
          {
            "name": "颍州区"
          }, {
            "name": "颍东区"
          }, {
            "name": "颍泉区"
          }, {
            "name": "临泉县"
          }, {
            "name": "太和县"
          }, {
            "name": "阜南县"
          }, {
            "name": "颍上县"
          }, {
            "name": "界首市"
          }
        ]
      }, {
        "name": "宿州市",
        "c": [
          {
            "name": "埇桥区"
          }, {
            "name": "砀山县"
          }, {
            "name": "萧县"
          }, {
            "name": "灵璧县"
          }, {
            "name": "泗县"
          }
        ]
      }, {
        "name": "六安市",
        "c": [
          {
            "name": "金安区"
          }, {
            "name": "裕安区"
          }, {
            "name": "叶集区"
          }, {
            "name": "霍邱县"
          }, {
            "name": "舒城县"
          }, {
            "name": "金寨县"
          }, {
            "name": "霍山县"
          }
        ]
      }, {
        "name": "亳州市",
        "c": [
          {
            "name": "谯城区"
          }, {
            "name": "涡阳县"
          }, {
            "name": "蒙城县"
          }, {
            "name": "利辛县"
          }
        ]
      }, {
        "name": "池州市",
        "c": [
          {
            "name": "贵池区"
          }, {
            "name": "东至县"
          }, {
            "name": "石台县"
          }, {
            "name": "青阳县"
          }
        ]
      }, {
        "name": "宣城市",
        "c": [
          {
            "name": "宣州区"
          }, {
            "name": "郎溪县"
          }, {
            "name": "广德县"
          }, {
            "name": "泾县"
          }, {
            "name": "绩溪县"
          }, {
            "name": "旌德县"
          }, {
            "name": "宁国市"
          }
        ]
      }
    ]
  }, {
    "name": "福建省",
    "c": [
      {
        "name": "福州市",
        "c": [
          {
            "name": "鼓楼区"
          }, {
            "name": "台江区"
          }, {
            "name": "仓山区"
          }, {
            "name": "马尾区"
          }, {
            "name": "晋安区"
          }, {
            "name": "闽侯县"
          }, {
            "name": "连江县"
          }, {
            "name": "罗源县"
          }, {
            "name": "闽清县"
          }, {
            "name": "永泰县"
          }, {
            "name": "平潭县"
          }, {
            "name": "福清市"
          }, {
            "name": "长乐市"
          }
        ]
      }, {
        "name": "厦门市",
        "c": [
          {
            "name": "思明区"
          }, {
            "name": "海沧区"
          }, {
            "name": "湖里区"
          }, {
            "name": "集美区"
          }, {
            "name": "同安区"
          }, {
            "name": "翔安区"
          }
        ]
      }, {
        "name": "莆田市",
        "c": [
          {
            "name": "城厢区"
          }, {
            "name": "涵江区"
          }, {
            "name": "荔城区"
          }, {
            "name": "秀屿区"
          }, {
            "name": "仙游县"
          }
        ]
      }, {
        "name": "三明市",
        "c": [
          {
            "name": "梅列区"
          }, {
            "name": "三元区"
          }, {
            "name": "明溪县"
          }, {
            "name": "清流县"
          }, {
            "name": "宁化县"
          }, {
            "name": "大田县"
          }, {
            "name": "尤溪县"
          }, {
            "name": "沙县"
          }, {
            "name": "将乐县"
          }, {
            "name": "泰宁县"
          }, {
            "name": "建宁县"
          }, {
            "name": "永安市"
          }
        ]
      }, {
        "name": "泉州市",
        "c": [
          {
            "name": "鲤城区"
          }, {
            "name": "丰泽区"
          }, {
            "name": "洛江区"
          }, {
            "name": "泉港区"
          }, {
            "name": "惠安县"
          }, {
            "name": "安溪县"
          }, {
            "name": "永春县"
          }, {
            "name": "德化县"
          }, {
            "name": "金门县"
          }, {
            "name": "石狮市"
          }, {
            "name": "晋江市"
          }, {
            "name": "南安市"
          }
        ]
      }, {
        "name": "漳州市",
        "c": [
          {
            "name": "芗城区"
          }, {
            "name": "龙文区"
          }, {
            "name": "云霄县"
          }, {
            "name": "漳浦县"
          }, {
            "name": "诏安县"
          }, {
            "name": "长泰县"
          }, {
            "name": "东山县"
          }, {
            "name": "南靖县"
          }, {
            "name": "平和县"
          }, {
            "name": "华安县"
          }, {
            "name": "龙海市"
          }
        ]
      }, {
        "name": "南平市",
        "c": [
          {
            "name": "延平区"
          }, {
            "name": "建阳区"
          }, {
            "name": "顺昌县"
          }, {
            "name": "浦城县"
          }, {
            "name": "光泽县"
          }, {
            "name": "松溪县"
          }, {
            "name": "政和县"
          }, {
            "name": "邵武市"
          }, {
            "name": "武夷山市"
          }, {
            "name": "建瓯市"
          }
        ]
      }, {
        "name": "龙岩市",
        "c": [
          {
            "name": "新罗区"
          }, {
            "name": "永定区"
          }, {
            "name": "长汀县"
          }, {
            "name": "上杭县"
          }, {
            "name": "武平县"
          }, {
            "name": "连城县"
          }, {
            "name": "漳平市"
          }
        ]
      }, {
        "name": "宁德市",
        "c": [
          {
            "name": "蕉城区"
          }, {
            "name": "霞浦县"
          }, {
            "name": "古田县"
          }, {
            "name": "屏南县"
          }, {
            "name": "寿宁县"
          }, {
            "name": "周宁县"
          }, {
            "name": "柘荣县"
          }, {
            "name": "福安市"
          }, {
            "name": "福鼎市"
          }
        ]
      }
    ]
  }, {
    "name": "江西省",
    "c": [
      {
        "name": "南昌市",
        "c": [
          {
            "name": "东湖区"
          }, {
            "name": "西湖区"
          }, {
            "name": "青云谱区"
          }, {
            "name": "湾里区"
          }, {
            "name": "青山湖区"
          }, {
            "name": "新建区"
          }, {
            "name": "南昌县"
          }, {
            "name": "安义县"
          }, {
            "name": "进贤县"
          }
        ]
      }, {
        "name": "景德镇市",
        "c": [
          {
            "name": "昌江区"
          }, {
            "name": "珠山区"
          }, {
            "name": "浮梁县"
          }, {
            "name": "乐平市"
          }
        ]
      }, {
        "name": "萍乡市",
        "c": [
          {
            "name": "安源区"
          }, {
            "name": "湘东区"
          }, {
            "name": "莲花县"
          }, {
            "name": "上栗县"
          }, {
            "name": "芦溪县"
          }
        ]
      }, {
        "name": "九江市",
        "c": [
          {
            "name": "濂溪区"
          }, {
            "name": "浔阳区"
          }, {
            "name": "九江县"
          }, {
            "name": "武宁县"
          }, {
            "name": "修水县"
          }, {
            "name": "永修县"
          }, {
            "name": "德安县"
          }, {
            "name": "都昌县"
          }, {
            "name": "湖口县"
          }, {
            "name": "彭泽县"
          }, {
            "name": "瑞昌市"
          }, {
            "name": "共青城市"
          }, {
            "name": "庐山市"
          }
        ]
      }, {
        "name": "新余市",
        "c": [
          {
            "name": "渝水区"
          }, {
            "name": "分宜县"
          }
        ]
      }, {
        "name": "鹰潭市",
        "c": [
          {
            "name": "月湖区"
          }, {
            "name": "余江县"
          }, {
            "name": "贵溪市"
          }
        ]
      }, {
        "name": "赣州市",
        "c": [
          {
            "name": "章贡区"
          }, {
            "name": "南康区"
          }, {
            "name": "赣县"
          }, {
            "name": "信丰县"
          }, {
            "name": "大余县"
          }, {
            "name": "上犹县"
          }, {
            "name": "崇义县"
          }, {
            "name": "安远县"
          }, {
            "name": "龙南县"
          }, {
            "name": "定南县"
          }, {
            "name": "全南县"
          }, {
            "name": "宁都县"
          }, {
            "name": "于都县"
          }, {
            "name": "兴国县"
          }, {
            "name": "会昌县"
          }, {
            "name": "寻乌县"
          }, {
            "name": "石城县"
          }, {
            "name": "瑞金市"
          }
        ]
      }, {
        "name": "吉安市",
        "c": [
          {
            "name": "吉州区"
          }, {
            "name": "青原区"
          }, {
            "name": "吉安县"
          }, {
            "name": "吉水县"
          }, {
            "name": "峡江县"
          }, {
            "name": "新干县"
          }, {
            "name": "永丰县"
          }, {
            "name": "泰和县"
          }, {
            "name": "遂川县"
          }, {
            "name": "万安县"
          }, {
            "name": "安福县"
          }, {
            "name": "永新县"
          }, {
            "name": "井冈山市"
          }
        ]
      }, {
        "name": "宜春市",
        "c": [
          {
            "name": "袁州区"
          }, {
            "name": "奉新县"
          }, {
            "name": "万载县"
          }, {
            "name": "上高县"
          }, {
            "name": "宜丰县"
          }, {
            "name": "靖安县"
          }, {
            "name": "铜鼓县"
          }, {
            "name": "丰城市"
          }, {
            "name": "樟树市"
          }, {
            "name": "高安市"
          }
        ]
      }, {
        "name": "抚州市",
        "c": [
          {
            "name": "临川区"
          }, {
            "name": "南城县"
          }, {
            "name": "黎川县"
          }, {
            "name": "南丰县"
          }, {
            "name": "崇仁县"
          }, {
            "name": "乐安县"
          }, {
            "name": "宜黄县"
          }, {
            "name": "金溪县"
          }, {
            "name": "资溪县"
          }, {
            "name": "东乡县"
          }, {
            "name": "广昌县"
          }
        ]
      }, {
        "name": "上饶市",
        "c": [
          {
            "name": "信州区"
          }, {
            "name": "广丰区"
          }, {
            "name": "上饶县"
          }, {
            "name": "玉山县"
          }, {
            "name": "铅山县"
          }, {
            "name": "横峰县"
          }, {
            "name": "弋阳县"
          }, {
            "name": "余干县"
          }, {
            "name": "鄱阳县"
          }, {
            "name": "万年县"
          }, {
            "name": "婺源县"
          }, {
            "name": "德兴市"
          }
        ]
      }
    ]
  }, {
    "name": "山东省",
    "c": [
      {
        "name": "济南市",
        "c": [
          {
            "name": "历下区"
          }, {
            "name": "市中区"
          }, {
            "name": "槐荫区"
          }, {
            "name": "天桥区"
          }, {
            "name": "历城区"
          }, {
            "name": "长清区"
          }, {
            "name": "平阴县"
          }, {
            "name": "济阳县"
          }, {
            "name": "商河县"
          }, {
            "name": "章丘市"
          }
        ]
      }, {
        "name": "青岛市",
        "c": [
          {
            "name": "市南区"
          }, {
            "name": "市北区"
          }, {
            "name": "黄岛区"
          }, {
            "name": "崂山区"
          }, {
            "name": "李沧区"
          }, {
            "name": "城阳区"
          }, {
            "name": "胶州市"
          }, {
            "name": "即墨市"
          }, {
            "name": "平度市"
          }, {
            "name": "莱西市"
          }
        ]
      }, {
        "name": "淄博市",
        "c": [
          {
            "name": "淄川区"
          }, {
            "name": "张店区"
          }, {
            "name": "博山区"
          }, {
            "name": "临淄区"
          }, {
            "name": "周村区"
          }, {
            "name": "桓台县"
          }, {
            "name": "高青县"
          }, {
            "name": "沂源县"
          }
        ]
      }, {
        "name": "枣庄市",
        "c": [
          {
            "name": "市中区"
          }, {
            "name": "薛城区"
          }, {
            "name": "峄城区"
          }, {
            "name": "台儿庄区"
          }, {
            "name": "山亭区"
          }, {
            "name": "滕州市"
          }
        ]
      }, {
        "name": "东营市",
        "c": [
          {
            "name": "东营区"
          }, {
            "name": "河口区"
          }, {
            "name": "垦利区"
          }, {
            "name": "利津县"
          }, {
            "name": "广饶县"
          }
        ]
      }, {
        "name": "烟台市",
        "c": [
          {
            "name": "芝罘区"
          }, {
            "name": "福山区"
          }, {
            "name": "牟平区"
          }, {
            "name": "莱山区"
          }, {
            "name": "长岛县"
          }, {
            "name": "龙口市"
          }, {
            "name": "莱阳市"
          }, {
            "name": "莱州市"
          }, {
            "name": "蓬莱市"
          }, {
            "name": "招远市"
          }, {
            "name": "栖霞市"
          }, {
            "name": "海阳市"
          }
        ]
      }, {
        "name": "潍坊市",
        "c": [
          {
            "name": "潍城区"
          }, {
            "name": "寒亭区"
          }, {
            "name": "坊子区"
          }, {
            "name": "奎文区"
          }, {
            "name": "临朐县"
          }, {
            "name": "昌乐县"
          }, {
            "name": "青州市"
          }, {
            "name": "诸城市"
          }, {
            "name": "寿光市"
          }, {
            "name": "安丘市"
          }, {
            "name": "高密市"
          }, {
            "name": "昌邑市"
          }
        ]
      }, {
        "name": "济宁市",
        "c": [
          {
            "name": "任城区"
          }, {
            "name": "兖州区"
          }, {
            "name": "微山县"
          }, {
            "name": "鱼台县"
          }, {
            "name": "金乡县"
          }, {
            "name": "嘉祥县"
          }, {
            "name": "汶上县"
          }, {
            "name": "泗水县"
          }, {
            "name": "梁山县"
          }, {
            "name": "曲阜市"
          }, {
            "name": "邹城市"
          }
        ]
      }, {
        "name": "泰安市",
        "c": [
          {
            "name": "泰山区"
          }, {
            "name": "岱岳区"
          }, {
            "name": "宁阳县"
          }, {
            "name": "东平县"
          }, {
            "name": "新泰市"
          }, {
            "name": "肥城市"
          }
        ]
      }, {
        "name": "威海市",
        "c": [
          {
            "name": "环翠区"
          }, {
            "name": "文登区"
          }, {
            "name": "荣成市"
          }, {
            "name": "乳山市"
          }
        ]
      }, {
        "name": "日照市",
        "c": [
          {
            "name": "东港区"
          }, {
            "name": "岚山区"
          }, {
            "name": "五莲县"
          }, {
            "name": "莒县"
          }
        ]
      }, {
        "name": "莱芜市",
        "c": [
          {
            "name": "莱城区"
          }, {
            "name": "钢城区"
          }
        ]
      }, {
        "name": "临沂市",
        "c": [
          {
            "name": "兰山区"
          }, {
            "name": "罗庄区"
          }, {
            "name": "河东区"
          }, {
            "name": "沂南县"
          }, {
            "name": "郯城县"
          }, {
            "name": "沂水县"
          }, {
            "name": "兰陵县"
          }, {
            "name": "费县"
          }, {
            "name": "平邑县"
          }, {
            "name": "莒南县"
          }, {
            "name": "蒙阴县"
          }, {
            "name": "临沭县"
          }
        ]
      }, {
        "name": "德州市",
        "c": [
          {
            "name": "德城区"
          }, {
            "name": "陵城区"
          }, {
            "name": "宁津县"
          }, {
            "name": "庆云县"
          }, {
            "name": "临邑县"
          }, {
            "name": "齐河县"
          }, {
            "name": "平原县"
          }, {
            "name": "夏津县"
          }, {
            "name": "武城县"
          }, {
            "name": "乐陵市"
          }, {
            "name": "禹城市"
          }
        ]
      }, {
        "name": "聊城市",
        "c": [
          {
            "name": "东昌府区"
          }, {
            "name": "阳谷县"
          }, {
            "name": "莘县"
          }, {
            "name": "茌平县"
          }, {
            "name": "东阿县"
          }, {
            "name": "冠县"
          }, {
            "name": "高唐县"
          }, {
            "name": "临清市"
          }
        ]
      }, {
        "name": "滨州市",
        "c": [
          {
            "name": "滨城区"
          }, {
            "name": "沾化区"
          }, {
            "name": "惠民县"
          }, {
            "name": "阳信县"
          }, {
            "name": "无棣县"
          }, {
            "name": "博兴县"
          }, {
            "name": "邹平县"
          }
        ]
      }, {
        "name": "菏泽市",
        "c": [
          {
            "name": "牡丹区"
          }, {
            "name": "定陶区"
          }, {
            "name": "曹县"
          }, {
            "name": "单县"
          }, {
            "name": "成武县"
          }, {
            "name": "巨野县"
          }, {
            "name": "郓城县"
          }, {
            "name": "鄄城县"
          }, {
            "name": "东明县"
          }
        ]
      }
    ]
  }, {
    "name": "河南省",
    "c": [
      {
        "name": "郑州市",
        "c": [
          {
            "name": "中原区"
          }, {
            "name": "二七区"
          }, {
            "name": "管城回族区"
          }, {
            "name": "金水区"
          }, {
            "name": "上街区"
          }, {
            "name": "惠济区"
          }, {
            "name": "中牟县"
          }, {
            "name": "巩义市"
          }, {
            "name": "荥阳市"
          }, {
            "name": "新密市"
          }, {
            "name": "新郑市"
          }, {
            "name": "登封市"
          }
        ]
      }, {
        "name": "开封市",
        "c": [
          {
            "name": "龙亭区"
          }, {
            "name": "顺河回族区"
          }, {
            "name": "鼓楼区"
          }, {
            "name": "禹王台区"
          }, {
            "name": "祥符区"
          }, {
            "name": "杞县"
          }, {
            "name": "通许县"
          }, {
            "name": "尉氏县"
          }, {
            "name": "兰考县"
          }
        ]
      }, {
        "name": "洛阳市",
        "c": [
          {
            "name": "老城区"
          }, {
            "name": "西工区"
          }, {
            "name": "瀍河回族区"
          }, {
            "name": "涧西区"
          }, {
            "name": "吉利区"
          }, {
            "name": "洛龙区"
          }, {
            "name": "孟津县"
          }, {
            "name": "新安县"
          }, {
            "name": "栾川县"
          }, {
            "name": "嵩县"
          }, {
            "name": "汝阳县"
          }, {
            "name": "宜阳县"
          }, {
            "name": "洛宁县"
          }, {
            "name": "伊川县"
          }, {
            "name": "偃师市"
          }
        ]
      }, {
        "name": "平顶山市",
        "c": [
          {
            "name": "新华区"
          }, {
            "name": "卫东区"
          }, {
            "name": "石龙区"
          }, {
            "name": "湛河区"
          }, {
            "name": "宝丰县"
          }, {
            "name": "叶县"
          }, {
            "name": "鲁山县"
          }, {
            "name": "郏县"
          }, {
            "name": "舞钢市"
          }, {
            "name": "汝州市"
          }
        ]
      }, {
        "name": "安阳市",
        "c": [
          {
            "name": "文峰区"
          }, {
            "name": "北关区"
          }, {
            "name": "殷都区"
          }, {
            "name": "龙安区"
          }, {
            "name": "安阳县"
          }, {
            "name": "汤阴县"
          }, {
            "name": "滑县"
          }, {
            "name": "内黄县"
          }, {
            "name": "林州市"
          }
        ]
      }, {
        "name": "鹤壁市",
        "c": [
          {
            "name": "鹤山区"
          }, {
            "name": "山城区"
          }, {
            "name": "淇滨区"
          }, {
            "name": "浚县"
          }, {
            "name": "淇县"
          }
        ]
      }, {
        "name": "新乡市",
        "c": [
          {
            "name": "红旗区"
          }, {
            "name": "卫滨区"
          }, {
            "name": "凤泉区"
          }, {
            "name": "牧野区"
          }, {
            "name": "新乡县"
          }, {
            "name": "获嘉县"
          }, {
            "name": "原阳县"
          }, {
            "name": "延津县"
          }, {
            "name": "封丘县"
          }, {
            "name": "长垣县"
          }, {
            "name": "卫辉市"
          }, {
            "name": "辉县市"
          }
        ]
      }, {
        "name": "焦作市",
        "c": [
          {
            "name": "解放区"
          }, {
            "name": "中站区"
          }, {
            "name": "马村区"
          }, {
            "name": "山阳区"
          }, {
            "name": "修武县"
          }, {
            "name": "博爱县"
          }, {
            "name": "武陟县"
          }, {
            "name": "温县"
          }, {
            "name": "沁阳市"
          }, {
            "name": "孟州市"
          }
        ]
      }, {
        "name": "濮阳市",
        "c": [
          {
            "name": "华龙区"
          }, {
            "name": "清丰县"
          }, {
            "name": "南乐县"
          }, {
            "name": "范县"
          }, {
            "name": "台前县"
          }, {
            "name": "濮阳县"
          }
        ]
      }, {
        "name": "许昌市",
        "c": [
          {
            "name": "魏都区"
          }, {
            "name": "许昌县"
          }, {
            "name": "鄢陵县"
          }, {
            "name": "襄城县"
          }, {
            "name": "禹州市"
          }, {
            "name": "长葛市"
          }
        ]
      }, {
        "name": "漯河市",
        "c": [
          {
            "name": "源汇区"
          }, {
            "name": "郾城区"
          }, {
            "name": "召陵区"
          }, {
            "name": "舞阳县"
          }, {
            "name": "临颍县"
          }
        ]
      }, {
        "name": "三门峡市",
        "c": [
          {
            "name": "湖滨区"
          }, {
            "name": "陕州区"
          }, {
            "name": "渑池县"
          }, {
            "name": "卢氏县"
          }, {
            "name": "义马市"
          }, {
            "name": "灵宝市"
          }
        ]
      }, {
        "name": "南阳市",
        "c": [
          {
            "name": "宛城区"
          }, {
            "name": "卧龙区"
          }, {
            "name": "南召县"
          }, {
            "name": "方城县"
          }, {
            "name": "西峡县"
          }, {
            "name": "镇平县"
          }, {
            "name": "内乡县"
          }, {
            "name": "淅川县"
          }, {
            "name": "社旗县"
          }, {
            "name": "唐河县"
          }, {
            "name": "新野县"
          }, {
            "name": "桐柏县"
          }, {
            "name": "邓州市"
          }
        ]
      }, {
        "name": "商丘市",
        "c": [
          {
            "name": "梁园区"
          }, {
            "name": "睢阳区"
          }, {
            "name": "民权县"
          }, {
            "name": "睢县"
          }, {
            "name": "宁陵县"
          }, {
            "name": "柘城县"
          }, {
            "name": "虞城县"
          }, {
            "name": "夏邑县"
          }, {
            "name": "永城市"
          }
        ]
      }, {
        "name": "信阳市",
        "c": [
          {
            "name": "浉河区"
          }, {
            "name": "平桥区"
          }, {
            "name": "罗山县"
          }, {
            "name": "光山县"
          }, {
            "name": "新县"
          }, {
            "name": "商城县"
          }, {
            "name": "固始县"
          }, {
            "name": "潢川县"
          }, {
            "name": "淮滨县"
          }, {
            "name": "息县"
          }
        ]
      }, {
        "name": "周口市",
        "c": [
          {
            "name": "川汇区"
          }, {
            "name": "扶沟县"
          }, {
            "name": "西华县"
          }, {
            "name": "商水县"
          }, {
            "name": "沈丘县"
          }, {
            "name": "郸城县"
          }, {
            "name": "淮阳县"
          }, {
            "name": "太康县"
          }, {
            "name": "鹿邑县"
          }, {
            "name": "项城市"
          }
        ]
      }, {
        "name": "驻马店市",
        "c": [
          {
            "name": "驿城区"
          }, {
            "name": "西平县"
          }, {
            "name": "上蔡县"
          }, {
            "name": "平舆县"
          }, {
            "name": "正阳县"
          }, {
            "name": "确山县"
          }, {
            "name": "泌阳县"
          }, {
            "name": "汝南县"
          }, {
            "name": "遂平县"
          }, {
            "name": "新蔡县"
          }
        ]
      }, {
        "name": "济源市",
        "c": []
      }
    ]
  }, {
    "name": "湖北省",
    "c": [
      {
        "name": "武汉市",
        "c": [
          {
            "name": "江岸区"
          }, {
            "name": "江汉区"
          }, {
            "name": "硚口区"
          }, {
            "name": "汉阳区"
          }, {
            "name": "武昌区"
          }, {
            "name": "青山区"
          }, {
            "name": "洪山区"
          }, {
            "name": "东西湖区"
          }, {
            "name": "汉南区"
          }, {
            "name": "蔡甸区"
          }, {
            "name": "江夏区"
          }, {
            "name": "黄陂区"
          }, {
            "name": "新洲区"
          }
        ]
      }, {
        "name": "黄石市",
        "c": [
          {
            "name": "黄石港区"
          }, {
            "name": "西塞山区"
          }, {
            "name": "下陆区"
          }, {
            "name": "铁山区"
          }, {
            "name": "阳新县"
          }, {
            "name": "大冶市"
          }
        ]
      }, {
        "name": "十堰市",
        "c": [
          {
            "name": "茅箭区"
          }, {
            "name": "张湾区"
          }, {
            "name": "郧阳区"
          }, {
            "name": "郧西县"
          }, {
            "name": "竹山县"
          }, {
            "name": "竹溪县"
          }, {
            "name": "房县"
          }, {
            "name": "丹江口市"
          }
        ]
      }, {
        "name": "宜昌市",
        "c": [
          {
            "name": "西陵区"
          }, {
            "name": "伍家岗区"
          }, {
            "name": "点军区"
          }, {
            "name": "猇亭区"
          }, {
            "name": "夷陵区"
          }, {
            "name": "远安县"
          }, {
            "name": "兴山县"
          }, {
            "name": "秭归县"
          }, {
            "name": "长阳土家族自治县"
          }, {
            "name": "五峰土家族自治县"
          }, {
            "name": "宜都市"
          }, {
            "name": "当阳市"
          }, {
            "name": "枝江市"
          }
        ]
      }, {
        "name": "襄阳市",
        "c": [
          {
            "name": "襄城区"
          }, {
            "name": "樊城区"
          }, {
            "name": "襄州区"
          }, {
            "name": "南漳县"
          }, {
            "name": "谷城县"
          }, {
            "name": "保康县"
          }, {
            "name": "老河口市"
          }, {
            "name": "枣阳市"
          }, {
            "name": "宜城市"
          }
        ]
      }, {
        "name": "鄂州市",
        "c": [
          {
            "name": "梁子湖区"
          }, {
            "name": "华容区"
          }, {
            "name": "鄂城区"
          }
        ]
      }, {
        "name": "荆门市",
        "c": [
          {
            "name": "东宝区"
          }, {
            "name": "掇刀区"
          }, {
            "name": "京山县"
          }, {
            "name": "沙洋县"
          }, {
            "name": "钟祥市"
          }
        ]
      }, {
        "name": "孝感市",
        "c": [
          {
            "name": "孝南区"
          }, {
            "name": "孝昌县"
          }, {
            "name": "大悟县"
          }, {
            "name": "云梦县"
          }, {
            "name": "应城市"
          }, {
            "name": "安陆市"
          }, {
            "name": "汉川市"
          }
        ]
      }, {
        "name": "荆州市",
        "c": [
          {
            "name": "沙市区"
          }, {
            "name": "荆州区"
          }, {
            "name": "公安县"
          }, {
            "name": "监利县"
          }, {
            "name": "江陵县"
          }, {
            "name": "石首市"
          }, {
            "name": "洪湖市"
          }, {
            "name": "松滋市"
          }
        ]
      }, {
        "name": "黄冈市",
        "c": [
          {
            "name": "黄州区"
          }, {
            "name": "团风县"
          }, {
            "name": "红安县"
          }, {
            "name": "罗田县"
          }, {
            "name": "英山县"
          }, {
            "name": "浠水县"
          }, {
            "name": "蕲春县"
          }, {
            "name": "黄梅县"
          }, {
            "name": "麻城市"
          }, {
            "name": "武穴市"
          }
        ]
      }, {
        "name": "咸宁市",
        "c": [
          {
            "name": "咸安区"
          }, {
            "name": "嘉鱼县"
          }, {
            "name": "通城县"
          }, {
            "name": "崇阳县"
          }, {
            "name": "通山县"
          }, {
            "name": "赤壁市"
          }
        ]
      }, {
        "name": "随州市",
        "c": [
          {
            "name": "曾都区"
          }, {
            "name": "随县"
          }, {
            "name": "广水市"
          }
        ]
      }, {
        "name": "恩施土家族苗族自治州",
        "c": [
          {
            "name": "恩施市"
          }, {
            "name": "利川市"
          }, {
            "name": "建始县"
          }, {
            "name": "巴东县"
          }, {
            "name": "宣恩县"
          }, {
            "name": "咸丰县"
          }, {
            "name": "来凤县"
          }, {
            "name": "鹤峰县"
          }
        ]
      }, {
        "name": "仙桃市",
        "c": []
      }, {
        "name": "潜江市",
        "c": []
      }, {
        "name": "天门市",
        "c": []
      }, {
        "name": "神农架林区",
        "c": []
      }
    ]
  }, {
    "name": "湖南省",
    "c": [
      {
        "name": "长沙市",
        "c": [
          {
            "name": "芙蓉区"
          }, {
            "name": "天心区"
          }, {
            "name": "岳麓区"
          }, {
            "name": "开福区"
          }, {
            "name": "雨花区"
          }, {
            "name": "望城区"
          }, {
            "name": "长沙县"
          }, {
            "name": "宁乡县"
          }, {
            "name": "浏阳市"
          }
        ]
      }, {
        "name": "株洲市",
        "c": [
          {
            "name": "荷塘区"
          }, {
            "name": "芦淞区"
          }, {
            "name": "石峰区"
          }, {
            "name": "天元区"
          }, {
            "name": "株洲县"
          }, {
            "name": "攸县"
          }, {
            "name": "茶陵县"
          }, {
            "name": "炎陵县"
          }, {
            "name": "醴陵市"
          }
        ]
      }, {
        "name": "湘潭市",
        "c": [
          {
            "name": "雨湖区"
          }, {
            "name": "岳塘区"
          }, {
            "name": "湘潭县"
          }, {
            "name": "湘乡市"
          }, {
            "name": "韶山市"
          }
        ]
      }, {
        "name": "衡阳市",
        "c": [
          {
            "name": "珠晖区"
          }, {
            "name": "雁峰区"
          }, {
            "name": "石鼓区"
          }, {
            "name": "蒸湘区"
          }, {
            "name": "南岳区"
          }, {
            "name": "衡阳县"
          }, {
            "name": "衡南县"
          }, {
            "name": "衡山县"
          }, {
            "name": "衡东县"
          }, {
            "name": "祁东县"
          }, {
            "name": "耒阳市"
          }, {
            "name": "常宁市"
          }
        ]
      }, {
        "name": "邵阳市",
        "c": [
          {
            "name": "双清区"
          }, {
            "name": "大祥区"
          }, {
            "name": "北塔区"
          }, {
            "name": "邵东县"
          }, {
            "name": "新邵县"
          }, {
            "name": "邵阳县"
          }, {
            "name": "隆回县"
          }, {
            "name": "洞口县"
          }, {
            "name": "绥宁县"
          }, {
            "name": "新宁县"
          }, {
            "name": "城步苗族自治县"
          }, {
            "name": "武冈市"
          }
        ]
      }, {
        "name": "岳阳市",
        "c": [
          {
            "name": "岳阳楼区"
          }, {
            "name": "云溪区"
          }, {
            "name": "君山区"
          }, {
            "name": "岳阳县"
          }, {
            "name": "华容县"
          }, {
            "name": "湘阴县"
          }, {
            "name": "平江县"
          }, {
            "name": "汨罗市"
          }, {
            "name": "临湘市"
          }
        ]
      }, {
        "name": "常德市",
        "c": [
          {
            "name": "武陵区"
          }, {
            "name": "鼎城区"
          }, {
            "name": "安乡县"
          }, {
            "name": "汉寿县"
          }, {
            "name": "澧县"
          }, {
            "name": "临澧县"
          }, {
            "name": "桃源县"
          }, {
            "name": "石门县"
          }, {
            "name": "津市市"
          }
        ]
      }, {
        "name": "张家界市",
        "c": [
          {
            "name": "永定区"
          }, {
            "name": "武陵源区"
          }, {
            "name": "慈利县"
          }, {
            "name": "桑植县"
          }
        ]
      }, {
        "name": "益阳市",
        "c": [
          {
            "name": "资阳区"
          }, {
            "name": "赫山区"
          }, {
            "name": "南县"
          }, {
            "name": "桃江县"
          }, {
            "name": "安化县"
          }, {
            "name": "沅江市"
          }
        ]
      }, {
        "name": "郴州市",
        "c": [
          {
            "name": "北湖区"
          }, {
            "name": "苏仙区"
          }, {
            "name": "桂阳县"
          }, {
            "name": "宜章县"
          }, {
            "name": "永兴县"
          }, {
            "name": "嘉禾县"
          }, {
            "name": "临武县"
          }, {
            "name": "汝城县"
          }, {
            "name": "桂东县"
          }, {
            "name": "安仁县"
          }, {
            "name": "资兴市"
          }
        ]
      }, {
        "name": "永州市",
        "c": [
          {
            "name": "零陵区"
          }, {
            "name": "冷水滩区"
          }, {
            "name": "祁阳县"
          }, {
            "name": "东安县"
          }, {
            "name": "双牌县"
          }, {
            "name": "道县"
          }, {
            "name": "江永县"
          }, {
            "name": "宁远县"
          }, {
            "name": "蓝山县"
          }, {
            "name": "新田县"
          }, {
            "name": "江华瑶族自治县"
          }
        ]
      }, {
        "name": "怀化市",
        "c": [
          {
            "name": "鹤城区"
          }, {
            "name": "中方县"
          }, {
            "name": "沅陵县"
          }, {
            "name": "辰溪县"
          }, {
            "name": "溆浦县"
          }, {
            "name": "会同县"
          }, {
            "name": "麻阳苗族自治县"
          }, {
            "name": "新晃侗族自治县"
          }, {
            "name": "芷江侗族自治县"
          }, {
            "name": "靖州苗族侗族自治县"
          }, {
            "name": "通道侗族自治县"
          }, {
            "name": "洪江市"
          }
        ]
      }, {
        "name": "娄底市",
        "c": [
          {
            "name": "娄星区"
          }, {
            "name": "双峰县"
          }, {
            "name": "新化县"
          }, {
            "name": "冷水江市"
          }, {
            "name": "涟源市"
          }
        ]
      }, {
        "name": "湘西土家族苗族自治州",
        "c": [
          {
            "name": "吉首市"
          }, {
            "name": "泸溪县"
          }, {
            "name": "凤凰县"
          }, {
            "name": "花垣县"
          }, {
            "name": "保靖县"
          }, {
            "name": "古丈县"
          }, {
            "name": "永顺县"
          }, {
            "name": "龙山县"
          }
        ]
      }
    ]
  }, {
    "name": "广东省",
    "c": [
      {
        "name": "广州市",
        "c": [
          {
            "name": "荔湾区"
          }, {
            "name": "越秀区"
          }, {
            "name": "海珠区"
          }, {
            "name": "天河区"
          }, {
            "name": "白云区"
          }, {
            "name": "黄埔区"
          }, {
            "name": "番禺区"
          }, {
            "name": "花都区"
          }, {
            "name": "南沙区"
          }, {
            "name": "从化区"
          }, {
            "name": "增城区"
          }
        ]
      }, {
        "name": "韶关市",
        "c": [
          {
            "name": "武江区"
          }, {
            "name": "浈江区"
          }, {
            "name": "曲江区"
          }, {
            "name": "始兴县"
          }, {
            "name": "仁化县"
          }, {
            "name": "翁源县"
          }, {
            "name": "乳源瑶族自治县"
          }, {
            "name": "新丰县"
          }, {
            "name": "乐昌市"
          }, {
            "name": "南雄市"
          }
        ]
      }, {
        "name": "深圳市",
        "c": [
          {
            "name": "罗湖区"
          }, {
            "name": "福田区"
          }, {
            "name": "南山区"
          }, {
            "name": "宝安区"
          }, {
            "name": "龙岗区"
          }, {
            "name": "盐田区"
          }
        ]
      }, {
        "name": "珠海市",
        "c": [
          {
            "name": "香洲区"
          }, {
            "name": "斗门区"
          }, {
            "name": "金湾区"
          }
        ]
      }, {
        "name": "汕头市",
        "c": [
          {
            "name": "龙湖区"
          }, {
            "name": "金平区"
          }, {
            "name": "濠江区"
          }, {
            "name": "潮阳区"
          }, {
            "name": "潮南区"
          }, {
            "name": "澄海区"
          }, {
            "name": "南澳县"
          }
        ]
      }, {
        "name": "佛山市",
        "c": [
          {
            "name": "禅城区"
          }, {
            "name": "南海区"
          }, {
            "name": "顺德区"
          }, {
            "name": "三水区"
          }, {
            "name": "高明区"
          }
        ]
      }, {
        "name": "江门市",
        "c": [
          {
            "name": "蓬江区"
          }, {
            "name": "江海区"
          }, {
            "name": "新会区"
          }, {
            "name": "台山市"
          }, {
            "name": "开平市"
          }, {
            "name": "鹤山市"
          }, {
            "name": "恩平市"
          }
        ]
      }, {
        "name": "湛江市",
        "c": [
          {
            "name": "赤坎区"
          }, {
            "name": "霞山区"
          }, {
            "name": "坡头区"
          }, {
            "name": "麻章区"
          }, {
            "name": "遂溪县"
          }, {
            "name": "徐闻县"
          }, {
            "name": "廉江市"
          }, {
            "name": "雷州市"
          }, {
            "name": "吴川市"
          }
        ]
      }, {
        "name": "茂名市",
        "c": [
          {
            "name": "茂南区"
          }, {
            "name": "电白区"
          }, {
            "name": "高州市"
          }, {
            "name": "化州市"
          }, {
            "name": "信宜市"
          }
        ]
      }, {
        "name": "肇庆市",
        "c": [
          {
            "name": "端州区"
          }, {
            "name": "鼎湖区"
          }, {
            "name": "高要区"
          }, {
            "name": "广宁县"
          }, {
            "name": "怀集县"
          }, {
            "name": "封开县"
          }, {
            "name": "德庆县"
          }, {
            "name": "四会市"
          }
        ]
      }, {
        "name": "惠州市",
        "c": [
          {
            "name": "惠城区"
          }, {
            "name": "惠阳区"
          }, {
            "name": "博罗县"
          }, {
            "name": "惠东县"
          }, {
            "name": "龙门县"
          }
        ]
      }, {
        "name": "梅州市",
        "c": [
          {
            "name": "梅江区"
          }, {
            "name": "梅县区"
          }, {
            "name": "大埔县"
          }, {
            "name": "丰顺县"
          }, {
            "name": "五华县"
          }, {
            "name": "平远县"
          }, {
            "name": "蕉岭县"
          }, {
            "name": "兴宁市"
          }
        ]
      }, {
        "name": "汕尾市",
        "c": [
          {
            "name": "城区"
          }, {
            "name": "海丰县"
          }, {
            "name": "陆河县"
          }, {
            "name": "陆丰市"
          }
        ]
      }, {
        "name": "河源市",
        "c": [
          {
            "name": "源城区"
          }, {
            "name": "紫金县"
          }, {
            "name": "龙川县"
          }, {
            "name": "连平县"
          }, {
            "name": "和平县"
          }, {
            "name": "东源县"
          }
        ]
      }, {
        "name": "阳江市",
        "c": [
          {
            "name": "江城区"
          }, {
            "name": "阳东区"
          }, {
            "name": "阳西县"
          }, {
            "name": "阳春市"
          }
        ]
      }, {
        "name": "清远市",
        "c": [
          {
            "name": "清城区"
          }, {
            "name": "清新区"
          }, {
            "name": "佛冈县"
          }, {
            "name": "阳山县"
          }, {
            "name": "连山壮族瑶族自治县"
          }, {
            "name": "连南瑶族自治县"
          }, {
            "name": "英德市"
          }, {
            "name": "连州市"
          }
        ]
      }, {
        "name": "东莞市",
        "c": []
      }, {
        "name": "中山市",
        "c": []
      }, {
        "name": "潮州市",
        "c": [
          {
            "name": "湘桥区"
          }, {
            "name": "潮安区"
          }, {
            "name": "饶平县"
          }
        ]
      }, {
        "name": "揭阳市",
        "c": [
          {
            "name": "榕城区"
          }, {
            "name": "揭东区"
          }, {
            "name": "揭西县"
          }, {
            "name": "惠来县"
          }, {
            "name": "普宁市"
          }
        ]
      }, {
        "name": "云浮市",
        "c": [
          {
            "name": "云城区"
          }, {
            "name": "云安区"
          }, {
            "name": "新兴县"
          }, {
            "name": "郁南县"
          }, {
            "name": "罗定市"
          }
        ]
      }
    ]
  }, {
    "name": "广西壮族自治区",
    "c": [
      {
        "name": "南宁市",
        "c": [
          {
            "name": "兴宁区"
          }, {
            "name": "青秀区"
          }, {
            "name": "江南区"
          }, {
            "name": "西乡塘区"
          }, {
            "name": "良庆区"
          }, {
            "name": "邕宁区"
          }, {
            "name": "武鸣区"
          }, {
            "name": "隆安县"
          }, {
            "name": "马山县"
          }, {
            "name": "上林县"
          }, {
            "name": "宾阳县"
          }, {
            "name": "横县"
          }
        ]
      }, {
        "name": "柳州市",
        "c": [
          {
            "name": "城中区"
          }, {
            "name": "鱼峰区"
          }, {
            "name": "柳南区"
          }, {
            "name": "柳北区"
          }, {
            "name": "柳江区"
          }, {
            "name": "柳城县"
          }, {
            "name": "鹿寨县"
          }, {
            "name": "融安县"
          }, {
            "name": "融水苗族自治县"
          }, {
            "name": "三江侗族自治县"
          }
        ]
      }, {
        "name": "桂林市",
        "c": [
          {
            "name": "秀峰区"
          }, {
            "name": "叠彩区"
          }, {
            "name": "象山区"
          }, {
            "name": "七星区"
          }, {
            "name": "雁山区"
          }, {
            "name": "临桂区"
          }, {
            "name": "阳朔县"
          }, {
            "name": "灵川县"
          }, {
            "name": "全州县"
          }, {
            "name": "兴安县"
          }, {
            "name": "永福县"
          }, {
            "name": "灌阳县"
          }, {
            "name": "龙胜各族自治县"
          }, {
            "name": "资源县"
          }, {
            "name": "平乐县"
          }, {
            "name": "荔浦县"
          }, {
            "name": "恭城瑶族自治县"
          }
        ]
      }, {
        "name": "梧州市",
        "c": [
          {
            "name": "万秀区"
          }, {
            "name": "长洲区"
          }, {
            "name": "龙圩区"
          }, {
            "name": "苍梧县"
          }, {
            "name": "藤县"
          }, {
            "name": "蒙山县"
          }, {
            "name": "岑溪市"
          }
        ]
      }, {
        "name": "北海市",
        "c": [
          {
            "name": "海城区"
          }, {
            "name": "银海区"
          }, {
            "name": "铁山港区"
          }, {
            "name": "合浦县"
          }
        ]
      }, {
        "name": "防城港市",
        "c": [
          {
            "name": "港口区"
          }, {
            "name": "防城区"
          }, {
            "name": "上思县"
          }, {
            "name": "东兴市"
          }
        ]
      }, {
        "name": "钦州市",
        "c": [
          {
            "name": "钦南区"
          }, {
            "name": "钦北区"
          }, {
            "name": "灵山县"
          }, {
            "name": "浦北县"
          }
        ]
      }, {
        "name": "贵港市",
        "c": [
          {
            "name": "港北区"
          }, {
            "name": "港南区"
          }, {
            "name": "覃塘区"
          }, {
            "name": "平南县"
          }, {
            "name": "桂平市"
          }
        ]
      }, {
        "name": "玉林市",
        "c": [
          {
            "name": "玉州区"
          }, {
            "name": "福绵区"
          }, {
            "name": "容县"
          }, {
            "name": "陆川县"
          }, {
            "name": "博白县"
          }, {
            "name": "兴业县"
          }, {
            "name": "北流市"
          }
        ]
      }, {
        "name": "百色市",
        "c": [
          {
            "name": "右江区"
          }, {
            "name": "田阳县"
          }, {
            "name": "田东县"
          }, {
            "name": "平果县"
          }, {
            "name": "德保县"
          }, {
            "name": "那坡县"
          }, {
            "name": "凌云县"
          }, {
            "name": "乐业县"
          }, {
            "name": "田林县"
          }, {
            "name": "西林县"
          }, {
            "name": "隆林各族自治县"
          }, {
            "name": "靖西市"
          }
        ]
      }, {
        "name": "贺州市",
        "c": [
          {
            "name": "八步区"
          }, {
            "name": "昭平县"
          }, {
            "name": "钟山县"
          }, {
            "name": "富川瑶族自治县"
          }
        ]
      }, {
        "name": "河池市",
        "c": [
          {
            "name": "金城江区"
          }, {
            "name": "南丹县"
          }, {
            "name": "天峨县"
          }, {
            "name": "凤山县"
          }, {
            "name": "东兰县"
          }, {
            "name": "罗城仫佬族自治县"
          }, {
            "name": "环江毛南族自治县"
          }, {
            "name": "巴马瑶族自治县"
          }, {
            "name": "都安瑶族自治县"
          }, {
            "name": "大化瑶族自治县"
          }, {
            "name": "宜州市"
          }
        ]
      }, {
        "name": "来宾市",
        "c": [
          {
            "name": "兴宾区"
          }, {
            "name": "忻城县"
          }, {
            "name": "象州县"
          }, {
            "name": "武宣县"
          }, {
            "name": "金秀瑶族自治县"
          }, {
            "name": "合山市"
          }
        ]
      }, {
        "name": "崇左市",
        "c": [
          {
            "name": "江州区"
          }, {
            "name": "扶绥县"
          }, {
            "name": "宁明县"
          }, {
            "name": "龙州县"
          }, {
            "name": "大新县"
          }, {
            "name": "天等县"
          }, {
            "name": "凭祥市"
          }
        ]
      }
    ]
  }, {
    "name": "海南省",
    "c": [
      {
        "name": "海口市",
        "c": [
          {
            "name": "秀英区"
          }, {
            "name": "龙华区"
          }, {
            "name": "琼山区"
          }, {
            "name": "美兰区"
          }
        ]
      }, {
        "name": "三亚市",
        "c": [
          {
            "name": "海棠区"
          }, {
            "name": "吉阳区"
          }, {
            "name": "天涯区"
          }, {
            "name": "崖州区"
          }
        ]
      }, {
        "name": "三沙市",
        "c": []
      }, {
        "name": "儋州市",
        "c": []
      }, {
        "name": "五指山市",
        "c": []
      }, {
        "name": "琼海市",
        "c": []
      }, {
        "name": "文昌市",
        "c": []
      }, {
        "name": "万宁市",
        "c": []
      }, {
        "name": "东方市",
        "c": []
      }, {
        "name": "定安县",
        "c": []
      }, {
        "name": "屯昌县",
        "c": []
      }, {
        "name": "澄迈县",
        "c": []
      }, {
        "name": "临高县",
        "c": []
      }, {
        "name": "白沙黎族自治县",
        "c": []
      }, {
        "name": "昌江黎族自治县",
        "c": []
      }, {
        "name": "乐东黎族自治县",
        "c": []
      }, {
        "name": "陵水黎族自治县",
        "c": []
      }, {
        "name": "保亭黎族苗族自治县",
        "c": []
      }, {
        "name": "琼中黎族苗族自治县",
        "c": []
      }
    ]
  }, {
    "name": "重庆市",
    "c": [
      {
        "name": "万州区",
        "c": []
      }, {
        "name": "涪陵区",
        "c": []
      }, {
        "name": "渝中区",
        "c": []
      }, {
        "name": "大渡口区",
        "c": []
      }, {
        "name": "江北区",
        "c": []
      }, {
        "name": "沙坪坝区",
        "c": []
      }, {
        "name": "九龙坡区",
        "c": []
      }, {
        "name": "南岸区",
        "c": []
      }, {
        "name": "北碚区",
        "c": []
      }, {
        "name": "綦江区",
        "c": []
      }, {
        "name": "大足区",
        "c": []
      }, {
        "name": "渝北区",
        "c": []
      }, {
        "name": "巴南区",
        "c": []
      }, {
        "name": "黔江区",
        "c": []
      }, {
        "name": "长寿区",
        "c": []
      }, {
        "name": "江津区",
        "c": []
      }, {
        "name": "合川区",
        "c": []
      }, {
        "name": "永川区",
        "c": []
      }, {
        "name": "南川区",
        "c": []
      }, {
        "name": "璧山区",
        "c": []
      }, {
        "name": "铜梁区",
        "c": []
      }, {
        "name": "潼南区",
        "c": []
      }, {
        "name": "荣昌区",
        "c": []
      }, {
        "name": "开州区",
        "c": []
      }, {
        "name": "梁平县",
        "c": []
      }, {
        "name": "城口县",
        "c": []
      }, {
        "name": "丰都县",
        "c": []
      }, {
        "name": "垫江县",
        "c": []
      }, {
        "name": "武隆县",
        "c": []
      }, {
        "name": "忠县",
        "c": []
      }, {
        "name": "云阳县",
        "c": []
      }, {
        "name": "奉节县",
        "c": []
      }, {
        "name": "巫山县",
        "c": []
      }, {
        "name": "巫溪县",
        "c": []
      }, {
        "name": "石柱土家族自治县",
        "c": []
      }, {
        "name": "秀山土家族苗族自治县",
        "c": []
      }, {
        "name": "酉阳土家族苗族自治县",
        "c": []
      }, {
        "name": "彭水苗族土家族自治县",
        "c": []
      }
    ]
  }, {
    "name": "四川省",
    "c": [
      {
        "name": "成都市",
        "c": [
          {
            "name": "锦江区"
          }, {
            "name": "青羊区"
          }, {
            "name": "金牛区"
          }, {
            "name": "武侯区"
          }, {
            "name": "成华区"
          }, {
            "name": "龙泉驿区"
          }, {
            "name": "青白江区"
          }, {
            "name": "新都区"
          }, {
            "name": "温江区"
          }, {
            "name": "双流区"
          }, {
            "name": "金堂县"
          }, {
            "name": "郫县"
          }, {
            "name": "大邑县"
          }, {
            "name": "蒲江县"
          }, {
            "name": "新津县"
          }, {
            "name": "简阳市"
          }, {
            "name": "都江堰市"
          }, {
            "name": "彭州市"
          }, {
            "name": "邛崃市"
          }, {
            "name": "崇州市"
          }
        ]
      }, {
        "name": "自贡市",
        "c": [
          {
            "name": "自流井区"
          }, {
            "name": "贡井区"
          }, {
            "name": "大安区"
          }, {
            "name": "沿滩区"
          }, {
            "name": "荣县"
          }, {
            "name": "富顺县"
          }
        ]
      }, {
        "name": "攀枝花市",
        "c": [
          {
            "name": "东区"
          }, {
            "name": "西区"
          }, {
            "name": "仁和区"
          }, {
            "name": "米易县"
          }, {
            "name": "盐边县"
          }
        ]
      }, {
        "name": "泸州市",
        "c": [
          {
            "name": "江阳区"
          }, {
            "name": "纳溪区"
          }, {
            "name": "龙马潭区"
          }, {
            "name": "泸县"
          }, {
            "name": "合江县"
          }, {
            "name": "叙永县"
          }, {
            "name": "古蔺县"
          }
        ]
      }, {
        "name": "德阳市",
        "c": [
          {
            "name": "旌阳区"
          }, {
            "name": "中江县"
          }, {
            "name": "罗江县"
          }, {
            "name": "广汉市"
          }, {
            "name": "什邡市"
          }, {
            "name": "绵竹市"
          }
        ]
      }, {
        "name": "绵阳市",
        "c": [
          {
            "name": "涪城区"
          }, {
            "name": "游仙区"
          }, {
            "name": "安州区"
          }, {
            "name": "三台县"
          }, {
            "name": "盐亭县"
          }, {
            "name": "梓潼县"
          }, {
            "name": "北川羌族自治县"
          }, {
            "name": "平武县"
          }, {
            "name": "江油市"
          }
        ]
      }, {
        "name": "广元市",
        "c": [
          {
            "name": "利州区"
          }, {
            "name": "昭化区"
          }, {
            "name": "朝天区"
          }, {
            "name": "旺苍县"
          }, {
            "name": "青川县"
          }, {
            "name": "剑阁县"
          }, {
            "name": "苍溪县"
          }
        ]
      }, {
        "name": "遂宁市",
        "c": [
          {
            "name": "船山区"
          }, {
            "name": "安居区"
          }, {
            "name": "蓬溪县"
          }, {
            "name": "射洪县"
          }, {
            "name": "大英县"
          }
        ]
      }, {
        "name": "内江市",
        "c": [
          {
            "name": "市中区"
          }, {
            "name": "东兴区"
          }, {
            "name": "威远县"
          }, {
            "name": "资中县"
          }, {
            "name": "隆昌县"
          }
        ]
      }, {
        "name": "乐山市",
        "c": [
          {
            "name": "市中区"
          }, {
            "name": "沙湾区"
          }, {
            "name": "五通桥区"
          }, {
            "name": "金口河区"
          }, {
            "name": "犍为县"
          }, {
            "name": "井研县"
          }, {
            "name": "夹江县"
          }, {
            "name": "沐川县"
          }, {
            "name": "峨边彝族自治县"
          }, {
            "name": "马边彝族自治县"
          }, {
            "name": "峨眉山市"
          }
        ]
      }, {
        "name": "南充市",
        "c": [
          {
            "name": "顺庆区"
          }, {
            "name": "高坪区"
          }, {
            "name": "嘉陵区"
          }, {
            "name": "南部县"
          }, {
            "name": "营山县"
          }, {
            "name": "蓬安县"
          }, {
            "name": "仪陇县"
          }, {
            "name": "西充县"
          }, {
            "name": "阆中市"
          }
        ]
      }, {
        "name": "眉山市",
        "c": [
          {
            "name": "东坡区"
          }, {
            "name": "彭山区"
          }, {
            "name": "仁寿县"
          }, {
            "name": "洪雅县"
          }, {
            "name": "丹棱县"
          }, {
            "name": "青神县"
          }
        ]
      }, {
        "name": "宜宾市",
        "c": [
          {
            "name": "翠屏区"
          }, {
            "name": "南溪区"
          }, {
            "name": "宜宾县"
          }, {
            "name": "江安县"
          }, {
            "name": "长宁县"
          }, {
            "name": "高县"
          }, {
            "name": "珙县"
          }, {
            "name": "筠连县"
          }, {
            "name": "兴文县"
          }, {
            "name": "屏山县"
          }
        ]
      }, {
        "name": "广安市",
        "c": [
          {
            "name": "广安区"
          }, {
            "name": "前锋区"
          }, {
            "name": "岳池县"
          }, {
            "name": "武胜县"
          }, {
            "name": "邻水县"
          }, {
            "name": "华蓥市"
          }
        ]
      }, {
        "name": "达州市",
        "c": [
          {
            "name": "通川区"
          }, {
            "name": "达川区"
          }, {
            "name": "宣汉县"
          }, {
            "name": "开江县"
          }, {
            "name": "大竹县"
          }, {
            "name": "渠县"
          }, {
            "name": "万源市"
          }
        ]
      }, {
        "name": "雅安市",
        "c": [
          {
            "name": "雨城区"
          }, {
            "name": "名山区"
          }, {
            "name": "荥经县"
          }, {
            "name": "汉源县"
          }, {
            "name": "石棉县"
          }, {
            "name": "天全县"
          }, {
            "name": "芦山县"
          }, {
            "name": "宝兴县"
          }
        ]
      }, {
        "name": "巴中市",
        "c": [
          {
            "name": "巴州区"
          }, {
            "name": "恩阳区"
          }, {
            "name": "通江县"
          }, {
            "name": "南江县"
          }, {
            "name": "平昌县"
          }
        ]
      }, {
        "name": "资阳市",
        "c": [
          {
            "name": "雁江区"
          }, {
            "name": "安岳县"
          }, {
            "name": "乐至县"
          }
        ]
      }, {
        "name": "阿坝藏族羌族自治州",
        "c": [
          {
            "name": "马尔康市"
          }, {
            "name": "汶川县"
          }, {
            "name": "理县"
          }, {
            "name": "茂县"
          }, {
            "name": "松潘县"
          }, {
            "name": "九寨沟县"
          }, {
            "name": "金川县"
          }, {
            "name": "小金县"
          }, {
            "name": "黑水县"
          }, {
            "name": "壤塘县"
          }, {
            "name": "阿坝县"
          }, {
            "name": "若尔盖县"
          }, {
            "name": "红原县"
          }
        ]
      }, {
        "name": "甘孜藏族自治州",
        "c": [
          {
            "name": "康定市"
          }, {
            "name": "泸定县"
          }, {
            "name": "丹巴县"
          }, {
            "name": "九龙县"
          }, {
            "name": "雅江县"
          }, {
            "name": "道孚县"
          }, {
            "name": "炉霍县"
          }, {
            "name": "甘孜县"
          }, {
            "name": "新龙县"
          }, {
            "name": "德格县"
          }, {
            "name": "白玉县"
          }, {
            "name": "石渠县"
          }, {
            "name": "色达县"
          }, {
            "name": "理塘县"
          }, {
            "name": "巴塘县"
          }, {
            "name": "乡城县"
          }, {
            "name": "稻城县"
          }, {
            "name": "得荣县"
          }
        ]
      }, {
        "name": "凉山彝族自治州",
        "c": [
          {
            "name": "西昌市"
          }, {
            "name": "木里藏族自治县"
          }, {
            "name": "盐源县"
          }, {
            "name": "德昌县"
          }, {
            "name": "会理县"
          }, {
            "name": "会东县"
          }, {
            "name": "宁南县"
          }, {
            "name": "普格县"
          }, {
            "name": "布拖县"
          }, {
            "name": "金阳县"
          }, {
            "name": "昭觉县"
          }, {
            "name": "喜德县"
          }, {
            "name": "冕宁县"
          }, {
            "name": "越西县"
          }, {
            "name": "甘洛县"
          }, {
            "name": "美姑县"
          }, {
            "name": "雷波县"
          }
        ]
      }
    ]
  }, {
    "name": "贵州省",
    "c": [
      {
        "name": "贵阳市",
        "c": [
          {
            "name": "南明区"
          }, {
            "name": "云岩区"
          }, {
            "name": "花溪区"
          }, {
            "name": "乌当区"
          }, {
            "name": "白云区"
          }, {
            "name": "观山湖区"
          }, {
            "name": "开阳县"
          }, {
            "name": "息烽县"
          }, {
            "name": "修文县"
          }, {
            "name": "清镇市"
          }
        ]
      }, {
        "name": "六盘水市",
        "c": [
          {
            "name": "钟山区"
          }, {
            "name": "六枝特区"
          }, {
            "name": "水城县"
          }, {
            "name": "盘县"
          }
        ]
      }, {
        "name": "遵义市",
        "c": [
          {
            "name": "红花岗区"
          }, {
            "name": "汇川区"
          }, {
            "name": "遵义县"
          }, {
            "name": "桐梓县"
          }, {
            "name": "绥阳县"
          }, {
            "name": "正安县"
          }, {
            "name": "道真仡佬族苗族自治县"
          }, {
            "name": "务川仡佬族苗族自治县"
          }, {
            "name": "凤冈县"
          }, {
            "name": "湄潭县"
          }, {
            "name": "余庆县"
          }, {
            "name": "习水县"
          }, {
            "name": "赤水市"
          }, {
            "name": "仁怀市"
          }
        ]
      }, {
        "name": "安顺市",
        "c": [
          {
            "name": "西秀区"
          }, {
            "name": "平坝区"
          }, {
            "name": "普定县"
          }, {
            "name": "镇宁布依族苗族自治县"
          }, {
            "name": "关岭布依族苗族自治县"
          }, {
            "name": "紫云苗族布依族自治县"
          }
        ]
      }, {
        "name": "毕节市",
        "c": [
          {
            "name": "七星关区"
          }, {
            "name": "大方县"
          }, {
            "name": "黔西县"
          }, {
            "name": "金沙县"
          }, {
            "name": "织金县"
          }, {
            "name": "纳雍县"
          }, {
            "name": "威宁彝族回族苗族自治县"
          }, {
            "name": "赫章县"
          }
        ]
      }, {
        "name": "铜仁市",
        "c": [
          {
            "name": "碧江区"
          }, {
            "name": "万山区"
          }, {
            "name": "江口县"
          }, {
            "name": "玉屏侗族自治县"
          }, {
            "name": "石阡县"
          }, {
            "name": "思南县"
          }, {
            "name": "印江土家族苗族自治县"
          }, {
            "name": "德江县"
          }, {
            "name": "沿河土家族自治县"
          }, {
            "name": "松桃苗族自治县"
          }
        ]
      }, {
        "name": "黔西南布依族苗族自治州",
        "c": [
          {
            "name": "兴义市"
          }, {
            "name": "兴仁县"
          }, {
            "name": "普安县"
          }, {
            "name": "晴隆县"
          }, {
            "name": "贞丰县"
          }, {
            "name": "望谟县"
          }, {
            "name": "册亨县"
          }, {
            "name": "安龙县"
          }
        ]
      }, {
        "name": "黔东南苗族侗族自治州",
        "c": [
          {
            "name": "凯里市"
          }, {
            "name": "黄平县"
          }, {
            "name": "施秉县"
          }, {
            "name": "三穗县"
          }, {
            "name": "镇远县"
          }, {
            "name": "岑巩县"
          }, {
            "name": "天柱县"
          }, {
            "name": "锦屏县"
          }, {
            "name": "剑河县"
          }, {
            "name": "台江县"
          }, {
            "name": "黎平县"
          }, {
            "name": "榕江县"
          }, {
            "name": "从江县"
          }, {
            "name": "雷山县"
          }, {
            "name": "麻江县"
          }, {
            "name": "丹寨县"
          }
        ]
      }, {
        "name": "黔南布依族苗族自治州",
        "c": [
          {
            "name": "都匀市"
          }, {
            "name": "福泉市"
          }, {
            "name": "荔波县"
          }, {
            "name": "贵定县"
          }, {
            "name": "瓮安县"
          }, {
            "name": "独山县"
          }, {
            "name": "平塘县"
          }, {
            "name": "罗甸县"
          }, {
            "name": "长顺县"
          }, {
            "name": "龙里县"
          }, {
            "name": "惠水县"
          }, {
            "name": "三都水族自治县"
          }
        ]
      }
    ]
  }, {
    "name": "云南省",
    "c": [
      {
        "name": "昆明市",
        "c": [
          {
            "name": "五华区"
          }, {
            "name": "盘龙区"
          }, {
            "name": "官渡区"
          }, {
            "name": "西山区"
          }, {
            "name": "东川区"
          }, {
            "name": "呈贡区"
          }, {
            "name": "晋宁县"
          }, {
            "name": "富民县"
          }, {
            "name": "宜良县"
          }, {
            "name": "石林彝族自治县"
          }, {
            "name": "嵩明县"
          }, {
            "name": "禄劝彝族苗族自治县"
          }, {
            "name": "寻甸回族彝族自治县"
          }, {
            "name": "安宁市"
          }
        ]
      }, {
        "name": "曲靖市",
        "c": [
          {
            "name": "麒麟区"
          }, {
            "name": "沾益区"
          }, {
            "name": "马龙县"
          }, {
            "name": "陆良县"
          }, {
            "name": "师宗县"
          }, {
            "name": "罗平县"
          }, {
            "name": "富源县"
          }, {
            "name": "会泽县"
          }, {
            "name": "宣威市"
          }
        ]
      }, {
        "name": "玉溪市",
        "c": [
          {
            "name": "红塔区"
          }, {
            "name": "江川区"
          }, {
            "name": "澄江县"
          }, {
            "name": "通海县"
          }, {
            "name": "华宁县"
          }, {
            "name": "易门县"
          }, {
            "name": "峨山彝族自治县"
          }, {
            "name": "新平彝族傣族自治县"
          }, {
            "name": "元江哈尼族彝族傣族自治县"
          }
        ]
      }, {
        "name": "保山市",
        "c": [
          {
            "name": "隆阳区"
          }, {
            "name": "施甸县"
          }, {
            "name": "龙陵县"
          }, {
            "name": "昌宁县"
          }, {
            "name": "腾冲市"
          }
        ]
      }, {
        "name": "昭通市",
        "c": [
          {
            "name": "昭阳区"
          }, {
            "name": "鲁甸县"
          }, {
            "name": "巧家县"
          }, {
            "name": "盐津县"
          }, {
            "name": "大关县"
          }, {
            "name": "永善县"
          }, {
            "name": "绥江县"
          }, {
            "name": "镇雄县"
          }, {
            "name": "彝良县"
          }, {
            "name": "威信县"
          }, {
            "name": "水富县"
          }
        ]
      }, {
        "name": "丽江市",
        "c": [
          {
            "name": "古城区"
          }, {
            "name": "玉龙纳西族自治县"
          }, {
            "name": "永胜县"
          }, {
            "name": "华坪县"
          }, {
            "name": "宁蒗彝族自治县"
          }
        ]
      }, {
        "name": "普洱市",
        "c": [
          {
            "name": "思茅区"
          }, {
            "name": "宁洱哈尼族彝族自治县"
          }, {
            "name": "墨江哈尼族自治县"
          }, {
            "name": "景东彝族自治县"
          }, {
            "name": "景谷傣族彝族自治县"
          }, {
            "name": "镇沅彝族哈尼族拉祜族自治县"
          }, {
            "name": "江城哈尼族彝族自治县"
          }, {
            "name": "孟连傣族拉祜族佤族自治县"
          }, {
            "name": "澜沧拉祜族自治县"
          }, {
            "name": "西盟佤族自治县"
          }
        ]
      }, {
        "name": "临沧市",
        "c": [
          {
            "name": "临翔区"
          }, {
            "name": "凤庆县"
          }, {
            "name": "云县"
          }, {
            "name": "永德县"
          }, {
            "name": "镇康县"
          }, {
            "name": "双江拉祜族佤族布朗族傣族自治县"
          }, {
            "name": "耿马傣族佤族自治县"
          }, {
            "name": "沧源佤族自治县"
          }
        ]
      }, {
        "name": "楚雄彝族自治州",
        "c": [
          {
            "name": "楚雄市"
          }, {
            "name": "双柏县"
          }, {
            "name": "牟定县"
          }, {
            "name": "南华县"
          }, {
            "name": "姚安县"
          }, {
            "name": "大姚县"
          }, {
            "name": "永仁县"
          }, {
            "name": "元谋县"
          }, {
            "name": "武定县"
          }, {
            "name": "禄丰县"
          }
        ]
      }, {
        "name": "红河哈尼族彝族自治州",
        "c": [
          {
            "name": "个旧市"
          }, {
            "name": "开远市"
          }, {
            "name": "蒙自市"
          }, {
            "name": "弥勒市"
          }, {
            "name": "屏边苗族自治县"
          }, {
            "name": "建水县"
          }, {
            "name": "石屏县"
          }, {
            "name": "泸西县"
          }, {
            "name": "元阳县"
          }, {
            "name": "红河县"
          }, {
            "name": "金平苗族瑶族傣族自治县"
          }, {
            "name": "绿春县"
          }, {
            "name": "河口瑶族自治县"
          }
        ]
      }, {
        "name": "文山壮族苗族自治州",
        "c": [
          {
            "name": "文山市"
          }, {
            "name": "砚山县"
          }, {
            "name": "西畴县"
          }, {
            "name": "麻栗坡县"
          }, {
            "name": "马关县"
          }, {
            "name": "丘北县"
          }, {
            "name": "广南县"
          }, {
            "name": "富宁县"
          }
        ]
      }, {
        "name": "西双版纳傣族自治州",
        "c": [
          {
            "name": "景洪市"
          }, {
            "name": "勐海县"
          }, {
            "name": "勐腊县"
          }
        ]
      }, {
        "name": "大理白族自治州",
        "c": [
          {
            "name": "大理市"
          }, {
            "name": "漾濞彝族自治县"
          }, {
            "name": "祥云县"
          }, {
            "name": "宾川县"
          }, {
            "name": "弥渡县"
          }, {
            "name": "南涧彝族自治县"
          }, {
            "name": "巍山彝族回族自治县"
          }, {
            "name": "永平县"
          }, {
            "name": "云龙县"
          }, {
            "name": "洱源县"
          }, {
            "name": "剑川县"
          }, {
            "name": "鹤庆县"
          }
        ]
      }, {
        "name": "德宏傣族景颇族自治州",
        "c": [
          {
            "name": "瑞丽市"
          }, {
            "name": "芒市"
          }, {
            "name": "梁河县"
          }, {
            "name": "盈江县"
          }, {
            "name": "陇川县"
          }
        ]
      }, {
        "name": "怒江傈僳族自治州",
        "c": [
          {
            "name": "泸水市"
          }, {
            "name": "福贡县"
          }, {
            "name": "贡山独龙族怒族自治县"
          }, {
            "name": "兰坪白族普米族自治县"
          }
        ]
      }, {
        "name": "迪庆藏族自治州",
        "c": [
          {
            "name": "香格里拉市"
          }, {
            "name": "德钦县"
          }, {
            "name": "维西傈僳族自治县"
          }
        ]
      }
    ]
  }, {
    "name": "西藏自治区",
    "c": [
      {
        "name": "拉萨市",
        "c": [
          {
            "name": "城关区"
          }, {
            "name": "堆龙德庆区"
          }, {
            "name": "林周县"
          }, {
            "name": "当雄县"
          }, {
            "name": "尼木县"
          }, {
            "name": "曲水县"
          }, {
            "name": "达孜县"
          }, {
            "name": "墨竹工卡县"
          }
        ]
      }, {
        "name": "日喀则市",
        "c": [
          {
            "name": "桑珠孜区"
          }, {
            "name": "南木林县"
          }, {
            "name": "江孜县"
          }, {
            "name": "定日县"
          }, {
            "name": "萨迦县"
          }, {
            "name": "拉孜县"
          }, {
            "name": "昂仁县"
          }, {
            "name": "谢通门县"
          }, {
            "name": "白朗县"
          }, {
            "name": "仁布县"
          }, {
            "name": "康马县"
          }, {
            "name": "定结县"
          }, {
            "name": "仲巴县"
          }, {
            "name": "亚东县"
          }, {
            "name": "吉隆县"
          }, {
            "name": "聂拉木县"
          }, {
            "name": "萨嘎县"
          }, {
            "name": "岗巴县"
          }
        ]
      }, {
        "name": "昌都市",
        "c": [
          {
            "name": "卡若区"
          }, {
            "name": "江达县"
          }, {
            "name": "贡觉县"
          }, {
            "name": "类乌齐县"
          }, {
            "name": "丁青县"
          }, {
            "name": "察雅县"
          }, {
            "name": "八宿县"
          }, {
            "name": "左贡县"
          }, {
            "name": "芒康县"
          }, {
            "name": "洛隆县"
          }, {
            "name": "边坝县"
          }
        ]
      }, {
        "name": "林芝市",
        "c": [
          {
            "name": "巴宜区"
          }, {
            "name": "工布江达县"
          }, {
            "name": "米林县"
          }, {
            "name": "墨脱县"
          }, {
            "name": "波密县"
          }, {
            "name": "察隅县"
          }, {
            "name": "朗县"
          }
        ]
      }, {
        "name": "山南市",
        "c": [
          {
            "name": "乃东区"
          }, {
            "name": "扎囊县"
          }, {
            "name": "贡嘎县"
          }, {
            "name": "桑日县"
          }, {
            "name": "琼结县"
          }, {
            "name": "曲松县"
          }, {
            "name": "措美县"
          }, {
            "name": "洛扎县"
          }, {
            "name": "加查县"
          }, {
            "name": "隆子县"
          }, {
            "name": "错那县"
          }, {
            "name": "浪卡子县"
          }
        ]
      }, {
        "name": "那曲地区",
        "c": [
          {
            "name": "那曲县"
          }, {
            "name": "嘉黎县"
          }, {
            "name": "比如县"
          }, {
            "name": "聂荣县"
          }, {
            "name": "安多县"
          }, {
            "name": "申扎县"
          }, {
            "name": "索县"
          }, {
            "name": "班戈县"
          }, {
            "name": "巴青县"
          }, {
            "name": "尼玛县"
          }, {
            "name": "双湖县"
          }
        ]
      }, {
        "name": "阿里地区",
        "c": [
          {
            "name": "普兰县"
          }, {
            "name": "札达县"
          }, {
            "name": "噶尔县"
          }, {
            "name": "日土县"
          }, {
            "name": "革吉县"
          }, {
            "name": "改则县"
          }, {
            "name": "措勤县"
          }
        ]
      }
    ]
  }, {
    "name": "陕西省",
    "c": [
      {
        "name": "西安市",
        "c": [
          {
            "name": "新城区"
          }, {
            "name": "碑林区"
          }, {
            "name": "莲湖区"
          }, {
            "name": "灞桥区"
          }, {
            "name": "未央区"
          }, {
            "name": "雁塔区"
          }, {
            "name": "阎良区"
          }, {
            "name": "临潼区"
          }, {
            "name": "长安区"
          }, {
            "name": "高陵区"
          }, {
            "name": "蓝田县"
          }, {
            "name": "周至县"
          }, {
            "name": "户县"
          }
        ]
      }, {
        "name": "铜川市",
        "c": [
          {
            "name": "王益区"
          }, {
            "name": "印台区"
          }, {
            "name": "耀州区"
          }, {
            "name": "宜君县"
          }
        ]
      }, {
        "name": "宝鸡市",
        "c": [
          {
            "name": "渭滨区"
          }, {
            "name": "金台区"
          }, {
            "name": "陈仓区"
          }, {
            "name": "凤翔县"
          }, {
            "name": "岐山县"
          }, {
            "name": "扶风县"
          }, {
            "name": "眉县"
          }, {
            "name": "陇县"
          }, {
            "name": "千阳县"
          }, {
            "name": "麟游县"
          }, {
            "name": "凤县"
          }, {
            "name": "太白县"
          }
        ]
      }, {
        "name": "咸阳市",
        "c": [
          {
            "name": "秦都区"
          }, {
            "name": "杨陵区"
          }, {
            "name": "渭城区"
          }, {
            "name": "三原县"
          }, {
            "name": "泾阳县"
          }, {
            "name": "乾县"
          }, {
            "name": "礼泉县"
          }, {
            "name": "永寿县"
          }, {
            "name": "彬县"
          }, {
            "name": "长武县"
          }, {
            "name": "旬邑县"
          }, {
            "name": "淳化县"
          }, {
            "name": "武功县"
          }, {
            "name": "兴平市"
          }
        ]
      }, {
        "name": "渭南市",
        "c": [
          {
            "name": "临渭区"
          }, {
            "name": "华州区"
          }, {
            "name": "潼关县"
          }, {
            "name": "大荔县"
          }, {
            "name": "合阳县"
          }, {
            "name": "澄城县"
          }, {
            "name": "蒲城县"
          }, {
            "name": "白水县"
          }, {
            "name": "富平县"
          }, {
            "name": "韩城市"
          }, {
            "name": "华阴市"
          }
        ]
      }, {
        "name": "延安市",
        "c": [
          {
            "name": "宝塔区"
          }, {
            "name": "安塞区"
          }, {
            "name": "延长县"
          }, {
            "name": "延川县"
          }, {
            "name": "子长县"
          }, {
            "name": "志丹县"
          }, {
            "name": "吴起县"
          }, {
            "name": "甘泉县"
          }, {
            "name": "富县"
          }, {
            "name": "洛川县"
          }, {
            "name": "宜川县"
          }, {
            "name": "黄龙县"
          }, {
            "name": "黄陵县"
          }
        ]
      }, {
        "name": "汉中市",
        "c": [
          {
            "name": "汉台区"
          }, {
            "name": "南郑县"
          }, {
            "name": "城固县"
          }, {
            "name": "洋县"
          }, {
            "name": "西乡县"
          }, {
            "name": "勉县"
          }, {
            "name": "宁强县"
          }, {
            "name": "略阳县"
          }, {
            "name": "镇巴县"
          }, {
            "name": "留坝县"
          }, {
            "name": "佛坪县"
          }
        ]
      }, {
        "name": "榆林市",
        "c": [
          {
            "name": "榆阳区"
          }, {
            "name": "横山区"
          }, {
            "name": "神木县"
          }, {
            "name": "府谷县"
          }, {
            "name": "靖边县"
          }, {
            "name": "定边县"
          }, {
            "name": "绥德县"
          }, {
            "name": "米脂县"
          }, {
            "name": "佳县"
          }, {
            "name": "吴堡县"
          }, {
            "name": "清涧县"
          }, {
            "name": "子洲县"
          }
        ]
      }, {
        "name": "安康市",
        "c": [
          {
            "name": "汉滨区"
          }, {
            "name": "汉阴县"
          }, {
            "name": "石泉县"
          }, {
            "name": "宁陕县"
          }, {
            "name": "紫阳县"
          }, {
            "name": "岚皋县"
          }, {
            "name": "平利县"
          }, {
            "name": "镇坪县"
          }, {
            "name": "旬阳县"
          }, {
            "name": "白河县"
          }
        ]
      }, {
        "name": "商洛市",
        "c": [
          {
            "name": "商州区"
          }, {
            "name": "洛南县"
          }, {
            "name": "丹凤县"
          }, {
            "name": "商南县"
          }, {
            "name": "山阳县"
          }, {
            "name": "镇安县"
          }, {
            "name": "柞水县"
          }
        ]
      }
    ]
  }, {
    "name": "甘肃省",
    "c": [
      {
        "name": "兰州市",
        "c": [
          {
            "name": "城关区"
          }, {
            "name": "七里河区"
          }, {
            "name": "西固区"
          }, {
            "name": "安宁区"
          }, {
            "name": "红古区"
          }, {
            "name": "永登县"
          }, {
            "name": "皋兰县"
          }, {
            "name": "榆中县"
          }
        ]
      }, {
        "name": "嘉峪关市",
        "c": [
          {
            "name": "嘉峪关市"
          }
        ]
      }, {
        "name": "金昌市",
        "c": [
          {
            "name": "金川区"
          }, {
            "name": "永昌县"
          }
        ]
      }, {
        "name": "白银市",
        "c": [
          {
            "name": "白银区"
          }, {
            "name": "平川区"
          }, {
            "name": "靖远县"
          }, {
            "name": "会宁县"
          }, {
            "name": "景泰县"
          }
        ]
      }, {
        "name": "天水市",
        "c": [
          {
            "name": "秦州区"
          }, {
            "name": "麦积区"
          }, {
            "name": "清水县"
          }, {
            "name": "秦安县"
          }, {
            "name": "甘谷县"
          }, {
            "name": "武山县"
          }, {
            "name": "张家川回族自治县"
          }
        ]
      }, {
        "name": "武威市",
        "c": [
          {
            "name": "凉州区"
          }, {
            "name": "民勤县"
          }, {
            "name": "古浪县"
          }, {
            "name": "天祝藏族自治县"
          }
        ]
      }, {
        "name": "张掖市",
        "c": [
          {
            "name": "甘州区"
          }, {
            "name": "肃南裕固族自治县"
          }, {
            "name": "民乐县"
          }, {
            "name": "临泽县"
          }, {
            "name": "高台县"
          }, {
            "name": "山丹县"
          }
        ]
      }, {
        "name": "平凉市",
        "c": [
          {
            "name": "崆峒区"
          }, {
            "name": "泾川县"
          }, {
            "name": "灵台县"
          }, {
            "name": "崇信县"
          }, {
            "name": "华亭县"
          }, {
            "name": "庄浪县"
          }, {
            "name": "静宁县"
          }
        ]
      }, {
        "name": "酒泉市",
        "c": [
          {
            "name": "肃州区"
          }, {
            "name": "金塔县"
          }, {
            "name": "瓜州县"
          }, {
            "name": "肃北蒙古族自治县"
          }, {
            "name": "阿克塞哈萨克族自治县"
          }, {
            "name": "玉门市"
          }, {
            "name": "敦煌市"
          }
        ]
      }, {
        "name": "庆阳市",
        "c": [
          {
            "name": "西峰区"
          }, {
            "name": "庆城县"
          }, {
            "name": "环县"
          }, {
            "name": "华池县"
          }, {
            "name": "合水县"
          }, {
            "name": "正宁县"
          }, {
            "name": "宁县"
          }, {
            "name": "镇原县"
          }
        ]
      }, {
        "name": "定西市",
        "c": [
          {
            "name": "安定区"
          }, {
            "name": "通渭县"
          }, {
            "name": "陇西县"
          }, {
            "name": "渭源县"
          }, {
            "name": "临洮县"
          }, {
            "name": "漳县"
          }, {
            "name": "岷县"
          }
        ]
      }, {
        "name": "陇南市",
        "c": [
          {
            "name": "武都区"
          }, {
            "name": "成县"
          }, {
            "name": "文县"
          }, {
            "name": "宕昌县"
          }, {
            "name": "康县"
          }, {
            "name": "西和县"
          }, {
            "name": "礼县"
          }, {
            "name": "徽县"
          }, {
            "name": "两当县"
          }
        ]
      }, {
        "name": "临夏回族自治州",
        "c": [
          {
            "name": "临夏市"
          }, {
            "name": "临夏县"
          }, {
            "name": "康乐县"
          }, {
            "name": "永靖县"
          }, {
            "name": "广河县"
          }, {
            "name": "和政县"
          }, {
            "name": "东乡族自治县"
          }, {
            "name": "积石山保安族东乡族撒拉族自治县"
          }
        ]
      }, {
        "name": "甘南藏族自治州",
        "c": [
          {
            "name": "合作市"
          }, {
            "name": "临潭县"
          }, {
            "name": "卓尼县"
          }, {
            "name": "舟曲县"
          }, {
            "name": "迭部县"
          }, {
            "name": "玛曲县"
          }, {
            "name": "碌曲县"
          }, {
            "name": "夏河县"
          }
        ]
      }
    ]
  }, {
    "name": "青海省",
    "c": [
      {
        "name": "西宁市",
        "c": [
          {
            "name": "城东区"
          }, {
            "name": "城中区"
          }, {
            "name": "城西区"
          }, {
            "name": "城北区"
          }, {
            "name": "大通回族土族自治县"
          }, {
            "name": "湟中县"
          }, {
            "name": "湟源县"
          }
        ]
      }, {
        "name": "海东市",
        "c": [
          {
            "name": "乐都区"
          }, {
            "name": "平安区"
          }, {
            "name": "民和回族土族自治县"
          }, {
            "name": "互助土族自治县"
          }, {
            "name": "化隆回族自治县"
          }, {
            "name": "循化撒拉族自治县"
          }
        ]
      }, {
        "name": "海北藏族自治州",
        "c": [
          {
            "name": "门源回族自治县"
          }, {
            "name": "祁连县"
          }, {
            "name": "海晏县"
          }, {
            "name": "刚察县"
          }
        ]
      }, {
        "name": "黄南藏族自治州",
        "c": [
          {
            "name": "同仁县"
          }, {
            "name": "尖扎县"
          }, {
            "name": "泽库县"
          }, {
            "name": "河南蒙古族自治县"
          }
        ]
      }, {
        "name": "海南藏族自治州",
        "c": [
          {
            "name": "共和县"
          }, {
            "name": "同德县"
          }, {
            "name": "贵德县"
          }, {
            "name": "兴海县"
          }, {
            "name": "贵南县"
          }
        ]
      }, {
        "name": "果洛藏族自治州",
        "c": [
          {
            "name": "玛沁县"
          }, {
            "name": "班玛县"
          }, {
            "name": "甘德县"
          }, {
            "name": "达日县"
          }, {
            "name": "久治县"
          }, {
            "name": "玛多县"
          }
        ]
      }, {
        "name": "玉树藏族自治州",
        "c": [
          {
            "name": "玉树市"
          }, {
            "name": "杂多县"
          }, {
            "name": "称多县"
          }, {
            "name": "治多县"
          }, {
            "name": "囊谦县"
          }, {
            "name": "曲麻莱县"
          }
        ]
      }, {
        "name": "海西蒙古族藏族自治州",
        "c": [
          {
            "name": "格尔木市"
          }, {
            "name": "德令哈市"
          }, {
            "name": "乌兰县"
          }, {
            "name": "都兰县"
          }, {
            "name": "天峻县"
          }, {
            "name": "冷湖行政区"
          }, {
            "name": "大柴旦行政区"
          }, {
            "name": "茫崖行政区"
          }
        ]
      }
    ]
  }, {
    "name": "宁夏回族自治区",
    "c": [
      {
        "name": "银川市",
        "c": [
          {
            "name": "兴庆区"
          }, {
            "name": "西夏区"
          }, {
            "name": "金凤区"
          }, {
            "name": "永宁县"
          }, {
            "name": "贺兰县"
          }, {
            "name": "灵武市"
          }
        ]
      }, {
        "name": "石嘴山市",
        "c": [
          {
            "name": "大武口区"
          }, {
            "name": "惠农区"
          }, {
            "name": "平罗县"
          }
        ]
      }, {
        "name": "吴忠市",
        "c": [
          {
            "name": "利通区"
          }, {
            "name": "红寺堡区"
          }, {
            "name": "盐池县"
          }, {
            "name": "同心县"
          }, {
            "name": "青铜峡市"
          }
        ]
      }, {
        "name": "固原市",
        "c": [
          {
            "name": "原州区"
          }, {
            "name": "西吉县"
          }, {
            "name": "隆德县"
          }, {
            "name": "泾源县"
          }, {
            "name": "彭阳县"
          }
        ]
      }, {
        "name": "中卫市",
        "c": [
          {
            "name": "沙坡头区"
          }, {
            "name": "中宁县"
          }, {
            "name": "海原县"
          }
        ]
      }
    ]
  }, {
    "name": "新疆维吾尔自治区",
    "c": [
      {
        "name": "乌鲁木齐市",
        "c": [
          {
            "name": "天山区"
          }, {
            "name": "沙依巴克区"
          }, {
            "name": "新市区"
          }, {
            "name": "水磨沟区"
          }, {
            "name": "头屯河区"
          }, {
            "name": "达坂城区"
          }, {
            "name": "米东区"
          }, {
            "name": "乌鲁木齐县"
          }
        ]
      }, {
        "name": "克拉玛依市",
        "c": [
          {
            "name": "独山子区"
          }, {
            "name": "克拉玛依区"
          }, {
            "name": "白碱滩区"
          }, {
            "name": "乌尔禾区"
          }
        ]
      }, {
        "name": "吐鲁番市",
        "c": [
          {
            "name": "高昌区"
          }, {
            "name": "鄯善县"
          }, {
            "name": "托克逊县"
          }
        ]
      }, {
        "name": "哈密市",
        "c": [
          {
            "name": "伊州区"
          }, {
            "name": "巴里坤哈萨克自治县"
          }, {
            "name": "伊吾县"
          }
        ]
      }, {
        "name": "昌吉回族自治州",
        "c": [
          {
            "name": "昌吉市"
          }, {
            "name": "阜康市"
          }, {
            "name": "呼图壁县"
          }, {
            "name": "玛纳斯县"
          }, {
            "name": "奇台县"
          }, {
            "name": "吉木萨尔县"
          }, {
            "name": "木垒哈萨克自治县"
          }
        ]
      }, {
        "name": "博尔塔拉蒙古自治州",
        "c": [
          {
            "name": "博乐市"
          }, {
            "name": "阿拉山口市"
          }, {
            "name": "精河县"
          }, {
            "name": "温泉县"
          }
        ]
      }, {
        "name": "巴音郭楞蒙古自治州",
        "c": [
          {
            "name": "库尔勒市"
          }, {
            "name": "轮台县"
          }, {
            "name": "尉犁县"
          }, {
            "name": "若羌县"
          }, {
            "name": "且末县"
          }, {
            "name": "焉耆回族自治县"
          }, {
            "name": "和静县"
          }, {
            "name": "和硕县"
          }, {
            "name": "博湖县"
          }
        ]
      }, {
        "name": "阿克苏地区",
        "c": [
          {
            "name": "阿克苏市"
          }, {
            "name": "温宿县"
          }, {
            "name": "库车县"
          }, {
            "name": "沙雅县"
          }, {
            "name": "新和县"
          }, {
            "name": "拜城县"
          }, {
            "name": "乌什县"
          }, {
            "name": "阿瓦提县"
          }, {
            "name": "柯坪县"
          }
        ]
      }, {
        "name": "克孜勒苏柯尔克孜自治州",
        "c": [
          {
            "name": "阿图什市"
          }, {
            "name": "阿克陶县"
          }, {
            "name": "阿合奇县"
          }, {
            "name": "乌恰县"
          }
        ]
      }, {
        "name": "喀什地区",
        "c": [
          {
            "name": "喀什市"
          }, {
            "name": "疏附县"
          }, {
            "name": "疏勒县"
          }, {
            "name": "英吉沙县"
          }, {
            "name": "泽普县"
          }, {
            "name": "莎车县"
          }, {
            "name": "叶城县"
          }, {
            "name": "麦盖提县"
          }, {
            "name": "岳普湖县"
          }, {
            "name": "伽师县"
          }, {
            "name": "巴楚县"
          }, {
            "name": "塔什库尔干塔吉克自治县"
          }
        ]
      }, {
        "name": "和田地区",
        "c": [
          {
            "name": "和田市"
          }, {
            "name": "和田县"
          }, {
            "name": "墨玉县"
          }, {
            "name": "皮山县"
          }, {
            "name": "洛浦县"
          }, {
            "name": "策勒县"
          }, {
            "name": "于田县"
          }, {
            "name": "民丰县"
          }
        ]
      }, {
        "name": "伊犁哈萨克自治州",
        "c": [
          {
            "name": "伊宁市"
          }, {
            "name": "奎屯市"
          }, {
            "name": "霍尔果斯市"
          }, {
            "name": "伊宁县"
          }, {
            "name": "察布查尔锡伯自治县"
          }, {
            "name": "霍城县"
          }, {
            "name": "巩留县"
          }, {
            "name": "新源县"
          }, {
            "name": "昭苏县"
          }, {
            "name": "特克斯县"
          }, {
            "name": "尼勒克县"
          }
        ]
      }, {
        "name": "塔城地区",
        "c": [
          {
            "name": "塔城市"
          }, {
            "name": "乌苏市"
          }, {
            "name": "额敏县"
          }, {
            "name": "沙湾县"
          }, {
            "name": "托里县"
          }, {
            "name": "裕民县"
          }, {
            "name": "和布克赛尔蒙古自治县"
          }
        ]
      }, {
        "name": "阿勒泰地区",
        "c": [
          {
            "name": "阿勒泰市"
          }, {
            "name": "布尔津县"
          }, {
            "name": "富蕴县"
          }, {
            "name": "福海县"
          }, {
            "name": "哈巴河县"
          }, {
            "name": "青河县"
          }, {
            "name": "吉木乃县"
          }
        ]
      }, {
        "name": "石河子市",
        "c": []
      }, {
        "name": "阿拉尔市",
        "c": []
      }, {
        "name": "图木舒克市",
        "c": []
      }, {
        "name": "五家渠市",
        "c": []
      }, {
        "name": "北屯市",
        "c": []
      }, {
        "name": "铁门关市",
        "c": []
      }, {
        "name": "双河市",
        "c": []
      }, {
        "name": "可克达拉市",
        "c": []
      }
    ]
  }, {
    "name": "台湾",
    "c": []
  }, {
    "name": "香港特别行政区",
    "c": [
      {
        "name": "香港特别行政区",
        "c": []
      }, {
        "name": "中西区",
        "c": []
      }, {
        "name": "东区",
        "c": []
      }, {
        "name": "九龙城区",
        "c": []
      }, {
        "name": "观塘区",
        "c": []
      }, {
        "name": "南区",
        "c": []
      }, {
        "name": "深水埗区",
        "c": []
      }, {
        "name": "湾仔区",
        "c": []
      }, {
        "name": "黄大仙区",
        "c": []
      }, {
        "name": "油尖旺区",
        "c": []
      }, {
        "name": "离岛区",
        "c": []
      }, {
        "name": "葵青区",
        "c": []
      }, {
        "name": "北区",
        "c": []
      }, {
        "name": "西贡区",
        "c": []
      }, {
        "name": "沙田区",
        "c": []
      }, {
        "name": "屯门区",
        "c": []
      }, {
        "name": "大埔区",
        "c": []
      }, {
        "name": "荃湾区",
        "c": []
      }, {
        "name": "元朗区",
        "c": []
      }
    ]
  }, {
    "name": "澳门特别行政区",
    "c": [
      {
        "name": "澳门特别行政区",
        "c": []
      }, {
        "name": "澳门半岛",
        "c": []
      }, {
        "name": "凼仔",
        "c": []
      }, {
        "name": "路凼城",
        "c": []
      }, {
        "name": "路环",
        "c": []
      }
    ]
  }, {
    "name": "海外"
  }
];

locationsFormat = [];

provinceMap = {};

cityMap = {};

cityIndex = 0;

locationsJSON = '[[{"name":"北京","fullname":"北京市","id":"110000"},{"name":"天津","fullname":"天津市","id":"120000"},{"name":"河北","fullname":"河北省","id":"130000"},{"name":"山西","fullname":"山西省","id":"140000"},{"name":"内蒙古","fullname":"内蒙古自治区","id":"150000"},{"name":"辽宁","fullname":"辽宁省","id":"210000"},{"name":"吉林","fullname":"吉林省","id":"220000"},{"name":"黑龙江","fullname":"黑龙江省","id":"230000"},{"name":"上海","fullname":"上海市","id":"310000"},{"name":"江苏","fullname":"江苏省","id":"320000"},{"name":"浙江","fullname":"浙江省","id":"330000"},{"name":"安徽","fullname":"安徽省","id":"340000"},{"name":"福建","fullname":"福建省","id":"350000"},{"name":"江西","fullname":"江西省","id":"360000"},{"name":"山东","fullname":"山东省","id":"370000"},{"name":"河南","fullname":"河南省","id":"410000"},{"name":"湖北","fullname":"湖北省","id":"420000"},{"name":"湖南","fullname":"湖南省","id":"430000"},{"name":"广东","fullname":"广东省","id":"440000"},{"name":"广西","fullname":"广西壮族自治区","id":"450000"},{"name":"海南","fullname":"海南省","id":"460000"},{"name":"重庆","fullname":"重庆市","id":"500000"},{"name":"四川","fullname":"四川省","id":"510000"},{"name":"贵州","fullname":"贵州省","id":"520000"},{"name":"云南","fullname":"云南省","id":"530000"},{"name":"西藏","fullname":"西藏自治区","id":"540000"},{"name":"陕西","fullname":"陕西省","id":"610000"},{"name":"甘肃","fullname":"甘肃省","id":"620000"},{"name":"青海","fullname":"青海省","id":"630000"},{"name":"宁夏","fullname":"宁夏回族自治区","id":"640000"},{"name":"新疆","fullname":"新疆维吾尔自治区","id":"650000"},{"name":"台湾","fullname":"台湾","id":"710000"},{"name":"香港","fullname":"香港特别行政区","id":"810000"},{"name":"澳门","fullname":"澳门特别行政区","id":"820000"}],[{"name":"东城","fullname":"东城区","id":"110101"},{"name":"西城","fullname":"西城区","id":"110102"},{"name":"朝阳","fullname":"朝阳区","id":"110105"},{"name":"丰台","fullname":"丰台区","id":"110106"},{"name":"石景山","fullname":"石景山区","id":"110107"},{"name":"海淀","fullname":"海淀区","id":"110108"},{"name":"门头沟","fullname":"门头沟区","id":"110109"},{"name":"房山","fullname":"房山区","id":"110111"},{"name":"通州","fullname":"通州区","id":"110112"},{"name":"顺义","fullname":"顺义区","id":"110113"},{"name":"昌平","fullname":"昌平区","id":"110114"},{"name":"大兴","fullname":"大兴区","id":"110115"},{"name":"怀柔","fullname":"怀柔区","id":"110116"},{"name":"平谷","fullname":"平谷区","id":"110117"},{"name":"密云","fullname":"密云区","id":"110118"},{"name":"延庆","fullname":"延庆区","id":"110119"},{"name":"和平","fullname":"和平区","id":"120101"},{"name":"河东","fullname":"河东区","id":"120102"},{"name":"河西","fullname":"河西区","id":"120103"},{"name":"南开","fullname":"南开区","id":"120104"},{"name":"河北","fullname":"河北区","id":"120105"},{"name":"红桥","fullname":"红桥区","id":"120106"},{"name":"东丽","fullname":"东丽区","id":"120110"},{"name":"西青","fullname":"西青区","id":"120111"},{"name":"津南","fullname":"津南区","id":"120112"},{"name":"北辰","fullname":"北辰区","id":"120113"},{"name":"武清","fullname":"武清区","id":"120114"},{"name":"宝坻","fullname":"宝坻区","id":"120115"},{"name":"滨海","fullname":"滨海新区","id":"120116"},{"name":"宁河","fullname":"宁河区","id":"120117"},{"name":"静海","fullname":"静海区","id":"120118"},{"name":"蓟州","fullname":"蓟州区","id":"120119"},{"name":"石家庄","fullname":"石家庄市","id":"130100"},{"name":"唐山","fullname":"唐山市","id":"130200"},{"name":"秦皇岛","fullname":"秦皇岛市","id":"130300"},{"name":"邯郸","fullname":"邯郸市","id":"130400"},{"name":"邢台","fullname":"邢台市","id":"130500"},{"name":"保定","fullname":"保定市","id":"130600"},{"name":"张家口","fullname":"张家口市","id":"130700"},{"name":"承德","fullname":"承德市","id":"130800"},{"name":"沧州","fullname":"沧州市","id":"130900"},{"name":"廊坊","fullname":"廊坊市","id":"131000"},{"name":"衡水","fullname":"衡水市","id":"131100"},{"name":"定州","fullname":"定州市","id":"139001"},{"name":"辛集","fullname":"辛集市","id":"139002"},{"name":"太原","fullname":"太原市","id":"140100"},{"name":"大同","fullname":"大同市","id":"140200"},{"name":"阳泉","fullname":"阳泉市","id":"140300"},{"name":"长治","fullname":"长治市","id":"140400"},{"name":"晋城","fullname":"晋城市","id":"140500"},{"name":"朔州","fullname":"朔州市","id":"140600"},{"name":"晋中","fullname":"晋中市","id":"140700"},{"name":"运城","fullname":"运城市","id":"140800"},{"name":"忻州","fullname":"忻州市","id":"140900"},{"name":"临汾","fullname":"临汾市","id":"141000"},{"name":"吕梁","fullname":"吕梁市","id":"141100"},{"name":"呼和浩特","fullname":"呼和浩特市","id":"150100"},{"name":"包头","fullname":"包头市","id":"150200"},{"name":"乌海","fullname":"乌海市","id":"150300"},{"name":"赤峰","fullname":"赤峰市","id":"150400"},{"name":"通辽","fullname":"通辽市","id":"150500"},{"name":"鄂尔多斯","fullname":"鄂尔多斯市","id":"150600"},{"name":"呼伦贝尔","fullname":"呼伦贝尔市","id":"150700"},{"name":"巴彦淖尔","fullname":"巴彦淖尔市","id":"150800"},{"name":"乌兰察布","fullname":"乌兰察布市","id":"150900"},{"name":"兴安","fullname":"兴安盟","id":"152200"},{"name":"锡林郭勒","fullname":"锡林郭勒盟","id":"152500"},{"name":"阿拉善","fullname":"阿拉善盟","id":"152900"},{"name":"沈阳","fullname":"沈阳市","id":"210100"},{"name":"大连","fullname":"大连市","id":"210200"},{"name":"鞍山","fullname":"鞍山市","id":"210300"},{"name":"抚顺","fullname":"抚顺市","id":"210400"},{"name":"本溪","fullname":"本溪市","id":"210500"},{"name":"丹东","fullname":"丹东市","id":"210600"},{"name":"锦州","fullname":"锦州市","id":"210700"},{"name":"营口","fullname":"营口市","id":"210800"},{"name":"阜新","fullname":"阜新市","id":"210900"},{"name":"辽阳","fullname":"辽阳市","id":"211000"},{"name":"盘锦","fullname":"盘锦市","id":"211100"},{"name":"铁岭","fullname":"铁岭市","id":"211200"},{"name":"朝阳","fullname":"朝阳市","id":"211300"},{"name":"葫芦岛","fullname":"葫芦岛市","id":"211400"},{"name":"长春","fullname":"长春市","id":"220100"},{"name":"吉林","fullname":"吉林市","id":"220200"},{"name":"四平","fullname":"四平市","id":"220300"},{"name":"辽源","fullname":"辽源市","id":"220400"},{"name":"通化","fullname":"通化市","id":"220500"},{"name":"白山","fullname":"白山市","id":"220600"},{"name":"松原","fullname":"松原市","id":"220700"},{"name":"白城","fullname":"白城市","id":"220800"},{"name":"延边","fullname":"延边朝鲜族自治州","id":"222400"},{"name":"哈尔滨","fullname":"哈尔滨市","id":"230100"},{"name":"齐齐哈尔","fullname":"齐齐哈尔市","id":"230200"},{"name":"鸡西","fullname":"鸡西市","id":"230300"},{"name":"鹤岗","fullname":"鹤岗市","id":"230400"},{"name":"双鸭山","fullname":"双鸭山市","id":"230500"},{"name":"大庆","fullname":"大庆市","id":"230600"},{"name":"伊春","fullname":"伊春市","id":"230700"},{"name":"佳木斯","fullname":"佳木斯市","id":"230800"},{"name":"七台河","fullname":"七台河市","id":"230900"},{"name":"牡丹江","fullname":"牡丹江市","id":"231000"},{"name":"黑河","fullname":"黑河市","id":"231100"},{"name":"绥化","fullname":"绥化市","id":"231200"},{"name":"大兴安岭","fullname":"大兴安岭地区","id":"232700"},{"name":"黄浦","fullname":"黄浦区","id":"310101"},{"name":"徐汇","fullname":"徐汇区","id":"310104"},{"name":"长宁","fullname":"长宁区","id":"310105"},{"name":"静安","fullname":"静安区","id":"310106"},{"name":"普陀","fullname":"普陀区","id":"310107"},{"name":"虹口","fullname":"虹口区","id":"310109"},{"name":"杨浦","fullname":"杨浦区","id":"310110"},{"name":"闵行","fullname":"闵行区","id":"310112"},{"name":"宝山","fullname":"宝山区","id":"310113"},{"name":"嘉定","fullname":"嘉定区","id":"310114"},{"name":"浦东","fullname":"浦东新区","id":"310115"},{"name":"金山","fullname":"金山区","id":"310116"},{"name":"松江","fullname":"松江区","id":"310117"},{"name":"青浦","fullname":"青浦区","id":"310118"},{"name":"奉贤","fullname":"奉贤区","id":"310120"},{"name":"崇明","fullname":"崇明区","id":"310151"},{"name":"南京","fullname":"南京市","id":"320100"},{"name":"无锡","fullname":"无锡市","id":"320200"},{"name":"徐州","fullname":"徐州市","id":"320300"},{"name":"常州","fullname":"常州市","id":"320400"},{"name":"苏州","fullname":"苏州市","id":"320500"},{"name":"南通","fullname":"南通市","id":"320600"},{"name":"连云港","fullname":"连云港市","id":"320700"},{"name":"淮安","fullname":"淮安市","id":"320800"},{"name":"盐城","fullname":"盐城市","id":"320900"},{"name":"扬州","fullname":"扬州市","id":"321000"},{"name":"镇江","fullname":"镇江市","id":"321100"},{"name":"泰州","fullname":"泰州市","id":"321200"},{"name":"宿迁","fullname":"宿迁市","id":"321300"},{"name":"杭州","fullname":"杭州市","id":"330100"},{"name":"宁波","fullname":"宁波市","id":"330200"},{"name":"温州","fullname":"温州市","id":"330300"},{"name":"嘉兴","fullname":"嘉兴市","id":"330400"},{"name":"湖州","fullname":"湖州市","id":"330500"},{"name":"绍兴","fullname":"绍兴市","id":"330600"},{"name":"金华","fullname":"金华市","id":"330700"},{"name":"衢州","fullname":"衢州市","id":"330800"},{"name":"舟山","fullname":"舟山市","id":"330900"},{"name":"台州","fullname":"台州市","id":"331000"},{"name":"丽水","fullname":"丽水市","id":"331100"},{"name":"合肥","fullname":"合肥市","id":"340100"},{"name":"芜湖","fullname":"芜湖市","id":"340200"},{"name":"蚌埠","fullname":"蚌埠市","id":"340300"},{"name":"淮南","fullname":"淮南市","id":"340400"},{"name":"马鞍山","fullname":"马鞍山市","id":"340500"},{"name":"淮北","fullname":"淮北市","id":"340600"},{"name":"铜陵","fullname":"铜陵市","id":"340700"},{"name":"安庆","fullname":"安庆市","id":"340800"},{"name":"黄山","fullname":"黄山市","id":"341000"},{"name":"滁州","fullname":"滁州市","id":"341100"},{"name":"阜阳","fullname":"阜阳市","id":"341200"},{"name":"宿州","fullname":"宿州市","id":"341300"},{"name":"六安","fullname":"六安市","id":"341500"},{"name":"亳州","fullname":"亳州市","id":"341600"},{"name":"池州","fullname":"池州市","id":"341700"},{"name":"宣城","fullname":"宣城市","id":"341800"},{"name":"福州","fullname":"福州市","id":"350100"},{"name":"厦门","fullname":"厦门市","id":"350200"},{"name":"莆田","fullname":"莆田市","id":"350300"},{"name":"三明","fullname":"三明市","id":"350400"},{"name":"泉州","fullname":"泉州市","id":"350500"},{"name":"漳州","fullname":"漳州市","id":"350600"},{"name":"南平","fullname":"南平市","id":"350700"},{"name":"龙岩","fullname":"龙岩市","id":"350800"},{"name":"宁德","fullname":"宁德市","id":"350900"},{"name":"南昌","fullname":"南昌市","id":"360100"},{"name":"景德镇","fullname":"景德镇市","id":"360200"},{"name":"萍乡","fullname":"萍乡市","id":"360300"},{"name":"九江","fullname":"九江市","id":"360400"},{"name":"新余","fullname":"新余市","id":"360500"},{"name":"鹰潭","fullname":"鹰潭市","id":"360600"},{"name":"赣州","fullname":"赣州市","id":"360700"},{"name":"吉安","fullname":"吉安市","id":"360800"},{"name":"宜春","fullname":"宜春市","id":"360900"},{"name":"抚州","fullname":"抚州市","id":"361000"},{"name":"上饶","fullname":"上饶市","id":"361100"},{"name":"济南","fullname":"济南市","id":"370100"},{"name":"青岛","fullname":"青岛市","id":"370200"},{"name":"淄博","fullname":"淄博市","id":"370300"},{"name":"枣庄","fullname":"枣庄市","id":"370400"},{"name":"东营","fullname":"东营市","id":"370500"},{"name":"烟台","fullname":"烟台市","id":"370600"},{"name":"潍坊","fullname":"潍坊市","id":"370700"},{"name":"济宁","fullname":"济宁市","id":"370800"},{"name":"泰安","fullname":"泰安市","id":"370900"},{"name":"威海","fullname":"威海市","id":"371000"},{"name":"日照","fullname":"日照市","id":"371100"},{"name":"莱芜","fullname":"莱芜市","id":"371200"},{"name":"临沂","fullname":"临沂市","id":"371300"},{"name":"德州","fullname":"德州市","id":"371400"},{"name":"聊城","fullname":"聊城市","id":"371500"},{"name":"滨州","fullname":"滨州市","id":"371600"},{"name":"菏泽","fullname":"菏泽市","id":"371700"},{"name":"郑州","fullname":"郑州市","id":"410100"},{"name":"开封","fullname":"开封市","id":"410200"},{"name":"洛阳","fullname":"洛阳市","id":"410300"},{"name":"平顶山","fullname":"平顶山市","id":"410400"},{"name":"安阳","fullname":"安阳市","id":"410500"},{"name":"鹤壁","fullname":"鹤壁市","id":"410600"},{"name":"新乡","fullname":"新乡市","id":"410700"},{"name":"焦作","fullname":"焦作市","id":"410800"},{"name":"濮阳","fullname":"濮阳市","id":"410900"},{"name":"许昌","fullname":"许昌市","id":"411000"},{"name":"漯河","fullname":"漯河市","id":"411100"},{"name":"三门峡","fullname":"三门峡市","id":"411200"},{"name":"南阳","fullname":"南阳市","id":"411300"},{"name":"商丘","fullname":"商丘市","id":"411400"},{"name":"信阳","fullname":"信阳市","id":"411500"},{"name":"周口","fullname":"周口市","id":"411600"},{"name":"驻马店","fullname":"驻马店市","id":"411700"},{"name":"济源","fullname":"济源市","id":"419001"},{"name":"武汉","fullname":"武汉市","id":"420100"},{"name":"黄石","fullname":"黄石市","id":"420200"},{"name":"十堰","fullname":"十堰市","id":"420300"},{"name":"宜昌","fullname":"宜昌市","id":"420500"},{"name":"襄阳","fullname":"襄阳市","id":"420600"},{"name":"鄂州","fullname":"鄂州市","id":"420700"},{"name":"荆门","fullname":"荆门市","id":"420800"},{"name":"孝感","fullname":"孝感市","id":"420900"},{"name":"荆州","fullname":"荆州市","id":"421000"},{"name":"黄冈","fullname":"黄冈市","id":"421100"},{"name":"咸宁","fullname":"咸宁市","id":"421200"},{"name":"随州","fullname":"随州市","id":"421300"},{"name":"恩施","fullname":"恩施土家族苗族自治州","id":"422800"},{"name":"仙桃","fullname":"仙桃市","id":"429004"},{"name":"潜江","fullname":"潜江市","id":"429005"},{"name":"天门","fullname":"天门市","id":"429006"},{"name":"神农架","fullname":"神农架林区","id":"429021"},{"name":"长沙","fullname":"长沙市","id":"430100"},{"name":"株洲","fullname":"株洲市","id":"430200"},{"name":"湘潭","fullname":"湘潭市","id":"430300"},{"name":"衡阳","fullname":"衡阳市","id":"430400"},{"name":"邵阳","fullname":"邵阳市","id":"430500"},{"name":"岳阳","fullname":"岳阳市","id":"430600"},{"name":"常德","fullname":"常德市","id":"430700"},{"name":"张家界","fullname":"张家界市","id":"430800"},{"name":"益阳","fullname":"益阳市","id":"430900"},{"name":"郴州","fullname":"郴州市","id":"431000"},{"name":"永州","fullname":"永州市","id":"431100"},{"name":"怀化","fullname":"怀化市","id":"431200"},{"name":"娄底","fullname":"娄底市","id":"431300"},{"name":"湘西","fullname":"湘西土家族苗族自治州","id":"433100"},{"name":"广州","fullname":"广州市","id":"440100"},{"name":"韶关","fullname":"韶关市","id":"440200"},{"name":"深圳","fullname":"深圳市","id":"440300"},{"name":"珠海","fullname":"珠海市","id":"440400"},{"name":"汕头","fullname":"汕头市","id":"440500"},{"name":"佛山","fullname":"佛山市","id":"440600"},{"name":"江门","fullname":"江门市","id":"440700"},{"name":"湛江","fullname":"湛江市","id":"440800"},{"name":"茂名","fullname":"茂名市","id":"440900"},{"name":"肇庆","fullname":"肇庆市","id":"441200"},{"name":"惠州","fullname":"惠州市","id":"441300"},{"name":"梅州","fullname":"梅州市","id":"441400"},{"name":"汕尾","fullname":"汕尾市","id":"441500"},{"name":"河源","fullname":"河源市","id":"441600"},{"name":"阳江","fullname":"阳江市","id":"441700"},{"name":"清远","fullname":"清远市","id":"441800"},{"name":"东莞","fullname":"东莞市","id":"441900"},{"name":"中山","fullname":"中山市","id":"442000"},{"name":"潮州","fullname":"潮州市","id":"445100"},{"name":"揭阳","fullname":"揭阳市","id":"445200"},{"name":"云浮","fullname":"云浮市","id":"445300"},{"name":"南宁","fullname":"南宁市","id":"450100"},{"name":"柳州","fullname":"柳州市","id":"450200"},{"name":"桂林","fullname":"桂林市","id":"450300"},{"name":"梧州","fullname":"梧州市","id":"450400"},{"name":"北海","fullname":"北海市","id":"450500"},{"name":"防城港","fullname":"防城港市","id":"450600"},{"name":"钦州","fullname":"钦州市","id":"450700"},{"name":"贵港","fullname":"贵港市","id":"450800"},{"name":"玉林","fullname":"玉林市","id":"450900"},{"name":"百色","fullname":"百色市","id":"451000"},{"name":"贺州","fullname":"贺州市","id":"451100"},{"name":"河池","fullname":"河池市","id":"451200"},{"name":"来宾","fullname":"来宾市","id":"451300"},{"name":"崇左","fullname":"崇左市","id":"451400"},{"name":"海口","fullname":"海口市","id":"460100"},{"name":"三亚","fullname":"三亚市","id":"460200"},{"name":"三沙","fullname":"三沙市","id":"460300"},{"name":"儋州","fullname":"儋州市","id":"460400"},{"name":"五指山","fullname":"五指山市","id":"469001"},{"name":"琼海","fullname":"琼海市","id":"469002"},{"name":"文昌","fullname":"文昌市","id":"469005"},{"name":"万宁","fullname":"万宁市","id":"469006"},{"name":"东方","fullname":"东方市","id":"469007"},{"name":"定安","fullname":"定安县","id":"469021"},{"name":"屯昌","fullname":"屯昌县","id":"469022"},{"name":"澄迈","fullname":"澄迈县","id":"469023"},{"name":"临高","fullname":"临高县","id":"469024"},{"name":"白沙","fullname":"白沙黎族自治县","id":"469025"},{"name":"昌江","fullname":"昌江黎族自治县","id":"469026"},{"name":"乐东","fullname":"乐东黎族自治县","id":"469027"},{"name":"陵水","fullname":"陵水黎族自治县","id":"469028"},{"name":"保亭","fullname":"保亭黎族苗族自治县","id":"469029"},{"name":"琼中","fullname":"琼中黎族苗族自治县","id":"469030"},{"name":"万州","fullname":"万州区","id":"500101"},{"name":"涪陵","fullname":"涪陵区","id":"500102"},{"name":"渝中","fullname":"渝中区","id":"500103"},{"name":"大渡口","fullname":"大渡口区","id":"500104"},{"name":"江北","fullname":"江北区","id":"500105"},{"name":"沙坪坝","fullname":"沙坪坝区","id":"500106"},{"name":"九龙坡","fullname":"九龙坡区","id":"500107"},{"name":"南岸","fullname":"南岸区","id":"500108"},{"name":"北碚","fullname":"北碚区","id":"500109"},{"name":"綦江","fullname":"綦江区","id":"500110"},{"name":"大足","fullname":"大足区","id":"500111"},{"name":"渝北","fullname":"渝北区","id":"500112"},{"name":"巴南","fullname":"巴南区","id":"500113"},{"name":"黔江","fullname":"黔江区","id":"500114"},{"name":"长寿","fullname":"长寿区","id":"500115"},{"name":"江津","fullname":"江津区","id":"500116"},{"name":"合川","fullname":"合川区","id":"500117"},{"name":"永川","fullname":"永川区","id":"500118"},{"name":"南川","fullname":"南川区","id":"500119"},{"name":"璧山","fullname":"璧山区","id":"500120"},{"name":"铜梁","fullname":"铜梁区","id":"500151"},{"name":"潼南","fullname":"潼南区","id":"500152"},{"name":"荣昌","fullname":"荣昌区","id":"500153"},{"name":"开州","fullname":"开州区","id":"500154"},{"name":"梁平","fullname":"梁平县","id":"500228"},{"name":"城口","fullname":"城口县","id":"500229"},{"name":"丰都","fullname":"丰都县","id":"500230"},{"name":"垫江","fullname":"垫江县","id":"500231"},{"name":"武隆","fullname":"武隆县","id":"500232"},{"name":"忠县","fullname":"忠县","id":"500233"},{"name":"云阳","fullname":"云阳县","id":"500235"},{"name":"奉节","fullname":"奉节县","id":"500236"},{"name":"巫山","fullname":"巫山县","id":"500237"},{"name":"巫溪","fullname":"巫溪县","id":"500238"},{"name":"石柱","fullname":"石柱土家族自治县","id":"500240"},{"name":"秀山","fullname":"秀山土家族苗族自治县","id":"500241"},{"name":"酉阳","fullname":"酉阳土家族苗族自治县","id":"500242"},{"name":"彭水","fullname":"彭水苗族土家族自治县","id":"500243"},{"name":"成都","fullname":"成都市","id":"510100"},{"name":"自贡","fullname":"自贡市","id":"510300"},{"name":"攀枝花","fullname":"攀枝花市","id":"510400"},{"name":"泸州","fullname":"泸州市","id":"510500"},{"name":"德阳","fullname":"德阳市","id":"510600"},{"name":"绵阳","fullname":"绵阳市","id":"510700"},{"name":"广元","fullname":"广元市","id":"510800"},{"name":"遂宁","fullname":"遂宁市","id":"510900"},{"name":"内江","fullname":"内江市","id":"511000"},{"name":"乐山","fullname":"乐山市","id":"511100"},{"name":"南充","fullname":"南充市","id":"511300"},{"name":"眉山","fullname":"眉山市","id":"511400"},{"name":"宜宾","fullname":"宜宾市","id":"511500"},{"name":"广安","fullname":"广安市","id":"511600"},{"name":"达州","fullname":"达州市","id":"511700"},{"name":"雅安","fullname":"雅安市","id":"511800"},{"name":"巴中","fullname":"巴中市","id":"511900"},{"name":"资阳","fullname":"资阳市","id":"512000"},{"name":"阿坝","fullname":"阿坝藏族羌族自治州","id":"513200"},{"name":"甘孜","fullname":"甘孜藏族自治州","id":"513300"},{"name":"凉山","fullname":"凉山彝族自治州","id":"513400"},{"name":"贵阳","fullname":"贵阳市","id":"520100"},{"name":"六盘水","fullname":"六盘水市","id":"520200"},{"name":"遵义","fullname":"遵义市","id":"520300"},{"name":"安顺","fullname":"安顺市","id":"520400"},{"name":"毕节","fullname":"毕节市","id":"520500"},{"name":"铜仁","fullname":"铜仁市","id":"520600"},{"name":"黔西南","fullname":"黔西南布依族苗族自治州","id":"522300"},{"name":"黔东南","fullname":"黔东南苗族侗族自治州","id":"522600"},{"name":"黔南","fullname":"黔南布依族苗族自治州","id":"522700"},{"name":"昆明","fullname":"昆明市","id":"530100"},{"name":"曲靖","fullname":"曲靖市","id":"530300"},{"name":"玉溪","fullname":"玉溪市","id":"530400"},{"name":"保山","fullname":"保山市","id":"530500"},{"name":"昭通","fullname":"昭通市","id":"530600"},{"name":"丽江","fullname":"丽江市","id":"530700"},{"name":"普洱","fullname":"普洱市","id":"530800"},{"name":"临沧","fullname":"临沧市","id":"530900"},{"name":"楚雄","fullname":"楚雄彝族自治州","id":"532300"},{"name":"红河","fullname":"红河哈尼族彝族自治州","id":"532500"},{"name":"文山","fullname":"文山壮族苗族自治州","id":"532600"},{"name":"西双版纳","fullname":"西双版纳傣族自治州","id":"532800"},{"name":"大理","fullname":"大理白族自治州","id":"532900"},{"name":"德宏","fullname":"德宏傣族景颇族自治州","id":"533100"},{"name":"怒江","fullname":"怒江傈僳族自治州","id":"533300"},{"name":"迪庆","fullname":"迪庆藏族自治州","id":"533400"},{"name":"拉萨","fullname":"拉萨市","id":"540100"},{"name":"日喀则","fullname":"日喀则市","id":"540200"},{"name":"昌都","fullname":"昌都市","id":"540300"},{"name":"林芝","fullname":"林芝市","id":"540400"},{"name":"山南","fullname":"山南市","id":"540500"},{"name":"那曲","fullname":"那曲地区","id":"542400"},{"name":"阿里","fullname":"阿里地区","id":"542500"},{"name":"西安","fullname":"西安市","id":"610100"},{"name":"铜川","fullname":"铜川市","id":"610200"},{"name":"宝鸡","fullname":"宝鸡市","id":"610300"},{"name":"咸阳","fullname":"咸阳市","id":"610400"},{"name":"渭南","fullname":"渭南市","id":"610500"},{"name":"延安","fullname":"延安市","id":"610600"},{"name":"汉中","fullname":"汉中市","id":"610700"},{"name":"榆林","fullname":"榆林市","id":"610800"},{"name":"安康","fullname":"安康市","id":"610900"},{"name":"商洛","fullname":"商洛市","id":"611000"},{"name":"兰州","fullname":"兰州市","id":"620100"},{"name":"嘉峪关","fullname":"嘉峪关市","id":"620200"},{"name":"金昌","fullname":"金昌市","id":"620300"},{"name":"白银","fullname":"白银市","id":"620400"},{"name":"天水","fullname":"天水市","id":"620500"},{"name":"武威","fullname":"武威市","id":"620600"},{"name":"张掖","fullname":"张掖市","id":"620700"},{"name":"平凉","fullname":"平凉市","id":"620800"},{"name":"酒泉","fullname":"酒泉市","id":"620900"},{"name":"庆阳","fullname":"庆阳市","id":"621000"},{"name":"定西","fullname":"定西市","id":"621100"},{"name":"陇南","fullname":"陇南市","id":"621200"},{"name":"临夏","fullname":"临夏回族自治州","id":"622900"},{"name":"甘南","fullname":"甘南藏族自治州","id":"623000"},{"name":"西宁","fullname":"西宁市","id":"630100"},{"name":"海东","fullname":"海东市","id":"630200"},{"name":"海北","fullname":"海北藏族自治州","id":"632200"},{"name":"黄南","fullname":"黄南藏族自治州","id":"632300"},{"name":"海南","fullname":"海南藏族自治州","id":"632500"},{"name":"果洛","fullname":"果洛藏族自治州","id":"632600"},{"name":"玉树","fullname":"玉树藏族自治州","id":"632700"},{"name":"海西","fullname":"海西蒙古族藏族自治州","id":"632800"},{"name":"银川","fullname":"银川市","id":"640100"},{"name":"石嘴山","fullname":"石嘴山市","id":"640200"},{"name":"吴忠","fullname":"吴忠市","id":"640300"},{"name":"固原","fullname":"固原市","id":"640400"},{"name":"中卫","fullname":"中卫市","id":"640500"},{"name":"乌鲁木齐","fullname":"乌鲁木齐市","id":"650100"},{"name":"克拉玛依","fullname":"克拉玛依市","id":"650200"},{"name":"吐鲁番","fullname":"吐鲁番市","id":"650400"},{"name":"哈密","fullname":"哈密市","id":"650500"},{"name":"昌吉","fullname":"昌吉回族自治州","id":"652300"},{"name":"博州","fullname":"博尔塔拉蒙古自治州","id":"652700"},{"name":"巴州","fullname":"巴音郭楞蒙古自治州","id":"652800"},{"name":"阿克苏","fullname":"阿克苏地区","id":"652900"},{"name":"克州","fullname":"克孜勒苏柯尔克孜自治州","id":"653000"},{"name":"喀什","fullname":"喀什地区","id":"653100"},{"name":"和田","fullname":"和田地区","id":"653200"},{"name":"伊犁","fullname":"伊犁哈萨克自治州","id":"654000"},{"name":"塔城","fullname":"塔城地区","id":"654200"},{"name":"阿勒泰","fullname":"阿勒泰地区","id":"654300"},{"name":"石河子","fullname":"石河子市","id":"659001"},{"name":"阿拉尔","fullname":"阿拉尔市","id":"659002"},{"name":"图木舒克","fullname":"图木舒克市","id":"659003"},{"name":"五家渠","fullname":"五家渠市","id":"659004"},{"name":"北屯","fullname":"北屯市","id":"659005"},{"name":"铁门关","fullname":"铁门关市","id":"659006"},{"name":"双河","fullname":"双河市","id":"659007"},{"name":"可克达拉","fullname":"可克达拉市","id":"659008"},{"name":"香港","fullname":"香港特别行政区","id":"810100"},{"name":"中西区","fullname":"中西区","id":"810101"},{"name":"东区","fullname":"东区","id":"810102"},{"name":"九龙","fullname":"九龙城区","id":"810103"},{"name":"观塘区","fullname":"观塘区","id":"810104"},{"name":"南区","fullname":"南区","id":"810105"},{"name":"深水埗区","fullname":"深水埗区","id":"810106"},{"name":"湾仔区","fullname":"湾仔区","id":"810107"},{"name":"黄大仙区","fullname":"黄大仙区","id":"810108"},{"name":"油尖旺区","fullname":"油尖旺区","id":"810109"},{"name":"离岛区","fullname":"离岛区","id":"810110"},{"name":"葵青区","fullname":"葵青区","id":"810111"},{"name":"北区","fullname":"北区","id":"810112"},{"name":"西贡区","fullname":"西贡区","id":"810113"},{"name":"沙田区","fullname":"沙田区","id":"810114"},{"name":"屯门区","fullname":"屯门区","id":"810115"},{"name":"大埔区","fullname":"大埔区","id":"810116"},{"name":"荃湾区","fullname":"荃湾区","id":"810117"},{"name":"元朗区","fullname":"元朗区","id":"810118"},{"name":"澳门","fullname":"澳门特别行政区","id":"820100"},{"name":"澳门半岛","fullname":"澳门半岛","id":"820101"},{"name":"凼仔","fullname":"凼仔","id":"820102"},{"name":"路凼城","fullname":"路凼城","id":"820103"},{"name":"路环","fullname":"路环","id":"820104"}],[{"fullname":"长安区","id":"130102"},{"fullname":"桥西区","id":"130104"},{"fullname":"新华区","id":"130105"},{"fullname":"井陉矿区","id":"130107"},{"fullname":"裕华区","id":"130108"},{"fullname":"藁城区","id":"130109"},{"fullname":"鹿泉区","id":"130110"},{"fullname":"栾城区","id":"130111"},{"fullname":"井陉县","id":"130121"},{"fullname":"正定县","id":"130123"},{"fullname":"行唐县","id":"130125"},{"fullname":"灵寿县","id":"130126"},{"fullname":"高邑县","id":"130127"},{"fullname":"深泽县","id":"130128"},{"fullname":"赞皇县","id":"130129"},{"fullname":"无极县","id":"130130"},{"fullname":"平山县","id":"130131"},{"fullname":"元氏县","id":"130132"},{"fullname":"赵县","id":"130133"},{"fullname":"晋州市","id":"130183"},{"fullname":"新乐市","id":"130184"},{"fullname":"路南区","id":"130202"},{"fullname":"路北区","id":"130203"},{"fullname":"古冶区","id":"130204"},{"fullname":"开平区","id":"130205"},{"fullname":"丰南区","id":"130207"},{"fullname":"丰润区","id":"130208"},{"fullname":"曹妃甸区","id":"130209"},{"fullname":"滦县","id":"130223"},{"fullname":"滦南县","id":"130224"},{"fullname":"乐亭县","id":"130225"},{"fullname":"迁西县","id":"130227"},{"fullname":"玉田县","id":"130229"},{"fullname":"遵化市","id":"130281"},{"fullname":"迁安市","id":"130283"},{"fullname":"海港区","id":"130302"},{"fullname":"山海关区","id":"130303"},{"fullname":"北戴河区","id":"130304"},{"fullname":"抚宁区","id":"130306"},{"fullname":"青龙满族自治县","id":"130321"},{"fullname":"昌黎县","id":"130322"},{"fullname":"卢龙县","id":"130324"},{"fullname":"邯山区","id":"130402"},{"fullname":"丛台区","id":"130403"},{"fullname":"复兴区","id":"130404"},{"fullname":"峰峰矿区","id":"130406"},{"fullname":"邯郸县","id":"130421"},{"fullname":"临漳县","id":"130423"},{"fullname":"成安县","id":"130424"},{"fullname":"大名县","id":"130425"},{"fullname":"涉县","id":"130426"},{"fullname":"磁县","id":"130427"},{"fullname":"肥乡县","id":"130428"},{"fullname":"永年县","id":"130429"},{"fullname":"邱县","id":"130430"},{"fullname":"鸡泽县","id":"130431"},{"fullname":"广平县","id":"130432"},{"fullname":"馆陶县","id":"130433"},{"fullname":"魏县","id":"130434"},{"fullname":"曲周县","id":"130435"},{"fullname":"武安市","id":"130481"},{"fullname":"桥东区","id":"130502"},{"fullname":"桥西区","id":"130503"},{"fullname":"邢台县","id":"130521"},{"fullname":"临城县","id":"130522"},{"fullname":"内丘县","id":"130523"},{"fullname":"柏乡县","id":"130524"},{"fullname":"隆尧县","id":"130525"},{"fullname":"任县","id":"130526"},{"fullname":"南和县","id":"130527"},{"fullname":"宁晋县","id":"130528"},{"fullname":"巨鹿县","id":"130529"},{"fullname":"新河县","id":"130530"},{"fullname":"广宗县","id":"130531"},{"fullname":"平乡县","id":"130532"},{"fullname":"威县","id":"130533"},{"fullname":"清河县","id":"130534"},{"fullname":"临西县","id":"130535"},{"fullname":"南宫市","id":"130581"},{"fullname":"沙河市","id":"130582"},{"fullname":"竞秀区","id":"130602"},{"fullname":"莲池区","id":"130606"},{"fullname":"满城区","id":"130607"},{"fullname":"清苑区","id":"130608"},{"fullname":"徐水区","id":"130609"},{"fullname":"涞水县","id":"130623"},{"fullname":"阜平县","id":"130624"},{"fullname":"定兴县","id":"130626"},{"fullname":"唐县","id":"130627"},{"fullname":"高阳县","id":"130628"},{"fullname":"容城县","id":"130629"},{"fullname":"涞源县","id":"130630"},{"fullname":"望都县","id":"130631"},{"fullname":"安新县","id":"130632"},{"fullname":"易县","id":"130633"},{"fullname":"曲阳县","id":"130634"},{"fullname":"蠡县","id":"130635"},{"fullname":"顺平县","id":"130636"},{"fullname":"博野县","id":"130637"},{"fullname":"雄县","id":"130638"},{"fullname":"涿州市","id":"130681"},{"fullname":"安国市","id":"130683"},{"fullname":"高碑店市","id":"130684"},{"fullname":"桥东区","id":"130702"},{"fullname":"桥西区","id":"130703"},{"fullname":"宣化区","id":"130705"},{"fullname":"下花园区","id":"130706"},{"fullname":"万全区","id":"130708"},{"fullname":"崇礼区","id":"130709"},{"fullname":"张北县","id":"130722"},{"fullname":"康保县","id":"130723"},{"fullname":"沽源县","id":"130724"},{"fullname":"尚义县","id":"130725"},{"fullname":"蔚县","id":"130726"},{"fullname":"阳原县","id":"130727"},{"fullname":"怀安县","id":"130728"},{"fullname":"怀来县","id":"130730"},{"fullname":"涿鹿县","id":"130731"},{"fullname":"赤城县","id":"130732"},{"fullname":"双桥区","id":"130802"},{"fullname":"双滦区","id":"130803"},{"fullname":"鹰手营子矿区","id":"130804"},{"fullname":"承德县","id":"130821"},{"fullname":"兴隆县","id":"130822"},{"fullname":"平泉县","id":"130823"},{"fullname":"滦平县","id":"130824"},{"fullname":"隆化县","id":"130825"},{"fullname":"丰宁满族自治县","id":"130826"},{"fullname":"宽城满族自治县","id":"130827"},{"fullname":"围场满族蒙古族自治县","id":"130828"},{"fullname":"新华区","id":"130902"},{"fullname":"运河区","id":"130903"},{"fullname":"沧县","id":"130921"},{"fullname":"青县","id":"130922"},{"fullname":"东光县","id":"130923"},{"fullname":"海兴县","id":"130924"},{"fullname":"盐山县","id":"130925"},{"fullname":"肃宁县","id":"130926"},{"fullname":"南皮县","id":"130927"},{"fullname":"吴桥县","id":"130928"},{"fullname":"献县","id":"130929"},{"fullname":"孟村回族自治县","id":"130930"},{"fullname":"泊头市","id":"130981"},{"fullname":"任丘市","id":"130982"},{"fullname":"黄骅市","id":"130983"},{"fullname":"河间市","id":"130984"},{"fullname":"安次区","id":"131002"},{"fullname":"广阳区","id":"131003"},{"fullname":"固安县","id":"131022"},{"fullname":"永清县","id":"131023"},{"fullname":"香河县","id":"131024"},{"fullname":"大城县","id":"131025"},{"fullname":"文安县","id":"131026"},{"fullname":"大厂回族自治县","id":"131028"},{"fullname":"霸州市","id":"131081"},{"fullname":"三河市","id":"131082"},{"fullname":"桃城区","id":"131102"},{"fullname":"冀州区","id":"131103"},{"fullname":"枣强县","id":"131121"},{"fullname":"武邑县","id":"131122"},{"fullname":"武强县","id":"131123"},{"fullname":"饶阳县","id":"131124"},{"fullname":"安平县","id":"131125"},{"fullname":"故城县","id":"131126"},{"fullname":"景县","id":"131127"},{"fullname":"阜城县","id":"131128"},{"fullname":"深州市","id":"131182"},{"fullname":"小店区","id":"140105"},{"fullname":"迎泽区","id":"140106"},{"fullname":"杏花岭区","id":"140107"},{"fullname":"尖草坪区","id":"140108"},{"fullname":"万柏林区","id":"140109"},{"fullname":"晋源区","id":"140110"},{"fullname":"清徐县","id":"140121"},{"fullname":"阳曲县","id":"140122"},{"fullname":"娄烦县","id":"140123"},{"fullname":"古交市","id":"140181"},{"fullname":"城区","id":"140202"},{"fullname":"矿区","id":"140203"},{"fullname":"南郊区","id":"140211"},{"fullname":"新荣区","id":"140212"},{"fullname":"阳高县","id":"140221"},{"fullname":"天镇县","id":"140222"},{"fullname":"广灵县","id":"140223"},{"fullname":"灵丘县","id":"140224"},{"fullname":"浑源县","id":"140225"},{"fullname":"左云县","id":"140226"},{"fullname":"大同县","id":"140227"},{"fullname":"城区","id":"140302"},{"fullname":"矿区","id":"140303"},{"fullname":"郊区","id":"140311"},{"fullname":"平定县","id":"140321"},{"fullname":"盂县","id":"140322"},{"fullname":"城区","id":"140402"},{"fullname":"郊区","id":"140411"},{"fullname":"长治县","id":"140421"},{"fullname":"襄垣县","id":"140423"},{"fullname":"屯留县","id":"140424"},{"fullname":"平顺县","id":"140425"},{"fullname":"黎城县","id":"140426"},{"fullname":"壶关县","id":"140427"},{"fullname":"长子县","id":"140428"},{"fullname":"武乡县","id":"140429"},{"fullname":"沁县","id":"140430"},{"fullname":"沁源县","id":"140431"},{"fullname":"潞城市","id":"140481"},{"fullname":"城区","id":"140502"},{"fullname":"沁水县","id":"140521"},{"fullname":"阳城县","id":"140522"},{"fullname":"陵川县","id":"140524"},{"fullname":"泽州县","id":"140525"},{"fullname":"高平市","id":"140581"},{"fullname":"朔城区","id":"140602"},{"fullname":"平鲁区","id":"140603"},{"fullname":"山阴县","id":"140621"},{"fullname":"应县","id":"140622"},{"fullname":"右玉县","id":"140623"},{"fullname":"怀仁县","id":"140624"},{"fullname":"榆次区","id":"140702"},{"fullname":"榆社县","id":"140721"},{"fullname":"左权县","id":"140722"},{"fullname":"和顺县","id":"140723"},{"fullname":"昔阳县","id":"140724"},{"fullname":"寿阳县","id":"140725"},{"fullname":"太谷县","id":"140726"},{"fullname":"祁县","id":"140727"},{"fullname":"平遥县","id":"140728"},{"fullname":"灵石县","id":"140729"},{"fullname":"介休市","id":"140781"},{"fullname":"盐湖区","id":"140802"},{"fullname":"临猗县","id":"140821"},{"fullname":"万荣县","id":"140822"},{"fullname":"闻喜县","id":"140823"},{"fullname":"稷山县","id":"140824"},{"fullname":"新绛县","id":"140825"},{"fullname":"绛县","id":"140826"},{"fullname":"垣曲县","id":"140827"},{"fullname":"夏县","id":"140828"},{"fullname":"平陆县","id":"140829"},{"fullname":"芮城县","id":"140830"},{"fullname":"永济市","id":"140881"},{"fullname":"河津市","id":"140882"},{"fullname":"忻府区","id":"140902"},{"fullname":"定襄县","id":"140921"},{"fullname":"五台县","id":"140922"},{"fullname":"代县","id":"140923"},{"fullname":"繁峙县","id":"140924"},{"fullname":"宁武县","id":"140925"},{"fullname":"静乐县","id":"140926"},{"fullname":"神池县","id":"140927"},{"fullname":"五寨县","id":"140928"},{"fullname":"岢岚县","id":"140929"},{"fullname":"河曲县","id":"140930"},{"fullname":"保德县","id":"140931"},{"fullname":"偏关县","id":"140932"},{"fullname":"原平市","id":"140981"},{"fullname":"尧都区","id":"141002"},{"fullname":"曲沃县","id":"141021"},{"fullname":"翼城县","id":"141022"},{"fullname":"襄汾县","id":"141023"},{"fullname":"洪洞县","id":"141024"},{"fullname":"古县","id":"141025"},{"fullname":"安泽县","id":"141026"},{"fullname":"浮山县","id":"141027"},{"fullname":"吉县","id":"141028"},{"fullname":"乡宁县","id":"141029"},{"fullname":"大宁县","id":"141030"},{"fullname":"隰县","id":"141031"},{"fullname":"永和县","id":"141032"},{"fullname":"蒲县","id":"141033"},{"fullname":"汾西县","id":"141034"},{"fullname":"侯马市","id":"141081"},{"fullname":"霍州市","id":"141082"},{"fullname":"离石区","id":"141102"},{"fullname":"文水县","id":"141121"},{"fullname":"交城县","id":"141122"},{"fullname":"兴县","id":"141123"},{"fullname":"临县","id":"141124"},{"fullname":"柳林县","id":"141125"},{"fullname":"石楼县","id":"141126"},{"fullname":"岚县","id":"141127"},{"fullname":"方山县","id":"141128"},{"fullname":"中阳县","id":"141129"},{"fullname":"交口县","id":"141130"},{"fullname":"孝义市","id":"141181"},{"fullname":"汾阳市","id":"141182"},{"fullname":"新城区","id":"150102"},{"fullname":"回民区","id":"150103"},{"fullname":"玉泉区","id":"150104"},{"fullname":"赛罕区","id":"150105"},{"fullname":"土默特左旗","id":"150121"},{"fullname":"托克托县","id":"150122"},{"fullname":"和林格尔县","id":"150123"},{"fullname":"清水河县","id":"150124"},{"fullname":"武川县","id":"150125"},{"fullname":"东河区","id":"150202"},{"fullname":"昆都仑区","id":"150203"},{"fullname":"青山区","id":"150204"},{"fullname":"石拐区","id":"150205"},{"fullname":"白云鄂博矿区","id":"150206"},{"fullname":"九原区","id":"150207"},{"fullname":"土默特右旗","id":"150221"},{"fullname":"固阳县","id":"150222"},{"fullname":"达尔罕茂明安联合旗","id":"150223"},{"fullname":"海勃湾区","id":"150302"},{"fullname":"海南区","id":"150303"},{"fullname":"乌达区","id":"150304"},{"fullname":"红山区","id":"150402"},{"fullname":"元宝山区","id":"150403"},{"fullname":"松山区","id":"150404"},{"fullname":"阿鲁科尔沁旗","id":"150421"},{"fullname":"巴林左旗","id":"150422"},{"fullname":"巴林右旗","id":"150423"},{"fullname":"林西县","id":"150424"},{"fullname":"克什克腾旗","id":"150425"},{"fullname":"翁牛特旗","id":"150426"},{"fullname":"喀喇沁旗","id":"150428"},{"fullname":"宁城县","id":"150429"},{"fullname":"敖汉旗","id":"150430"},{"fullname":"科尔沁区","id":"150502"},{"fullname":"科尔沁左翼中旗","id":"150521"},{"fullname":"科尔沁左翼后旗","id":"150522"},{"fullname":"开鲁县","id":"150523"},{"fullname":"库伦旗","id":"150524"},{"fullname":"奈曼旗","id":"150525"},{"fullname":"扎鲁特旗","id":"150526"},{"fullname":"霍林郭勒市","id":"150581"},{"fullname":"东胜区","id":"150602"},{"fullname":"达拉特旗","id":"150621"},{"fullname":"准格尔旗","id":"150622"},{"fullname":"鄂托克前旗","id":"150623"},{"fullname":"鄂托克旗","id":"150624"},{"fullname":"杭锦旗","id":"150625"},{"fullname":"乌审旗","id":"150626"},{"fullname":"伊金霍洛旗","id":"150627"},{"fullname":"海拉尔区","id":"150702"},{"fullname":"扎赉诺尔区","id":"150703"},{"fullname":"阿荣旗","id":"150721"},{"fullname":"莫力达瓦达斡尔族自治旗","id":"150722"},{"fullname":"鄂伦春自治旗","id":"150723"},{"fullname":"鄂温克族自治旗","id":"150724"},{"fullname":"陈巴尔虎旗","id":"150725"},{"fullname":"新巴尔虎左旗","id":"150726"},{"fullname":"新巴尔虎右旗","id":"150727"},{"fullname":"满洲里市","id":"150781"},{"fullname":"牙克石市","id":"150782"},{"fullname":"扎兰屯市","id":"150783"},{"fullname":"额尔古纳市","id":"150784"},{"fullname":"根河市","id":"150785"},{"fullname":"临河区","id":"150802"},{"fullname":"五原县","id":"150821"},{"fullname":"磴口县","id":"150822"},{"fullname":"乌拉特前旗","id":"150823"},{"fullname":"乌拉特中旗","id":"150824"},{"fullname":"乌拉特后旗","id":"150825"},{"fullname":"杭锦后旗","id":"150826"},{"fullname":"集宁区","id":"150902"},{"fullname":"卓资县","id":"150921"},{"fullname":"化德县","id":"150922"},{"fullname":"商都县","id":"150923"},{"fullname":"兴和县","id":"150924"},{"fullname":"凉城县","id":"150925"},{"fullname":"察哈尔右翼前旗","id":"150926"},{"fullname":"察哈尔右翼中旗","id":"150927"},{"fullname":"察哈尔右翼后旗","id":"150928"},{"fullname":"四子王旗","id":"150929"},{"fullname":"丰镇市","id":"150981"},{"fullname":"乌兰浩特市","id":"152201"},{"fullname":"阿尔山市","id":"152202"},{"fullname":"科尔沁右翼前旗","id":"152221"},{"fullname":"科尔沁右翼中旗","id":"152222"},{"fullname":"扎赉特旗","id":"152223"},{"fullname":"突泉县","id":"152224"},{"fullname":"二连浩特市","id":"152501"},{"fullname":"锡林浩特市","id":"152502"},{"fullname":"阿巴嘎旗","id":"152522"},{"fullname":"苏尼特左旗","id":"152523"},{"fullname":"苏尼特右旗","id":"152524"},{"fullname":"东乌珠穆沁旗","id":"152525"},{"fullname":"西乌珠穆沁旗","id":"152526"},{"fullname":"太仆寺旗","id":"152527"},{"fullname":"镶黄旗","id":"152528"},{"fullname":"正镶白旗","id":"152529"},{"fullname":"正蓝旗","id":"152530"},{"fullname":"多伦县","id":"152531"},{"fullname":"阿拉善左旗","id":"152921"},{"fullname":"阿拉善右旗","id":"152922"},{"fullname":"额济纳旗","id":"152923"},{"fullname":"和平区","id":"210102"},{"fullname":"沈河区","id":"210103"},{"fullname":"大东区","id":"210104"},{"fullname":"皇姑区","id":"210105"},{"fullname":"铁西区","id":"210106"},{"fullname":"苏家屯区","id":"210111"},{"fullname":"浑南区","id":"210112"},{"fullname":"沈北新区","id":"210113"},{"fullname":"于洪区","id":"210114"},{"fullname":"辽中区","id":"210115"},{"fullname":"康平县","id":"210123"},{"fullname":"法库县","id":"210124"},{"fullname":"新民市","id":"210181"},{"fullname":"中山区","id":"210202"},{"fullname":"西岗区","id":"210203"},{"fullname":"沙河口区","id":"210204"},{"fullname":"甘井子区","id":"210211"},{"fullname":"旅顺口区","id":"210212"},{"fullname":"金州区","id":"210213"},{"fullname":"普兰店区","id":"210214"},{"fullname":"长海县","id":"210224"},{"fullname":"瓦房店市","id":"210281"},{"fullname":"庄河市","id":"210283"},{"fullname":"铁东区","id":"210302"},{"fullname":"铁西区","id":"210303"},{"fullname":"立山区","id":"210304"},{"fullname":"千山区","id":"210311"},{"fullname":"台安县","id":"210321"},{"fullname":"岫岩满族自治县","id":"210323"},{"fullname":"海城市","id":"210381"},{"fullname":"新抚区","id":"210402"},{"fullname":"东洲区","id":"210403"},{"fullname":"望花区","id":"210404"},{"fullname":"顺城区","id":"210411"},{"fullname":"抚顺县","id":"210421"},{"fullname":"新宾满族自治县","id":"210422"},{"fullname":"清原满族自治县","id":"210423"},{"fullname":"平山区","id":"210502"},{"fullname":"溪湖区","id":"210503"},{"fullname":"明山区","id":"210504"},{"fullname":"南芬区","id":"210505"},{"fullname":"本溪满族自治县","id":"210521"},{"fullname":"桓仁满族自治县","id":"210522"},{"fullname":"元宝区","id":"210602"},{"fullname":"振兴区","id":"210603"},{"fullname":"振安区","id":"210604"},{"fullname":"宽甸满族自治县","id":"210624"},{"fullname":"东港市","id":"210681"},{"fullname":"凤城市","id":"210682"},{"fullname":"古塔区","id":"210702"},{"fullname":"凌河区","id":"210703"},{"fullname":"太和区","id":"210711"},{"fullname":"黑山县","id":"210726"},{"fullname":"义县","id":"210727"},{"fullname":"凌海市","id":"210781"},{"fullname":"北镇市","id":"210782"},{"fullname":"站前区","id":"210802"},{"fullname":"西市区","id":"210803"},{"fullname":"鲅鱼圈区","id":"210804"},{"fullname":"老边区","id":"210811"},{"fullname":"盖州市","id":"210881"},{"fullname":"大石桥市","id":"210882"},{"fullname":"海州区","id":"210902"},{"fullname":"新邱区","id":"210903"},{"fullname":"太平区","id":"210904"},{"fullname":"清河门区","id":"210905"},{"fullname":"细河区","id":"210911"},{"fullname":"阜新蒙古族自治县","id":"210921"},{"fullname":"彰武县","id":"210922"},{"fullname":"白塔区","id":"211002"},{"fullname":"文圣区","id":"211003"},{"fullname":"宏伟区","id":"211004"},{"fullname":"弓长岭区","id":"211005"},{"fullname":"太子河区","id":"211011"},{"fullname":"辽阳县","id":"211021"},{"fullname":"灯塔市","id":"211081"},{"fullname":"双台子区","id":"211102"},{"fullname":"兴隆台区","id":"211103"},{"fullname":"大洼区","id":"211104"},{"fullname":"盘山县","id":"211122"},{"fullname":"银州区","id":"211202"},{"fullname":"清河区","id":"211204"},{"fullname":"铁岭县","id":"211221"},{"fullname":"西丰县","id":"211223"},{"fullname":"昌图县","id":"211224"},{"fullname":"调兵山市","id":"211281"},{"fullname":"开原市","id":"211282"},{"fullname":"双塔区","id":"211302"},{"fullname":"龙城区","id":"211303"},{"fullname":"朝阳县","id":"211321"},{"fullname":"建平县","id":"211322"},{"fullname":"喀喇沁左翼蒙古族自治县","id":"211324"},{"fullname":"北票市","id":"211381"},{"fullname":"凌源市","id":"211382"},{"fullname":"连山区","id":"211402"},{"fullname":"龙港区","id":"211403"},{"fullname":"南票区","id":"211404"},{"fullname":"绥中县","id":"211421"},{"fullname":"建昌县","id":"211422"},{"fullname":"兴城市","id":"211481"},{"fullname":"南关区","id":"220102"},{"fullname":"宽城区","id":"220103"},{"fullname":"朝阳区","id":"220104"},{"fullname":"二道区","id":"220105"},{"fullname":"绿园区","id":"220106"},{"fullname":"双阳区","id":"220112"},{"fullname":"九台区","id":"220113"},{"fullname":"农安县","id":"220122"},{"fullname":"榆树市","id":"220182"},{"fullname":"德惠市","id":"220183"},{"fullname":"昌邑区","id":"220202"},{"fullname":"龙潭区","id":"220203"},{"fullname":"船营区","id":"220204"},{"fullname":"丰满区","id":"220211"},{"fullname":"永吉县","id":"220221"},{"fullname":"蛟河市","id":"220281"},{"fullname":"桦甸市","id":"220282"},{"fullname":"舒兰市","id":"220283"},{"fullname":"磐石市","id":"220284"},{"fullname":"铁西区","id":"220302"},{"fullname":"铁东区","id":"220303"},{"fullname":"梨树县","id":"220322"},{"fullname":"伊通满族自治县","id":"220323"},{"fullname":"公主岭市","id":"220381"},{"fullname":"双辽市","id":"220382"},{"fullname":"龙山区","id":"220402"},{"fullname":"西安区","id":"220403"},{"fullname":"东丰县","id":"220421"},{"fullname":"东辽县","id":"220422"},{"fullname":"东昌区","id":"220502"},{"fullname":"二道江区","id":"220503"},{"fullname":"通化县","id":"220521"},{"fullname":"辉南县","id":"220523"},{"fullname":"柳河县","id":"220524"},{"fullname":"梅河口市","id":"220581"},{"fullname":"集安市","id":"220582"},{"fullname":"浑江区","id":"220602"},{"fullname":"江源区","id":"220605"},{"fullname":"抚松县","id":"220621"},{"fullname":"靖宇县","id":"220622"},{"fullname":"长白朝鲜族自治县","id":"220623"},{"fullname":"临江市","id":"220681"},{"fullname":"宁江区","id":"220702"},{"fullname":"前郭尔罗斯蒙古族自治县","id":"220721"},{"fullname":"长岭县","id":"220722"},{"fullname":"乾安县","id":"220723"},{"fullname":"扶余市","id":"220781"},{"fullname":"洮北区","id":"220802"},{"fullname":"镇赉县","id":"220821"},{"fullname":"通榆县","id":"220822"},{"fullname":"洮南市","id":"220881"},{"fullname":"大安市","id":"220882"},{"fullname":"延吉市","id":"222401"},{"fullname":"图们市","id":"222402"},{"fullname":"敦化市","id":"222403"},{"fullname":"珲春市","id":"222404"},{"fullname":"龙井市","id":"222405"},{"fullname":"和龙市","id":"222406"},{"fullname":"汪清县","id":"222424"},{"fullname":"安图县","id":"222426"},{"fullname":"道里区","id":"230102"},{"fullname":"南岗区","id":"230103"},{"fullname":"道外区","id":"230104"},{"fullname":"平房区","id":"230108"},{"fullname":"松北区","id":"230109"},{"fullname":"香坊区","id":"230110"},{"fullname":"呼兰区","id":"230111"},{"fullname":"阿城区","id":"230112"},{"fullname":"双城区","id":"230113"},{"fullname":"依兰县","id":"230123"},{"fullname":"方正县","id":"230124"},{"fullname":"宾县","id":"230125"},{"fullname":"巴彦县","id":"230126"},{"fullname":"木兰县","id":"230127"},{"fullname":"通河县","id":"230128"},{"fullname":"延寿县","id":"230129"},{"fullname":"尚志市","id":"230183"},{"fullname":"五常市","id":"230184"},{"fullname":"龙沙区","id":"230202"},{"fullname":"建华区","id":"230203"},{"fullname":"铁锋区","id":"230204"},{"fullname":"昂昂溪区","id":"230205"},{"fullname":"富拉尔基区","id":"230206"},{"fullname":"碾子山区","id":"230207"},{"fullname":"梅里斯达斡尔族区","id":"230208"},{"fullname":"龙江县","id":"230221"},{"fullname":"依安县","id":"230223"},{"fullname":"泰来县","id":"230224"},{"fullname":"甘南县","id":"230225"},{"fullname":"富裕县","id":"230227"},{"fullname":"克山县","id":"230229"},{"fullname":"克东县","id":"230230"},{"fullname":"拜泉县","id":"230231"},{"fullname":"讷河市","id":"230281"},{"fullname":"鸡冠区","id":"230302"},{"fullname":"恒山区","id":"230303"},{"fullname":"滴道区","id":"230304"},{"fullname":"梨树区","id":"230305"},{"fullname":"城子河区","id":"230306"},{"fullname":"麻山区","id":"230307"},{"fullname":"鸡东县","id":"230321"},{"fullname":"虎林市","id":"230381"},{"fullname":"密山市","id":"230382"},{"fullname":"向阳区","id":"230402"},{"fullname":"工农区","id":"230403"},{"fullname":"南山区","id":"230404"},{"fullname":"兴安区","id":"230405"},{"fullname":"东山区","id":"230406"},{"fullname":"兴山区","id":"230407"},{"fullname":"萝北县","id":"230421"},{"fullname":"绥滨县","id":"230422"},{"fullname":"尖山区","id":"230502"},{"fullname":"岭东区","id":"230503"},{"fullname":"四方台区","id":"230505"},{"fullname":"宝山区","id":"230506"},{"fullname":"集贤县","id":"230521"},{"fullname":"友谊县","id":"230522"},{"fullname":"宝清县","id":"230523"},{"fullname":"饶河县","id":"230524"},{"fullname":"萨尔图区","id":"230602"},{"fullname":"龙凤区","id":"230603"},{"fullname":"让胡路区","id":"230604"},{"fullname":"红岗区","id":"230605"},{"fullname":"大同区","id":"230606"},{"fullname":"肇州县","id":"230621"},{"fullname":"肇源县","id":"230622"},{"fullname":"林甸县","id":"230623"},{"fullname":"杜尔伯特蒙古族自治县","id":"230624"},{"fullname":"伊春区","id":"230702"},{"fullname":"南岔区","id":"230703"},{"fullname":"友好区","id":"230704"},{"fullname":"西林区","id":"230705"},{"fullname":"翠峦区","id":"230706"},{"fullname":"新青区","id":"230707"},{"fullname":"美溪区","id":"230708"},{"fullname":"金山屯区","id":"230709"},{"fullname":"五营区","id":"230710"},{"fullname":"乌马河区","id":"230711"},{"fullname":"汤旺河区","id":"230712"},{"fullname":"带岭区","id":"230713"},{"fullname":"乌伊岭区","id":"230714"},{"fullname":"红星区","id":"230715"},{"fullname":"上甘岭区","id":"230716"},{"fullname":"嘉荫县","id":"230722"},{"fullname":"铁力市","id":"230781"},{"fullname":"向阳区","id":"230803"},{"fullname":"前进区","id":"230804"},{"fullname":"东风区","id":"230805"},{"fullname":"郊区","id":"230811"},{"fullname":"桦南县","id":"230822"},{"fullname":"桦川县","id":"230826"},{"fullname":"汤原县","id":"230828"},{"fullname":"抚远市","id":"230833"},{"fullname":"同江市","id":"230881"},{"fullname":"富锦市","id":"230882"},{"fullname":"新兴区","id":"230902"},{"fullname":"桃山区","id":"230903"},{"fullname":"茄子河区","id":"230904"},{"fullname":"勃利县","id":"230921"},{"fullname":"东安区","id":"231002"},{"fullname":"阳明区","id":"231003"},{"fullname":"爱民区","id":"231004"},{"fullname":"西安区","id":"231005"},{"fullname":"林口县","id":"231025"},{"fullname":"绥芬河市","id":"231081"},{"fullname":"海林市","id":"231083"},{"fullname":"宁安市","id":"231084"},{"fullname":"穆棱市","id":"231085"},{"fullname":"东宁市","id":"231086"},{"fullname":"爱辉区","id":"231102"},{"fullname":"嫩江县","id":"231121"},{"fullname":"逊克县","id":"231123"},{"fullname":"孙吴县","id":"231124"},{"fullname":"北安市","id":"231181"},{"fullname":"五大连池市","id":"231182"},{"fullname":"北林区","id":"231202"},{"fullname":"望奎县","id":"231221"},{"fullname":"兰西县","id":"231222"},{"fullname":"青冈县","id":"231223"},{"fullname":"庆安县","id":"231224"},{"fullname":"明水县","id":"231225"},{"fullname":"绥棱县","id":"231226"},{"fullname":"安达市","id":"231281"},{"fullname":"肇东市","id":"231282"},{"fullname":"海伦市","id":"231283"},{"fullname":"呼玛县","id":"232721"},{"fullname":"塔河县","id":"232722"},{"fullname":"漠河县","id":"232723"},{"fullname":"玄武区","id":"320102"},{"fullname":"秦淮区","id":"320104"},{"fullname":"建邺区","id":"320105"},{"fullname":"鼓楼区","id":"320106"},{"fullname":"浦口区","id":"320111"},{"fullname":"栖霞区","id":"320113"},{"fullname":"雨花台区","id":"320114"},{"fullname":"江宁区","id":"320115"},{"fullname":"六合区","id":"320116"},{"fullname":"溧水区","id":"320117"},{"fullname":"高淳区","id":"320118"},{"fullname":"锡山区","id":"320205"},{"fullname":"惠山区","id":"320206"},{"fullname":"滨湖区","id":"320211"},{"fullname":"梁溪区","id":"320213"},{"fullname":"新吴区","id":"320214"},{"fullname":"江阴市","id":"320281"},{"fullname":"宜兴市","id":"320282"},{"fullname":"鼓楼区","id":"320302"},{"fullname":"云龙区","id":"320303"},{"fullname":"贾汪区","id":"320305"},{"fullname":"泉山区","id":"320311"},{"fullname":"铜山区","id":"320312"},{"fullname":"丰县","id":"320321"},{"fullname":"沛县","id":"320322"},{"fullname":"睢宁县","id":"320324"},{"fullname":"新沂市","id":"320381"},{"fullname":"邳州市","id":"320382"},{"fullname":"天宁区","id":"320402"},{"fullname":"钟楼区","id":"320404"},{"fullname":"新北区","id":"320411"},{"fullname":"武进区","id":"320412"},{"fullname":"金坛区","id":"320413"},{"fullname":"溧阳市","id":"320481"},{"fullname":"虎丘区","id":"320505"},{"fullname":"吴中区","id":"320506"},{"fullname":"相城区","id":"320507"},{"fullname":"姑苏区","id":"320508"},{"fullname":"吴江区","id":"320509"},{"fullname":"常熟市","id":"320581"},{"fullname":"张家港市","id":"320582"},{"fullname":"昆山市","id":"320583"},{"fullname":"太仓市","id":"320585"},{"fullname":"崇川区","id":"320602"},{"fullname":"港闸区","id":"320611"},{"fullname":"通州区","id":"320612"},{"fullname":"海安县","id":"320621"},{"fullname":"如东县","id":"320623"},{"fullname":"启东市","id":"320681"},{"fullname":"如皋市","id":"320682"},{"fullname":"海门市","id":"320684"},{"fullname":"连云区","id":"320703"},{"fullname":"海州区","id":"320706"},{"fullname":"赣榆区","id":"320707"},{"fullname":"东海县","id":"320722"},{"fullname":"灌云县","id":"320723"},{"fullname":"灌南县","id":"320724"},{"fullname":"淮安区","id":"320803"},{"fullname":"淮阴区","id":"320804"},{"fullname":"清江浦区","id":"320812"},{"fullname":"洪泽区","id":"320813"},{"fullname":"涟水县","id":"320826"},{"fullname":"盱眙县","id":"320830"},{"fullname":"金湖县","id":"320831"},{"fullname":"亭湖区","id":"320902"},{"fullname":"盐都区","id":"320903"},{"fullname":"大丰区","id":"320904"},{"fullname":"响水县","id":"320921"},{"fullname":"滨海县","id":"320922"},{"fullname":"阜宁县","id":"320923"},{"fullname":"射阳县","id":"320924"},{"fullname":"建湖县","id":"320925"},{"fullname":"东台市","id":"320981"},{"fullname":"广陵区","id":"321002"},{"fullname":"邗江区","id":"321003"},{"fullname":"江都区","id":"321012"},{"fullname":"宝应县","id":"321023"},{"fullname":"仪征市","id":"321081"},{"fullname":"高邮市","id":"321084"},{"fullname":"京口区","id":"321102"},{"fullname":"润州区","id":"321111"},{"fullname":"丹徒区","id":"321112"},{"fullname":"丹阳市","id":"321181"},{"fullname":"扬中市","id":"321182"},{"fullname":"句容市","id":"321183"},{"fullname":"海陵区","id":"321202"},{"fullname":"高港区","id":"321203"},{"fullname":"姜堰区","id":"321204"},{"fullname":"兴化市","id":"321281"},{"fullname":"靖江市","id":"321282"},{"fullname":"泰兴市","id":"321283"},{"fullname":"宿城区","id":"321302"},{"fullname":"宿豫区","id":"321311"},{"fullname":"沭阳县","id":"321322"},{"fullname":"泗阳县","id":"321323"},{"fullname":"泗洪县","id":"321324"},{"fullname":"上城区","id":"330102"},{"fullname":"下城区","id":"330103"},{"fullname":"江干区","id":"330104"},{"fullname":"拱墅区","id":"330105"},{"fullname":"西湖区","id":"330106"},{"fullname":"滨江区","id":"330108"},{"fullname":"萧山区","id":"330109"},{"fullname":"余杭区","id":"330110"},{"fullname":"富阳区","id":"330111"},{"fullname":"桐庐县","id":"330122"},{"fullname":"淳安县","id":"330127"},{"fullname":"建德市","id":"330182"},{"fullname":"临安市","id":"330185"},{"fullname":"海曙区","id":"330203"},{"fullname":"江东区","id":"330204"},{"fullname":"江北区","id":"330205"},{"fullname":"北仑区","id":"330206"},{"fullname":"镇海区","id":"330211"},{"fullname":"鄞州区","id":"330212"},{"fullname":"象山县","id":"330225"},{"fullname":"宁海县","id":"330226"},{"fullname":"余姚市","id":"330281"},{"fullname":"慈溪市","id":"330282"},{"fullname":"奉化市","id":"330283"},{"fullname":"鹿城区","id":"330302"},{"fullname":"龙湾区","id":"330303"},{"fullname":"瓯海区","id":"330304"},{"fullname":"洞头区","id":"330305"},{"fullname":"永嘉县","id":"330324"},{"fullname":"平阳县","id":"330326"},{"fullname":"苍南县","id":"330327"},{"fullname":"文成县","id":"330328"},{"fullname":"泰顺县","id":"330329"},{"fullname":"瑞安市","id":"330381"},{"fullname":"乐清市","id":"330382"},{"fullname":"南湖区","id":"330402"},{"fullname":"秀洲区","id":"330411"},{"fullname":"嘉善县","id":"330421"},{"fullname":"海盐县","id":"330424"},{"fullname":"海宁市","id":"330481"},{"fullname":"平湖市","id":"330482"},{"fullname":"桐乡市","id":"330483"},{"fullname":"吴兴区","id":"330502"},{"fullname":"南浔区","id":"330503"},{"fullname":"德清县","id":"330521"},{"fullname":"长兴县","id":"330522"},{"fullname":"安吉县","id":"330523"},{"fullname":"越城区","id":"330602"},{"fullname":"柯桥区","id":"330603"},{"fullname":"上虞区","id":"330604"},{"fullname":"新昌县","id":"330624"},{"fullname":"诸暨市","id":"330681"},{"fullname":"嵊州市","id":"330683"},{"fullname":"婺城区","id":"330702"},{"fullname":"金东区","id":"330703"},{"fullname":"武义县","id":"330723"},{"fullname":"浦江县","id":"330726"},{"fullname":"磐安县","id":"330727"},{"fullname":"兰溪市","id":"330781"},{"fullname":"义乌市","id":"330782"},{"fullname":"东阳市","id":"330783"},{"fullname":"永康市","id":"330784"},{"fullname":"柯城区","id":"330802"},{"fullname":"衢江区","id":"330803"},{"fullname":"常山县","id":"330822"},{"fullname":"开化县","id":"330824"},{"fullname":"龙游县","id":"330825"},{"fullname":"江山市","id":"330881"},{"fullname":"定海区","id":"330902"},{"fullname":"普陀区","id":"330903"},{"fullname":"岱山县","id":"330921"},{"fullname":"嵊泗县","id":"330922"},{"fullname":"椒江区","id":"331002"},{"fullname":"黄岩区","id":"331003"},{"fullname":"路桥区","id":"331004"},{"fullname":"玉环县","id":"331021"},{"fullname":"三门县","id":"331022"},{"fullname":"天台县","id":"331023"},{"fullname":"仙居县","id":"331024"},{"fullname":"温岭市","id":"331081"},{"fullname":"临海市","id":"331082"},{"fullname":"莲都区","id":"331102"},{"fullname":"青田县","id":"331121"},{"fullname":"缙云县","id":"331122"},{"fullname":"遂昌县","id":"331123"},{"fullname":"松阳县","id":"331124"},{"fullname":"云和县","id":"331125"},{"fullname":"庆元县","id":"331126"},{"fullname":"景宁畲族自治县","id":"331127"},{"fullname":"龙泉市","id":"331181"},{"fullname":"瑶海区","id":"340102"},{"fullname":"庐阳区","id":"340103"},{"fullname":"蜀山区","id":"340104"},{"fullname":"包河区","id":"340111"},{"fullname":"长丰县","id":"340121"},{"fullname":"肥东县","id":"340122"},{"fullname":"肥西县","id":"340123"},{"fullname":"庐江县","id":"340124"},{"fullname":"巢湖市","id":"340181"},{"fullname":"镜湖区","id":"340202"},{"fullname":"弋江区","id":"340203"},{"fullname":"鸠江区","id":"340207"},{"fullname":"三山区","id":"340208"},{"fullname":"芜湖县","id":"340221"},{"fullname":"繁昌县","id":"340222"},{"fullname":"南陵县","id":"340223"},{"fullname":"无为县","id":"340225"},{"fullname":"龙子湖区","id":"340302"},{"fullname":"蚌山区","id":"340303"},{"fullname":"禹会区","id":"340304"},{"fullname":"淮上区","id":"340311"},{"fullname":"怀远县","id":"340321"},{"fullname":"五河县","id":"340322"},{"fullname":"固镇县","id":"340323"},{"fullname":"大通区","id":"340402"},{"fullname":"田家庵区","id":"340403"},{"fullname":"谢家集区","id":"340404"},{"fullname":"八公山区","id":"340405"},{"fullname":"潘集区","id":"340406"},{"fullname":"凤台县","id":"340421"},{"fullname":"寿县","id":"340422"},{"fullname":"花山区","id":"340503"},{"fullname":"雨山区","id":"340504"},{"fullname":"博望区","id":"340506"},{"fullname":"当涂县","id":"340521"},{"fullname":"含山县","id":"340522"},{"fullname":"和县","id":"340523"},{"fullname":"杜集区","id":"340602"},{"fullname":"相山区","id":"340603"},{"fullname":"烈山区","id":"340604"},{"fullname":"濉溪县","id":"340621"},{"fullname":"铜官区","id":"340705"},{"fullname":"义安区","id":"340706"},{"fullname":"郊区","id":"340711"},{"fullname":"枞阳县","id":"340722"},{"fullname":"迎江区","id":"340802"},{"fullname":"大观区","id":"340803"},{"fullname":"宜秀区","id":"340811"},{"fullname":"怀宁县","id":"340822"},{"fullname":"潜山县","id":"340824"},{"fullname":"太湖县","id":"340825"},{"fullname":"宿松县","id":"340826"},{"fullname":"望江县","id":"340827"},{"fullname":"岳西县","id":"340828"},{"fullname":"桐城市","id":"340881"},{"fullname":"屯溪区","id":"341002"},{"fullname":"黄山区","id":"341003"},{"fullname":"徽州区","id":"341004"},{"fullname":"歙县","id":"341021"},{"fullname":"休宁县","id":"341022"},{"fullname":"黟县","id":"341023"},{"fullname":"祁门县","id":"341024"},{"fullname":"琅琊区","id":"341102"},{"fullname":"南谯区","id":"341103"},{"fullname":"来安县","id":"341122"},{"fullname":"全椒县","id":"341124"},{"fullname":"定远县","id":"341125"},{"fullname":"凤阳县","id":"341126"},{"fullname":"天长市","id":"341181"},{"fullname":"明光市","id":"341182"},{"fullname":"颍州区","id":"341202"},{"fullname":"颍东区","id":"341203"},{"fullname":"颍泉区","id":"341204"},{"fullname":"临泉县","id":"341221"},{"fullname":"太和县","id":"341222"},{"fullname":"阜南县","id":"341225"},{"fullname":"颍上县","id":"341226"},{"fullname":"界首市","id":"341282"},{"fullname":"埇桥区","id":"341302"},{"fullname":"砀山县","id":"341321"},{"fullname":"萧县","id":"341322"},{"fullname":"灵璧县","id":"341323"},{"fullname":"泗县","id":"341324"},{"fullname":"金安区","id":"341502"},{"fullname":"裕安区","id":"341503"},{"fullname":"叶集区","id":"341504"},{"fullname":"霍邱县","id":"341522"},{"fullname":"舒城县","id":"341523"},{"fullname":"金寨县","id":"341524"},{"fullname":"霍山县","id":"341525"},{"fullname":"谯城区","id":"341602"},{"fullname":"涡阳县","id":"341621"},{"fullname":"蒙城县","id":"341622"},{"fullname":"利辛县","id":"341623"},{"fullname":"贵池区","id":"341702"},{"fullname":"东至县","id":"341721"},{"fullname":"石台县","id":"341722"},{"fullname":"青阳县","id":"341723"},{"fullname":"宣州区","id":"341802"},{"fullname":"郎溪县","id":"341821"},{"fullname":"广德县","id":"341822"},{"fullname":"泾县","id":"341823"},{"fullname":"绩溪县","id":"341824"},{"fullname":"旌德县","id":"341825"},{"fullname":"宁国市","id":"341881"},{"fullname":"鼓楼区","id":"350102"},{"fullname":"台江区","id":"350103"},{"fullname":"仓山区","id":"350104"},{"fullname":"马尾区","id":"350105"},{"fullname":"晋安区","id":"350111"},{"fullname":"闽侯县","id":"350121"},{"fullname":"连江县","id":"350122"},{"fullname":"罗源县","id":"350123"},{"fullname":"闽清县","id":"350124"},{"fullname":"永泰县","id":"350125"},{"fullname":"平潭县","id":"350128"},{"fullname":"福清市","id":"350181"},{"fullname":"长乐市","id":"350182"},{"fullname":"思明区","id":"350203"},{"fullname":"海沧区","id":"350205"},{"fullname":"湖里区","id":"350206"},{"fullname":"集美区","id":"350211"},{"fullname":"同安区","id":"350212"},{"fullname":"翔安区","id":"350213"},{"fullname":"城厢区","id":"350302"},{"fullname":"涵江区","id":"350303"},{"fullname":"荔城区","id":"350304"},{"fullname":"秀屿区","id":"350305"},{"fullname":"仙游县","id":"350322"},{"fullname":"梅列区","id":"350402"},{"fullname":"三元区","id":"350403"},{"fullname":"明溪县","id":"350421"},{"fullname":"清流县","id":"350423"},{"fullname":"宁化县","id":"350424"},{"fullname":"大田县","id":"350425"},{"fullname":"尤溪县","id":"350426"},{"fullname":"沙县","id":"350427"},{"fullname":"将乐县","id":"350428"},{"fullname":"泰宁县","id":"350429"},{"fullname":"建宁县","id":"350430"},{"fullname":"永安市","id":"350481"},{"fullname":"鲤城区","id":"350502"},{"fullname":"丰泽区","id":"350503"},{"fullname":"洛江区","id":"350504"},{"fullname":"泉港区","id":"350505"},{"fullname":"惠安县","id":"350521"},{"fullname":"安溪县","id":"350524"},{"fullname":"永春县","id":"350525"},{"fullname":"德化县","id":"350526"},{"fullname":"金门县","id":"350527"},{"fullname":"石狮市","id":"350581"},{"fullname":"晋江市","id":"350582"},{"fullname":"南安市","id":"350583"},{"fullname":"芗城区","id":"350602"},{"fullname":"龙文区","id":"350603"},{"fullname":"云霄县","id":"350622"},{"fullname":"漳浦县","id":"350623"},{"fullname":"诏安县","id":"350624"},{"fullname":"长泰县","id":"350625"},{"fullname":"东山县","id":"350626"},{"fullname":"南靖县","id":"350627"},{"fullname":"平和县","id":"350628"},{"fullname":"华安县","id":"350629"},{"fullname":"龙海市","id":"350681"},{"fullname":"延平区","id":"350702"},{"fullname":"建阳区","id":"350703"},{"fullname":"顺昌县","id":"350721"},{"fullname":"浦城县","id":"350722"},{"fullname":"光泽县","id":"350723"},{"fullname":"松溪县","id":"350724"},{"fullname":"政和县","id":"350725"},{"fullname":"邵武市","id":"350781"},{"fullname":"武夷山市","id":"350782"},{"fullname":"建瓯市","id":"350783"},{"fullname":"新罗区","id":"350802"},{"fullname":"永定区","id":"350803"},{"fullname":"长汀县","id":"350821"},{"fullname":"上杭县","id":"350823"},{"fullname":"武平县","id":"350824"},{"fullname":"连城县","id":"350825"},{"fullname":"漳平市","id":"350881"},{"fullname":"蕉城区","id":"350902"},{"fullname":"霞浦县","id":"350921"},{"fullname":"古田县","id":"350922"},{"fullname":"屏南县","id":"350923"},{"fullname":"寿宁县","id":"350924"},{"fullname":"周宁县","id":"350925"},{"fullname":"柘荣县","id":"350926"},{"fullname":"福安市","id":"350981"},{"fullname":"福鼎市","id":"350982"},{"fullname":"东湖区","id":"360102"},{"fullname":"西湖区","id":"360103"},{"fullname":"青云谱区","id":"360104"},{"fullname":"湾里区","id":"360105"},{"fullname":"青山湖区","id":"360111"},{"fullname":"新建区","id":"360112"},{"fullname":"南昌县","id":"360121"},{"fullname":"安义县","id":"360123"},{"fullname":"进贤县","id":"360124"},{"fullname":"昌江区","id":"360202"},{"fullname":"珠山区","id":"360203"},{"fullname":"浮梁县","id":"360222"},{"fullname":"乐平市","id":"360281"},{"fullname":"安源区","id":"360302"},{"fullname":"湘东区","id":"360313"},{"fullname":"莲花县","id":"360321"},{"fullname":"上栗县","id":"360322"},{"fullname":"芦溪县","id":"360323"},{"fullname":"濂溪区","id":"360402"},{"fullname":"浔阳区","id":"360403"},{"fullname":"九江县","id":"360421"},{"fullname":"武宁县","id":"360423"},{"fullname":"修水县","id":"360424"},{"fullname":"永修县","id":"360425"},{"fullname":"德安县","id":"360426"},{"fullname":"都昌县","id":"360428"},{"fullname":"湖口县","id":"360429"},{"fullname":"彭泽县","id":"360430"},{"fullname":"瑞昌市","id":"360481"},{"fullname":"共青城市","id":"360482"},{"fullname":"庐山市","id":"360483"},{"fullname":"渝水区","id":"360502"},{"fullname":"分宜县","id":"360521"},{"fullname":"月湖区","id":"360602"},{"fullname":"余江县","id":"360622"},{"fullname":"贵溪市","id":"360681"},{"fullname":"章贡区","id":"360702"},{"fullname":"南康区","id":"360703"},{"fullname":"赣县","id":"360721"},{"fullname":"信丰县","id":"360722"},{"fullname":"大余县","id":"360723"},{"fullname":"上犹县","id":"360724"},{"fullname":"崇义县","id":"360725"},{"fullname":"安远县","id":"360726"},{"fullname":"龙南县","id":"360727"},{"fullname":"定南县","id":"360728"},{"fullname":"全南县","id":"360729"},{"fullname":"宁都县","id":"360730"},{"fullname":"于都县","id":"360731"},{"fullname":"兴国县","id":"360732"},{"fullname":"会昌县","id":"360733"},{"fullname":"寻乌县","id":"360734"},{"fullname":"石城县","id":"360735"},{"fullname":"瑞金市","id":"360781"},{"fullname":"吉州区","id":"360802"},{"fullname":"青原区","id":"360803"},{"fullname":"吉安县","id":"360821"},{"fullname":"吉水县","id":"360822"},{"fullname":"峡江县","id":"360823"},{"fullname":"新干县","id":"360824"},{"fullname":"永丰县","id":"360825"},{"fullname":"泰和县","id":"360826"},{"fullname":"遂川县","id":"360827"},{"fullname":"万安县","id":"360828"},{"fullname":"安福县","id":"360829"},{"fullname":"永新县","id":"360830"},{"fullname":"井冈山市","id":"360881"},{"fullname":"袁州区","id":"360902"},{"fullname":"奉新县","id":"360921"},{"fullname":"万载县","id":"360922"},{"fullname":"上高县","id":"360923"},{"fullname":"宜丰县","id":"360924"},{"fullname":"靖安县","id":"360925"},{"fullname":"铜鼓县","id":"360926"},{"fullname":"丰城市","id":"360981"},{"fullname":"樟树市","id":"360982"},{"fullname":"高安市","id":"360983"},{"fullname":"临川区","id":"361002"},{"fullname":"南城县","id":"361021"},{"fullname":"黎川县","id":"361022"},{"fullname":"南丰县","id":"361023"},{"fullname":"崇仁县","id":"361024"},{"fullname":"乐安县","id":"361025"},{"fullname":"宜黄县","id":"361026"},{"fullname":"金溪县","id":"361027"},{"fullname":"资溪县","id":"361028"},{"fullname":"东乡县","id":"361029"},{"fullname":"广昌县","id":"361030"},{"fullname":"信州区","id":"361102"},{"fullname":"广丰区","id":"361103"},{"fullname":"上饶县","id":"361121"},{"fullname":"玉山县","id":"361123"},{"fullname":"铅山县","id":"361124"},{"fullname":"横峰县","id":"361125"},{"fullname":"弋阳县","id":"361126"},{"fullname":"余干县","id":"361127"},{"fullname":"鄱阳县","id":"361128"},{"fullname":"万年县","id":"361129"},{"fullname":"婺源县","id":"361130"},{"fullname":"德兴市","id":"361181"},{"fullname":"历下区","id":"370102"},{"fullname":"市中区","id":"370103"},{"fullname":"槐荫区","id":"370104"},{"fullname":"天桥区","id":"370105"},{"fullname":"历城区","id":"370112"},{"fullname":"长清区","id":"370113"},{"fullname":"平阴县","id":"370124"},{"fullname":"济阳县","id":"370125"},{"fullname":"商河县","id":"370126"},{"fullname":"章丘市","id":"370181"},{"fullname":"市南区","id":"370202"},{"fullname":"市北区","id":"370203"},{"fullname":"黄岛区","id":"370211"},{"fullname":"崂山区","id":"370212"},{"fullname":"李沧区","id":"370213"},{"fullname":"城阳区","id":"370214"},{"fullname":"胶州市","id":"370281"},{"fullname":"即墨市","id":"370282"},{"fullname":"平度市","id":"370283"},{"fullname":"莱西市","id":"370285"},{"fullname":"淄川区","id":"370302"},{"fullname":"张店区","id":"370303"},{"fullname":"博山区","id":"370304"},{"fullname":"临淄区","id":"370305"},{"fullname":"周村区","id":"370306"},{"fullname":"桓台县","id":"370321"},{"fullname":"高青县","id":"370322"},{"fullname":"沂源县","id":"370323"},{"fullname":"市中区","id":"370402"},{"fullname":"薛城区","id":"370403"},{"fullname":"峄城区","id":"370404"},{"fullname":"台儿庄区","id":"370405"},{"fullname":"山亭区","id":"370406"},{"fullname":"滕州市","id":"370481"},{"fullname":"东营区","id":"370502"},{"fullname":"河口区","id":"370503"},{"fullname":"垦利区","id":"370505"},{"fullname":"利津县","id":"370522"},{"fullname":"广饶县","id":"370523"},{"fullname":"芝罘区","id":"370602"},{"fullname":"福山区","id":"370611"},{"fullname":"牟平区","id":"370612"},{"fullname":"莱山区","id":"370613"},{"fullname":"长岛县","id":"370634"},{"fullname":"龙口市","id":"370681"},{"fullname":"莱阳市","id":"370682"},{"fullname":"莱州市","id":"370683"},{"fullname":"蓬莱市","id":"370684"},{"fullname":"招远市","id":"370685"},{"fullname":"栖霞市","id":"370686"},{"fullname":"海阳市","id":"370687"},{"fullname":"潍城区","id":"370702"},{"fullname":"寒亭区","id":"370703"},{"fullname":"坊子区","id":"370704"},{"fullname":"奎文区","id":"370705"},{"fullname":"临朐县","id":"370724"},{"fullname":"昌乐县","id":"370725"},{"fullname":"青州市","id":"370781"},{"fullname":"诸城市","id":"370782"},{"fullname":"寿光市","id":"370783"},{"fullname":"安丘市","id":"370784"},{"fullname":"高密市","id":"370785"},{"fullname":"昌邑市","id":"370786"},{"fullname":"任城区","id":"370811"},{"fullname":"兖州区","id":"370812"},{"fullname":"微山县","id":"370826"},{"fullname":"鱼台县","id":"370827"},{"fullname":"金乡县","id":"370828"},{"fullname":"嘉祥县","id":"370829"},{"fullname":"汶上县","id":"370830"},{"fullname":"泗水县","id":"370831"},{"fullname":"梁山县","id":"370832"},{"fullname":"曲阜市","id":"370881"},{"fullname":"邹城市","id":"370883"},{"fullname":"泰山区","id":"370902"},{"fullname":"岱岳区","id":"370911"},{"fullname":"宁阳县","id":"370921"},{"fullname":"东平县","id":"370923"},{"fullname":"新泰市","id":"370982"},{"fullname":"肥城市","id":"370983"},{"fullname":"环翠区","id":"371002"},{"fullname":"文登区","id":"371003"},{"fullname":"荣成市","id":"371082"},{"fullname":"乳山市","id":"371083"},{"fullname":"东港区","id":"371102"},{"fullname":"岚山区","id":"371103"},{"fullname":"五莲县","id":"371121"},{"fullname":"莒县","id":"371122"},{"fullname":"莱城区","id":"371202"},{"fullname":"钢城区","id":"371203"},{"fullname":"兰山区","id":"371302"},{"fullname":"罗庄区","id":"371311"},{"fullname":"河东区","id":"371312"},{"fullname":"沂南县","id":"371321"},{"fullname":"郯城县","id":"371322"},{"fullname":"沂水县","id":"371323"},{"fullname":"兰陵县","id":"371324"},{"fullname":"费县","id":"371325"},{"fullname":"平邑县","id":"371326"},{"fullname":"莒南县","id":"371327"},{"fullname":"蒙阴县","id":"371328"},{"fullname":"临沭县","id":"371329"},{"fullname":"德城区","id":"371402"},{"fullname":"陵城区","id":"371403"},{"fullname":"宁津县","id":"371422"},{"fullname":"庆云县","id":"371423"},{"fullname":"临邑县","id":"371424"},{"fullname":"齐河县","id":"371425"},{"fullname":"平原县","id":"371426"},{"fullname":"夏津县","id":"371427"},{"fullname":"武城县","id":"371428"},{"fullname":"乐陵市","id":"371481"},{"fullname":"禹城市","id":"371482"},{"fullname":"东昌府区","id":"371502"},{"fullname":"阳谷县","id":"371521"},{"fullname":"莘县","id":"371522"},{"fullname":"茌平县","id":"371523"},{"fullname":"东阿县","id":"371524"},{"fullname":"冠县","id":"371525"},{"fullname":"高唐县","id":"371526"},{"fullname":"临清市","id":"371581"},{"fullname":"滨城区","id":"371602"},{"fullname":"沾化区","id":"371603"},{"fullname":"惠民县","id":"371621"},{"fullname":"阳信县","id":"371622"},{"fullname":"无棣县","id":"371623"},{"fullname":"博兴县","id":"371625"},{"fullname":"邹平县","id":"371626"},{"fullname":"牡丹区","id":"371702"},{"fullname":"定陶区","id":"371703"},{"fullname":"曹县","id":"371721"},{"fullname":"单县","id":"371722"},{"fullname":"成武县","id":"371723"},{"fullname":"巨野县","id":"371724"},{"fullname":"郓城县","id":"371725"},{"fullname":"鄄城县","id":"371726"},{"fullname":"东明县","id":"371728"},{"fullname":"中原区","id":"410102"},{"fullname":"二七区","id":"410103"},{"fullname":"管城回族区","id":"410104"},{"fullname":"金水区","id":"410105"},{"fullname":"上街区","id":"410106"},{"fullname":"惠济区","id":"410108"},{"fullname":"中牟县","id":"410122"},{"fullname":"巩义市","id":"410181"},{"fullname":"荥阳市","id":"410182"},{"fullname":"新密市","id":"410183"},{"fullname":"新郑市","id":"410184"},{"fullname":"登封市","id":"410185"},{"fullname":"龙亭区","id":"410202"},{"fullname":"顺河回族区","id":"410203"},{"fullname":"鼓楼区","id":"410204"},{"fullname":"禹王台区","id":"410205"},{"fullname":"祥符区","id":"410212"},{"fullname":"杞县","id":"410221"},{"fullname":"通许县","id":"410222"},{"fullname":"尉氏县","id":"410223"},{"fullname":"兰考县","id":"410225"},{"fullname":"老城区","id":"410302"},{"fullname":"西工区","id":"410303"},{"fullname":"瀍河回族区","id":"410304"},{"fullname":"涧西区","id":"410305"},{"fullname":"吉利区","id":"410306"},{"fullname":"洛龙区","id":"410311"},{"fullname":"孟津县","id":"410322"},{"fullname":"新安县","id":"410323"},{"fullname":"栾川县","id":"410324"},{"fullname":"嵩县","id":"410325"},{"fullname":"汝阳县","id":"410326"},{"fullname":"宜阳县","id":"410327"},{"fullname":"洛宁县","id":"410328"},{"fullname":"伊川县","id":"410329"},{"fullname":"偃师市","id":"410381"},{"fullname":"新华区","id":"410402"},{"fullname":"卫东区","id":"410403"},{"fullname":"石龙区","id":"410404"},{"fullname":"湛河区","id":"410411"},{"fullname":"宝丰县","id":"410421"},{"fullname":"叶县","id":"410422"},{"fullname":"鲁山县","id":"410423"},{"fullname":"郏县","id":"410425"},{"fullname":"舞钢市","id":"410481"},{"fullname":"汝州市","id":"410482"},{"fullname":"文峰区","id":"410502"},{"fullname":"北关区","id":"410503"},{"fullname":"殷都区","id":"410505"},{"fullname":"龙安区","id":"410506"},{"fullname":"安阳县","id":"410522"},{"fullname":"汤阴县","id":"410523"},{"fullname":"滑县","id":"410526"},{"fullname":"内黄县","id":"410527"},{"fullname":"林州市","id":"410581"},{"fullname":"鹤山区","id":"410602"},{"fullname":"山城区","id":"410603"},{"fullname":"淇滨区","id":"410611"},{"fullname":"浚县","id":"410621"},{"fullname":"淇县","id":"410622"},{"fullname":"红旗区","id":"410702"},{"fullname":"卫滨区","id":"410703"},{"fullname":"凤泉区","id":"410704"},{"fullname":"牧野区","id":"410711"},{"fullname":"新乡县","id":"410721"},{"fullname":"获嘉县","id":"410724"},{"fullname":"原阳县","id":"410725"},{"fullname":"延津县","id":"410726"},{"fullname":"封丘县","id":"410727"},{"fullname":"长垣县","id":"410728"},{"fullname":"卫辉市","id":"410781"},{"fullname":"辉县市","id":"410782"},{"fullname":"解放区","id":"410802"},{"fullname":"中站区","id":"410803"},{"fullname":"马村区","id":"410804"},{"fullname":"山阳区","id":"410811"},{"fullname":"修武县","id":"410821"},{"fullname":"博爱县","id":"410822"},{"fullname":"武陟县","id":"410823"},{"fullname":"温县","id":"410825"},{"fullname":"沁阳市","id":"410882"},{"fullname":"孟州市","id":"410883"},{"fullname":"华龙区","id":"410902"},{"fullname":"清丰县","id":"410922"},{"fullname":"南乐县","id":"410923"},{"fullname":"范县","id":"410926"},{"fullname":"台前县","id":"410927"},{"fullname":"濮阳县","id":"410928"},{"fullname":"魏都区","id":"411002"},{"fullname":"许昌县","id":"411023"},{"fullname":"鄢陵县","id":"411024"},{"fullname":"襄城县","id":"411025"},{"fullname":"禹州市","id":"411081"},{"fullname":"长葛市","id":"411082"},{"fullname":"源汇区","id":"411102"},{"fullname":"郾城区","id":"411103"},{"fullname":"召陵区","id":"411104"},{"fullname":"舞阳县","id":"411121"},{"fullname":"临颍县","id":"411122"},{"fullname":"湖滨区","id":"411202"},{"fullname":"陕州区","id":"411203"},{"fullname":"渑池县","id":"411221"},{"fullname":"卢氏县","id":"411224"},{"fullname":"义马市","id":"411281"},{"fullname":"灵宝市","id":"411282"},{"fullname":"宛城区","id":"411302"},{"fullname":"卧龙区","id":"411303"},{"fullname":"南召县","id":"411321"},{"fullname":"方城县","id":"411322"},{"fullname":"西峡县","id":"411323"},{"fullname":"镇平县","id":"411324"},{"fullname":"内乡县","id":"411325"},{"fullname":"淅川县","id":"411326"},{"fullname":"社旗县","id":"411327"},{"fullname":"唐河县","id":"411328"},{"fullname":"新野县","id":"411329"},{"fullname":"桐柏县","id":"411330"},{"fullname":"邓州市","id":"411381"},{"fullname":"梁园区","id":"411402"},{"fullname":"睢阳区","id":"411403"},{"fullname":"民权县","id":"411421"},{"fullname":"睢县","id":"411422"},{"fullname":"宁陵县","id":"411423"},{"fullname":"柘城县","id":"411424"},{"fullname":"虞城县","id":"411425"},{"fullname":"夏邑县","id":"411426"},{"fullname":"永城市","id":"411481"},{"fullname":"浉河区","id":"411502"},{"fullname":"平桥区","id":"411503"},{"fullname":"罗山县","id":"411521"},{"fullname":"光山县","id":"411522"},{"fullname":"新县","id":"411523"},{"fullname":"商城县","id":"411524"},{"fullname":"固始县","id":"411525"},{"fullname":"潢川县","id":"411526"},{"fullname":"淮滨县","id":"411527"},{"fullname":"息县","id":"411528"},{"fullname":"川汇区","id":"411602"},{"fullname":"扶沟县","id":"411621"},{"fullname":"西华县","id":"411622"},{"fullname":"商水县","id":"411623"},{"fullname":"沈丘县","id":"411624"},{"fullname":"郸城县","id":"411625"},{"fullname":"淮阳县","id":"411626"},{"fullname":"太康县","id":"411627"},{"fullname":"鹿邑县","id":"411628"},{"fullname":"项城市","id":"411681"},{"fullname":"驿城区","id":"411702"},{"fullname":"西平县","id":"411721"},{"fullname":"上蔡县","id":"411722"},{"fullname":"平舆县","id":"411723"},{"fullname":"正阳县","id":"411724"},{"fullname":"确山县","id":"411725"},{"fullname":"泌阳县","id":"411726"},{"fullname":"汝南县","id":"411727"},{"fullname":"遂平县","id":"411728"},{"fullname":"新蔡县","id":"411729"},{"fullname":"江岸区","id":"420102"},{"fullname":"江汉区","id":"420103"},{"fullname":"硚口区","id":"420104"},{"fullname":"汉阳区","id":"420105"},{"fullname":"武昌区","id":"420106"},{"fullname":"青山区","id":"420107"},{"fullname":"洪山区","id":"420111"},{"fullname":"东西湖区","id":"420112"},{"fullname":"汉南区","id":"420113"},{"fullname":"蔡甸区","id":"420114"},{"fullname":"江夏区","id":"420115"},{"fullname":"黄陂区","id":"420116"},{"fullname":"新洲区","id":"420117"},{"fullname":"黄石港区","id":"420202"},{"fullname":"西塞山区","id":"420203"},{"fullname":"下陆区","id":"420204"},{"fullname":"铁山区","id":"420205"},{"fullname":"阳新县","id":"420222"},{"fullname":"大冶市","id":"420281"},{"fullname":"茅箭区","id":"420302"},{"fullname":"张湾区","id":"420303"},{"fullname":"郧阳区","id":"420304"},{"fullname":"郧西县","id":"420322"},{"fullname":"竹山县","id":"420323"},{"fullname":"竹溪县","id":"420324"},{"fullname":"房县","id":"420325"},{"fullname":"丹江口市","id":"420381"},{"fullname":"西陵区","id":"420502"},{"fullname":"伍家岗区","id":"420503"},{"fullname":"点军区","id":"420504"},{"fullname":"猇亭区","id":"420505"},{"fullname":"夷陵区","id":"420506"},{"fullname":"远安县","id":"420525"},{"fullname":"兴山县","id":"420526"},{"fullname":"秭归县","id":"420527"},{"fullname":"长阳土家族自治县","id":"420528"},{"fullname":"五峰土家族自治县","id":"420529"},{"fullname":"宜都市","id":"420581"},{"fullname":"当阳市","id":"420582"},{"fullname":"枝江市","id":"420583"},{"fullname":"襄城区","id":"420602"},{"fullname":"樊城区","id":"420606"},{"fullname":"襄州区","id":"420607"},{"fullname":"南漳县","id":"420624"},{"fullname":"谷城县","id":"420625"},{"fullname":"保康县","id":"420626"},{"fullname":"老河口市","id":"420682"},{"fullname":"枣阳市","id":"420683"},{"fullname":"宜城市","id":"420684"},{"fullname":"梁子湖区","id":"420702"},{"fullname":"华容区","id":"420703"},{"fullname":"鄂城区","id":"420704"},{"fullname":"东宝区","id":"420802"},{"fullname":"掇刀区","id":"420804"},{"fullname":"京山县","id":"420821"},{"fullname":"沙洋县","id":"420822"},{"fullname":"钟祥市","id":"420881"},{"fullname":"孝南区","id":"420902"},{"fullname":"孝昌县","id":"420921"},{"fullname":"大悟县","id":"420922"},{"fullname":"云梦县","id":"420923"},{"fullname":"应城市","id":"420981"},{"fullname":"安陆市","id":"420982"},{"fullname":"汉川市","id":"420984"},{"fullname":"沙市区","id":"421002"},{"fullname":"荆州区","id":"421003"},{"fullname":"公安县","id":"421022"},{"fullname":"监利县","id":"421023"},{"fullname":"江陵县","id":"421024"},{"fullname":"石首市","id":"421081"},{"fullname":"洪湖市","id":"421083"},{"fullname":"松滋市","id":"421087"},{"fullname":"黄州区","id":"421102"},{"fullname":"团风县","id":"421121"},{"fullname":"红安县","id":"421122"},{"fullname":"罗田县","id":"421123"},{"fullname":"英山县","id":"421124"},{"fullname":"浠水县","id":"421125"},{"fullname":"蕲春县","id":"421126"},{"fullname":"黄梅县","id":"421127"},{"fullname":"麻城市","id":"421181"},{"fullname":"武穴市","id":"421182"},{"fullname":"咸安区","id":"421202"},{"fullname":"嘉鱼县","id":"421221"},{"fullname":"通城县","id":"421222"},{"fullname":"崇阳县","id":"421223"},{"fullname":"通山县","id":"421224"},{"fullname":"赤壁市","id":"421281"},{"fullname":"曾都区","id":"421303"},{"fullname":"随县","id":"421321"},{"fullname":"广水市","id":"421381"},{"fullname":"恩施市","id":"422801"},{"fullname":"利川市","id":"422802"},{"fullname":"建始县","id":"422822"},{"fullname":"巴东县","id":"422823"},{"fullname":"宣恩县","id":"422825"},{"fullname":"咸丰县","id":"422826"},{"fullname":"来凤县","id":"422827"},{"fullname":"鹤峰县","id":"422828"},{"fullname":"芙蓉区","id":"430102"},{"fullname":"天心区","id":"430103"},{"fullname":"岳麓区","id":"430104"},{"fullname":"开福区","id":"430105"},{"fullname":"雨花区","id":"430111"},{"fullname":"望城区","id":"430112"},{"fullname":"长沙县","id":"430121"},{"fullname":"宁乡县","id":"430124"},{"fullname":"浏阳市","id":"430181"},{"fullname":"荷塘区","id":"430202"},{"fullname":"芦淞区","id":"430203"},{"fullname":"石峰区","id":"430204"},{"fullname":"天元区","id":"430211"},{"fullname":"株洲县","id":"430221"},{"fullname":"攸县","id":"430223"},{"fullname":"茶陵县","id":"430224"},{"fullname":"炎陵县","id":"430225"},{"fullname":"醴陵市","id":"430281"},{"fullname":"雨湖区","id":"430302"},{"fullname":"岳塘区","id":"430304"},{"fullname":"湘潭县","id":"430321"},{"fullname":"湘乡市","id":"430381"},{"fullname":"韶山市","id":"430382"},{"fullname":"珠晖区","id":"430405"},{"fullname":"雁峰区","id":"430406"},{"fullname":"石鼓区","id":"430407"},{"fullname":"蒸湘区","id":"430408"},{"fullname":"南岳区","id":"430412"},{"fullname":"衡阳县","id":"430421"},{"fullname":"衡南县","id":"430422"},{"fullname":"衡山县","id":"430423"},{"fullname":"衡东县","id":"430424"},{"fullname":"祁东县","id":"430426"},{"fullname":"耒阳市","id":"430481"},{"fullname":"常宁市","id":"430482"},{"fullname":"双清区","id":"430502"},{"fullname":"大祥区","id":"430503"},{"fullname":"北塔区","id":"430511"},{"fullname":"邵东县","id":"430521"},{"fullname":"新邵县","id":"430522"},{"fullname":"邵阳县","id":"430523"},{"fullname":"隆回县","id":"430524"},{"fullname":"洞口县","id":"430525"},{"fullname":"绥宁县","id":"430527"},{"fullname":"新宁县","id":"430528"},{"fullname":"城步苗族自治县","id":"430529"},{"fullname":"武冈市","id":"430581"},{"fullname":"岳阳楼区","id":"430602"},{"fullname":"云溪区","id":"430603"},{"fullname":"君山区","id":"430611"},{"fullname":"岳阳县","id":"430621"},{"fullname":"华容县","id":"430623"},{"fullname":"湘阴县","id":"430624"},{"fullname":"平江县","id":"430626"},{"fullname":"汨罗市","id":"430681"},{"fullname":"临湘市","id":"430682"},{"fullname":"武陵区","id":"430702"},{"fullname":"鼎城区","id":"430703"},{"fullname":"安乡县","id":"430721"},{"fullname":"汉寿县","id":"430722"},{"fullname":"澧县","id":"430723"},{"fullname":"临澧县","id":"430724"},{"fullname":"桃源县","id":"430725"},{"fullname":"石门县","id":"430726"},{"fullname":"津市市","id":"430781"},{"fullname":"永定区","id":"430802"},{"fullname":"武陵源区","id":"430811"},{"fullname":"慈利县","id":"430821"},{"fullname":"桑植县","id":"430822"},{"fullname":"资阳区","id":"430902"},{"fullname":"赫山区","id":"430903"},{"fullname":"南县","id":"430921"},{"fullname":"桃江县","id":"430922"},{"fullname":"安化县","id":"430923"},{"fullname":"沅江市","id":"430981"},{"fullname":"北湖区","id":"431002"},{"fullname":"苏仙区","id":"431003"},{"fullname":"桂阳县","id":"431021"},{"fullname":"宜章县","id":"431022"},{"fullname":"永兴县","id":"431023"},{"fullname":"嘉禾县","id":"431024"},{"fullname":"临武县","id":"431025"},{"fullname":"汝城县","id":"431026"},{"fullname":"桂东县","id":"431027"},{"fullname":"安仁县","id":"431028"},{"fullname":"资兴市","id":"431081"},{"fullname":"零陵区","id":"431102"},{"fullname":"冷水滩区","id":"431103"},{"fullname":"祁阳县","id":"431121"},{"fullname":"东安县","id":"431122"},{"fullname":"双牌县","id":"431123"},{"fullname":"道县","id":"431124"},{"fullname":"江永县","id":"431125"},{"fullname":"宁远县","id":"431126"},{"fullname":"蓝山县","id":"431127"},{"fullname":"新田县","id":"431128"},{"fullname":"江华瑶族自治县","id":"431129"},{"fullname":"鹤城区","id":"431202"},{"fullname":"中方县","id":"431221"},{"fullname":"沅陵县","id":"431222"},{"fullname":"辰溪县","id":"431223"},{"fullname":"溆浦县","id":"431224"},{"fullname":"会同县","id":"431225"},{"fullname":"麻阳苗族自治县","id":"431226"},{"fullname":"新晃侗族自治县","id":"431227"},{"fullname":"芷江侗族自治县","id":"431228"},{"fullname":"靖州苗族侗族自治县","id":"431229"},{"fullname":"通道侗族自治县","id":"431230"},{"fullname":"洪江市","id":"431281"},{"fullname":"娄星区","id":"431302"},{"fullname":"双峰县","id":"431321"},{"fullname":"新化县","id":"431322"},{"fullname":"冷水江市","id":"431381"},{"fullname":"涟源市","id":"431382"},{"fullname":"吉首市","id":"433101"},{"fullname":"泸溪县","id":"433122"},{"fullname":"凤凰县","id":"433123"},{"fullname":"花垣县","id":"433124"},{"fullname":"保靖县","id":"433125"},{"fullname":"古丈县","id":"433126"},{"fullname":"永顺县","id":"433127"},{"fullname":"龙山县","id":"433130"},{"fullname":"荔湾区","id":"440103"},{"fullname":"越秀区","id":"440104"},{"fullname":"海珠区","id":"440105"},{"fullname":"天河区","id":"440106"},{"fullname":"白云区","id":"440111"},{"fullname":"黄埔区","id":"440112"},{"fullname":"番禺区","id":"440113"},{"fullname":"花都区","id":"440114"},{"fullname":"南沙区","id":"440115"},{"fullname":"从化区","id":"440117"},{"fullname":"增城区","id":"440118"},{"fullname":"武江区","id":"440203"},{"fullname":"浈江区","id":"440204"},{"fullname":"曲江区","id":"440205"},{"fullname":"始兴县","id":"440222"},{"fullname":"仁化县","id":"440224"},{"fullname":"翁源县","id":"440229"},{"fullname":"乳源瑶族自治县","id":"440232"},{"fullname":"新丰县","id":"440233"},{"fullname":"乐昌市","id":"440281"},{"fullname":"南雄市","id":"440282"},{"fullname":"罗湖区","id":"440303"},{"fullname":"福田区","id":"440304"},{"fullname":"南山区","id":"440305"},{"fullname":"宝安区","id":"440306"},{"fullname":"龙岗区","id":"440307"},{"fullname":"盐田区","id":"440308"},{"fullname":"香洲区","id":"440402"},{"fullname":"斗门区","id":"440403"},{"fullname":"金湾区","id":"440404"},{"fullname":"龙湖区","id":"440507"},{"fullname":"金平区","id":"440511"},{"fullname":"濠江区","id":"440512"},{"fullname":"潮阳区","id":"440513"},{"fullname":"潮南区","id":"440514"},{"fullname":"澄海区","id":"440515"},{"fullname":"南澳县","id":"440523"},{"fullname":"禅城区","id":"440604"},{"fullname":"南海区","id":"440605"},{"fullname":"顺德区","id":"440606"},{"fullname":"三水区","id":"440607"},{"fullname":"高明区","id":"440608"},{"fullname":"蓬江区","id":"440703"},{"fullname":"江海区","id":"440704"},{"fullname":"新会区","id":"440705"},{"fullname":"台山市","id":"440781"},{"fullname":"开平市","id":"440783"},{"fullname":"鹤山市","id":"440784"},{"fullname":"恩平市","id":"440785"},{"fullname":"赤坎区","id":"440802"},{"fullname":"霞山区","id":"440803"},{"fullname":"坡头区","id":"440804"},{"fullname":"麻章区","id":"440811"},{"fullname":"遂溪县","id":"440823"},{"fullname":"徐闻县","id":"440825"},{"fullname":"廉江市","id":"440881"},{"fullname":"雷州市","id":"440882"},{"fullname":"吴川市","id":"440883"},{"fullname":"茂南区","id":"440902"},{"fullname":"电白区","id":"440904"},{"fullname":"高州市","id":"440981"},{"fullname":"化州市","id":"440982"},{"fullname":"信宜市","id":"440983"},{"fullname":"端州区","id":"441202"},{"fullname":"鼎湖区","id":"441203"},{"fullname":"高要区","id":"441204"},{"fullname":"广宁县","id":"441223"},{"fullname":"怀集县","id":"441224"},{"fullname":"封开县","id":"441225"},{"fullname":"德庆县","id":"441226"},{"fullname":"四会市","id":"441284"},{"fullname":"惠城区","id":"441302"},{"fullname":"惠阳区","id":"441303"},{"fullname":"博罗县","id":"441322"},{"fullname":"惠东县","id":"441323"},{"fullname":"龙门县","id":"441324"},{"fullname":"梅江区","id":"441402"},{"fullname":"梅县区","id":"441403"},{"fullname":"大埔县","id":"441422"},{"fullname":"丰顺县","id":"441423"},{"fullname":"五华县","id":"441424"},{"fullname":"平远县","id":"441426"},{"fullname":"蕉岭县","id":"441427"},{"fullname":"兴宁市","id":"441481"},{"fullname":"城区","id":"441502"},{"fullname":"海丰县","id":"441521"},{"fullname":"陆河县","id":"441523"},{"fullname":"陆丰市","id":"441581"},{"fullname":"源城区","id":"441602"},{"fullname":"紫金县","id":"441621"},{"fullname":"龙川县","id":"441622"},{"fullname":"连平县","id":"441623"},{"fullname":"和平县","id":"441624"},{"fullname":"东源县","id":"441625"},{"fullname":"江城区","id":"441702"},{"fullname":"阳东区","id":"441704"},{"fullname":"阳西县","id":"441721"},{"fullname":"阳春市","id":"441781"},{"fullname":"清城区","id":"441802"},{"fullname":"清新区","id":"441803"},{"fullname":"佛冈县","id":"441821"},{"fullname":"阳山县","id":"441823"},{"fullname":"连山壮族瑶族自治县","id":"441825"},{"fullname":"连南瑶族自治县","id":"441826"},{"fullname":"英德市","id":"441881"},{"fullname":"连州市","id":"441882"},{"fullname":"湘桥区","id":"445102"},{"fullname":"潮安区","id":"445103"},{"fullname":"饶平县","id":"445122"},{"fullname":"榕城区","id":"445202"},{"fullname":"揭东区","id":"445203"},{"fullname":"揭西县","id":"445222"},{"fullname":"惠来县","id":"445224"},{"fullname":"普宁市","id":"445281"},{"fullname":"云城区","id":"445302"},{"fullname":"云安区","id":"445303"},{"fullname":"新兴县","id":"445321"},{"fullname":"郁南县","id":"445322"},{"fullname":"罗定市","id":"445381"},{"fullname":"兴宁区","id":"450102"},{"fullname":"青秀区","id":"450103"},{"fullname":"江南区","id":"450105"},{"fullname":"西乡塘区","id":"450107"},{"fullname":"良庆区","id":"450108"},{"fullname":"邕宁区","id":"450109"},{"fullname":"武鸣区","id":"450110"},{"fullname":"隆安县","id":"450123"},{"fullname":"马山县","id":"450124"},{"fullname":"上林县","id":"450125"},{"fullname":"宾阳县","id":"450126"},{"fullname":"横县","id":"450127"},{"fullname":"城中区","id":"450202"},{"fullname":"鱼峰区","id":"450203"},{"fullname":"柳南区","id":"450204"},{"fullname":"柳北区","id":"450205"},{"fullname":"柳江区","id":"450206"},{"fullname":"柳城县","id":"450222"},{"fullname":"鹿寨县","id":"450223"},{"fullname":"融安县","id":"450224"},{"fullname":"融水苗族自治县","id":"450225"},{"fullname":"三江侗族自治县","id":"450226"},{"fullname":"秀峰区","id":"450302"},{"fullname":"叠彩区","id":"450303"},{"fullname":"象山区","id":"450304"},{"fullname":"七星区","id":"450305"},{"fullname":"雁山区","id":"450311"},{"fullname":"临桂区","id":"450312"},{"fullname":"阳朔县","id":"450321"},{"fullname":"灵川县","id":"450323"},{"fullname":"全州县","id":"450324"},{"fullname":"兴安县","id":"450325"},{"fullname":"永福县","id":"450326"},{"fullname":"灌阳县","id":"450327"},{"fullname":"龙胜各族自治县","id":"450328"},{"fullname":"资源县","id":"450329"},{"fullname":"平乐县","id":"450330"},{"fullname":"荔浦县","id":"450331"},{"fullname":"恭城瑶族自治县","id":"450332"},{"fullname":"万秀区","id":"450403"},{"fullname":"长洲区","id":"450405"},{"fullname":"龙圩区","id":"450406"},{"fullname":"苍梧县","id":"450421"},{"fullname":"藤县","id":"450422"},{"fullname":"蒙山县","id":"450423"},{"fullname":"岑溪市","id":"450481"},{"fullname":"海城区","id":"450502"},{"fullname":"银海区","id":"450503"},{"fullname":"铁山港区","id":"450512"},{"fullname":"合浦县","id":"450521"},{"fullname":"港口区","id":"450602"},{"fullname":"防城区","id":"450603"},{"fullname":"上思县","id":"450621"},{"fullname":"东兴市","id":"450681"},{"fullname":"钦南区","id":"450702"},{"fullname":"钦北区","id":"450703"},{"fullname":"灵山县","id":"450721"},{"fullname":"浦北县","id":"450722"},{"fullname":"港北区","id":"450802"},{"fullname":"港南区","id":"450803"},{"fullname":"覃塘区","id":"450804"},{"fullname":"平南县","id":"450821"},{"fullname":"桂平市","id":"450881"},{"fullname":"玉州区","id":"450902"},{"fullname":"福绵区","id":"450903"},{"fullname":"容县","id":"450921"},{"fullname":"陆川县","id":"450922"},{"fullname":"博白县","id":"450923"},{"fullname":"兴业县","id":"450924"},{"fullname":"北流市","id":"450981"},{"fullname":"右江区","id":"451002"},{"fullname":"田阳县","id":"451021"},{"fullname":"田东县","id":"451022"},{"fullname":"平果县","id":"451023"},{"fullname":"德保县","id":"451024"},{"fullname":"那坡县","id":"451026"},{"fullname":"凌云县","id":"451027"},{"fullname":"乐业县","id":"451028"},{"fullname":"田林县","id":"451029"},{"fullname":"西林县","id":"451030"},{"fullname":"隆林各族自治县","id":"451031"},{"fullname":"靖西市","id":"451081"},{"fullname":"八步区","id":"451102"},{"fullname":"昭平县","id":"451121"},{"fullname":"钟山县","id":"451122"},{"fullname":"富川瑶族自治县","id":"451123"},{"fullname":"金城江区","id":"451202"},{"fullname":"南丹县","id":"451221"},{"fullname":"天峨县","id":"451222"},{"fullname":"凤山县","id":"451223"},{"fullname":"东兰县","id":"451224"},{"fullname":"罗城仫佬族自治县","id":"451225"},{"fullname":"环江毛南族自治县","id":"451226"},{"fullname":"巴马瑶族自治县","id":"451227"},{"fullname":"都安瑶族自治县","id":"451228"},{"fullname":"大化瑶族自治县","id":"451229"},{"fullname":"宜州市","id":"451281"},{"fullname":"兴宾区","id":"451302"},{"fullname":"忻城县","id":"451321"},{"fullname":"象州县","id":"451322"},{"fullname":"武宣县","id":"451323"},{"fullname":"金秀瑶族自治县","id":"451324"},{"fullname":"合山市","id":"451381"},{"fullname":"江州区","id":"451402"},{"fullname":"扶绥县","id":"451421"},{"fullname":"宁明县","id":"451422"},{"fullname":"龙州县","id":"451423"},{"fullname":"大新县","id":"451424"},{"fullname":"天等县","id":"451425"},{"fullname":"凭祥市","id":"451481"},{"fullname":"秀英区","id":"460105"},{"fullname":"龙华区","id":"460106"},{"fullname":"琼山区","id":"460107"},{"fullname":"美兰区","id":"460108"},{"fullname":"海棠区","id":"460202"},{"fullname":"吉阳区","id":"460203"},{"fullname":"天涯区","id":"460204"},{"fullname":"崖州区","id":"460205"},{"fullname":"锦江区","id":"510104"},{"fullname":"青羊区","id":"510105"},{"fullname":"金牛区","id":"510106"},{"fullname":"武侯区","id":"510107"},{"fullname":"成华区","id":"510108"},{"fullname":"龙泉驿区","id":"510112"},{"fullname":"青白江区","id":"510113"},{"fullname":"新都区","id":"510114"},{"fullname":"温江区","id":"510115"},{"fullname":"双流区","id":"510116"},{"fullname":"金堂县","id":"510121"},{"fullname":"郫县","id":"510124"},{"fullname":"大邑县","id":"510129"},{"fullname":"蒲江县","id":"510131"},{"fullname":"新津县","id":"510132"},{"fullname":"简阳市","id":"510180"},{"fullname":"都江堰市","id":"510181"},{"fullname":"彭州市","id":"510182"},{"fullname":"邛崃市","id":"510183"},{"fullname":"崇州市","id":"510184"},{"fullname":"自流井区","id":"510302"},{"fullname":"贡井区","id":"510303"},{"fullname":"大安区","id":"510304"},{"fullname":"沿滩区","id":"510311"},{"fullname":"荣县","id":"510321"},{"fullname":"富顺县","id":"510322"},{"fullname":"东区","id":"510402"},{"fullname":"西区","id":"510403"},{"fullname":"仁和区","id":"510411"},{"fullname":"米易县","id":"510421"},{"fullname":"盐边县","id":"510422"},{"fullname":"江阳区","id":"510502"},{"fullname":"纳溪区","id":"510503"},{"fullname":"龙马潭区","id":"510504"},{"fullname":"泸县","id":"510521"},{"fullname":"合江县","id":"510522"},{"fullname":"叙永县","id":"510524"},{"fullname":"古蔺县","id":"510525"},{"fullname":"旌阳区","id":"510603"},{"fullname":"中江县","id":"510623"},{"fullname":"罗江县","id":"510626"},{"fullname":"广汉市","id":"510681"},{"fullname":"什邡市","id":"510682"},{"fullname":"绵竹市","id":"510683"},{"fullname":"涪城区","id":"510703"},{"fullname":"游仙区","id":"510704"},{"fullname":"安州区","id":"510705"},{"fullname":"三台县","id":"510722"},{"fullname":"盐亭县","id":"510723"},{"fullname":"梓潼县","id":"510725"},{"fullname":"北川羌族自治县","id":"510726"},{"fullname":"平武县","id":"510727"},{"fullname":"江油市","id":"510781"},{"fullname":"利州区","id":"510802"},{"fullname":"昭化区","id":"510811"},{"fullname":"朝天区","id":"510812"},{"fullname":"旺苍县","id":"510821"},{"fullname":"青川县","id":"510822"},{"fullname":"剑阁县","id":"510823"},{"fullname":"苍溪县","id":"510824"},{"fullname":"船山区","id":"510903"},{"fullname":"安居区","id":"510904"},{"fullname":"蓬溪县","id":"510921"},{"fullname":"射洪县","id":"510922"},{"fullname":"大英县","id":"510923"},{"fullname":"市中区","id":"511002"},{"fullname":"东兴区","id":"511011"},{"fullname":"威远县","id":"511024"},{"fullname":"资中县","id":"511025"},{"fullname":"隆昌县","id":"511028"},{"fullname":"市中区","id":"511102"},{"fullname":"沙湾区","id":"511111"},{"fullname":"五通桥区","id":"511112"},{"fullname":"金口河区","id":"511113"},{"fullname":"犍为县","id":"511123"},{"fullname":"井研县","id":"511124"},{"fullname":"夹江县","id":"511126"},{"fullname":"沐川县","id":"511129"},{"fullname":"峨边彝族自治县","id":"511132"},{"fullname":"马边彝族自治县","id":"511133"},{"fullname":"峨眉山市","id":"511181"},{"fullname":"顺庆区","id":"511302"},{"fullname":"高坪区","id":"511303"},{"fullname":"嘉陵区","id":"511304"},{"fullname":"南部县","id":"511321"},{"fullname":"营山县","id":"511322"},{"fullname":"蓬安县","id":"511323"},{"fullname":"仪陇县","id":"511324"},{"fullname":"西充县","id":"511325"},{"fullname":"阆中市","id":"511381"},{"fullname":"东坡区","id":"511402"},{"fullname":"彭山区","id":"511403"},{"fullname":"仁寿县","id":"511421"},{"fullname":"洪雅县","id":"511423"},{"fullname":"丹棱县","id":"511424"},{"fullname":"青神县","id":"511425"},{"fullname":"翠屏区","id":"511502"},{"fullname":"南溪区","id":"511503"},{"fullname":"宜宾县","id":"511521"},{"fullname":"江安县","id":"511523"},{"fullname":"长宁县","id":"511524"},{"fullname":"高县","id":"511525"},{"fullname":"珙县","id":"511526"},{"fullname":"筠连县","id":"511527"},{"fullname":"兴文县","id":"511528"},{"fullname":"屏山县","id":"511529"},{"fullname":"广安区","id":"511602"},{"fullname":"前锋区","id":"511603"},{"fullname":"岳池县","id":"511621"},{"fullname":"武胜县","id":"511622"},{"fullname":"邻水县","id":"511623"},{"fullname":"华蓥市","id":"511681"},{"fullname":"通川区","id":"511702"},{"fullname":"达川区","id":"511703"},{"fullname":"宣汉县","id":"511722"},{"fullname":"开江县","id":"511723"},{"fullname":"大竹县","id":"511724"},{"fullname":"渠县","id":"511725"},{"fullname":"万源市","id":"511781"},{"fullname":"雨城区","id":"511802"},{"fullname":"名山区","id":"511803"},{"fullname":"荥经县","id":"511822"},{"fullname":"汉源县","id":"511823"},{"fullname":"石棉县","id":"511824"},{"fullname":"天全县","id":"511825"},{"fullname":"芦山县","id":"511826"},{"fullname":"宝兴县","id":"511827"},{"fullname":"巴州区","id":"511902"},{"fullname":"恩阳区","id":"511903"},{"fullname":"通江县","id":"511921"},{"fullname":"南江县","id":"511922"},{"fullname":"平昌县","id":"511923"},{"fullname":"雁江区","id":"512002"},{"fullname":"安岳县","id":"512021"},{"fullname":"乐至县","id":"512022"},{"fullname":"马尔康市","id":"513201"},{"fullname":"汶川县","id":"513221"},{"fullname":"理县","id":"513222"},{"fullname":"茂县","id":"513223"},{"fullname":"松潘县","id":"513224"},{"fullname":"九寨沟县","id":"513225"},{"fullname":"金川县","id":"513226"},{"fullname":"小金县","id":"513227"},{"fullname":"黑水县","id":"513228"},{"fullname":"壤塘县","id":"513230"},{"fullname":"阿坝县","id":"513231"},{"fullname":"若尔盖县","id":"513232"},{"fullname":"红原县","id":"513233"},{"fullname":"康定市","id":"513301"},{"fullname":"泸定县","id":"513322"},{"fullname":"丹巴县","id":"513323"},{"fullname":"九龙县","id":"513324"},{"fullname":"雅江县","id":"513325"},{"fullname":"道孚县","id":"513326"},{"fullname":"炉霍县","id":"513327"},{"fullname":"甘孜县","id":"513328"},{"fullname":"新龙县","id":"513329"},{"fullname":"德格县","id":"513330"},{"fullname":"白玉县","id":"513331"},{"fullname":"石渠县","id":"513332"},{"fullname":"色达县","id":"513333"},{"fullname":"理塘县","id":"513334"},{"fullname":"巴塘县","id":"513335"},{"fullname":"乡城县","id":"513336"},{"fullname":"稻城县","id":"513337"},{"fullname":"得荣县","id":"513338"},{"fullname":"西昌市","id":"513401"},{"fullname":"木里藏族自治县","id":"513422"},{"fullname":"盐源县","id":"513423"},{"fullname":"德昌县","id":"513424"},{"fullname":"会理县","id":"513425"},{"fullname":"会东县","id":"513426"},{"fullname":"宁南县","id":"513427"},{"fullname":"普格县","id":"513428"},{"fullname":"布拖县","id":"513429"},{"fullname":"金阳县","id":"513430"},{"fullname":"昭觉县","id":"513431"},{"fullname":"喜德县","id":"513432"},{"fullname":"冕宁县","id":"513433"},{"fullname":"越西县","id":"513434"},{"fullname":"甘洛县","id":"513435"},{"fullname":"美姑县","id":"513436"},{"fullname":"雷波县","id":"513437"},{"fullname":"南明区","id":"520102"},{"fullname":"云岩区","id":"520103"},{"fullname":"花溪区","id":"520111"},{"fullname":"乌当区","id":"520112"},{"fullname":"白云区","id":"520113"},{"fullname":"观山湖区","id":"520115"},{"fullname":"开阳县","id":"520121"},{"fullname":"息烽县","id":"520122"},{"fullname":"修文县","id":"520123"},{"fullname":"清镇市","id":"520181"},{"fullname":"钟山区","id":"520201"},{"fullname":"六枝特区","id":"520203"},{"fullname":"水城县","id":"520221"},{"fullname":"盘县","id":"520222"},{"fullname":"红花岗区","id":"520302"},{"fullname":"汇川区","id":"520303"},{"fullname":"遵义县","id":"520321"},{"fullname":"桐梓县","id":"520322"},{"fullname":"绥阳县","id":"520323"},{"fullname":"正安县","id":"520324"},{"fullname":"道真仡佬族苗族自治县","id":"520325"},{"fullname":"务川仡佬族苗族自治县","id":"520326"},{"fullname":"凤冈县","id":"520327"},{"fullname":"湄潭县","id":"520328"},{"fullname":"余庆县","id":"520329"},{"fullname":"习水县","id":"520330"},{"fullname":"赤水市","id":"520381"},{"fullname":"仁怀市","id":"520382"},{"fullname":"西秀区","id":"520402"},{"fullname":"平坝区","id":"520403"},{"fullname":"普定县","id":"520422"},{"fullname":"镇宁布依族苗族自治县","id":"520423"},{"fullname":"关岭布依族苗族自治县","id":"520424"},{"fullname":"紫云苗族布依族自治县","id":"520425"},{"fullname":"七星关区","id":"520502"},{"fullname":"大方县","id":"520521"},{"fullname":"黔西县","id":"520522"},{"fullname":"金沙县","id":"520523"},{"fullname":"织金县","id":"520524"},{"fullname":"纳雍县","id":"520525"},{"fullname":"威宁彝族回族苗族自治县","id":"520526"},{"fullname":"赫章县","id":"520527"},{"fullname":"碧江区","id":"520602"},{"fullname":"万山区","id":"520603"},{"fullname":"江口县","id":"520621"},{"fullname":"玉屏侗族自治县","id":"520622"},{"fullname":"石阡县","id":"520623"},{"fullname":"思南县","id":"520624"},{"fullname":"印江土家族苗族自治县","id":"520625"},{"fullname":"德江县","id":"520626"},{"fullname":"沿河土家族自治县","id":"520627"},{"fullname":"松桃苗族自治县","id":"520628"},{"fullname":"兴义市","id":"522301"},{"fullname":"兴仁县","id":"522322"},{"fullname":"普安县","id":"522323"},{"fullname":"晴隆县","id":"522324"},{"fullname":"贞丰县","id":"522325"},{"fullname":"望谟县","id":"522326"},{"fullname":"册亨县","id":"522327"},{"fullname":"安龙县","id":"522328"},{"fullname":"凯里市","id":"522601"},{"fullname":"黄平县","id":"522622"},{"fullname":"施秉县","id":"522623"},{"fullname":"三穗县","id":"522624"},{"fullname":"镇远县","id":"522625"},{"fullname":"岑巩县","id":"522626"},{"fullname":"天柱县","id":"522627"},{"fullname":"锦屏县","id":"522628"},{"fullname":"剑河县","id":"522629"},{"fullname":"台江县","id":"522630"},{"fullname":"黎平县","id":"522631"},{"fullname":"榕江县","id":"522632"},{"fullname":"从江县","id":"522633"},{"fullname":"雷山县","id":"522634"},{"fullname":"麻江县","id":"522635"},{"fullname":"丹寨县","id":"522636"},{"fullname":"都匀市","id":"522701"},{"fullname":"福泉市","id":"522702"},{"fullname":"荔波县","id":"522722"},{"fullname":"贵定县","id":"522723"},{"fullname":"瓮安县","id":"522725"},{"fullname":"独山县","id":"522726"},{"fullname":"平塘县","id":"522727"},{"fullname":"罗甸县","id":"522728"},{"fullname":"长顺县","id":"522729"},{"fullname":"龙里县","id":"522730"},{"fullname":"惠水县","id":"522731"},{"fullname":"三都水族自治县","id":"522732"},{"fullname":"五华区","id":"530102"},{"fullname":"盘龙区","id":"530103"},{"fullname":"官渡区","id":"530111"},{"fullname":"西山区","id":"530112"},{"fullname":"东川区","id":"530113"},{"fullname":"呈贡区","id":"530114"},{"fullname":"晋宁县","id":"530122"},{"fullname":"富民县","id":"530124"},{"fullname":"宜良县","id":"530125"},{"fullname":"石林彝族自治县","id":"530126"},{"fullname":"嵩明县","id":"530127"},{"fullname":"禄劝彝族苗族自治县","id":"530128"},{"fullname":"寻甸回族彝族自治县","id":"530129"},{"fullname":"安宁市","id":"530181"},{"fullname":"麒麟区","id":"530302"},{"fullname":"沾益区","id":"530303"},{"fullname":"马龙县","id":"530321"},{"fullname":"陆良县","id":"530322"},{"fullname":"师宗县","id":"530323"},{"fullname":"罗平县","id":"530324"},{"fullname":"富源县","id":"530325"},{"fullname":"会泽县","id":"530326"},{"fullname":"宣威市","id":"530381"},{"fullname":"红塔区","id":"530402"},{"fullname":"江川区","id":"530403"},{"fullname":"澄江县","id":"530422"},{"fullname":"通海县","id":"530423"},{"fullname":"华宁县","id":"530424"},{"fullname":"易门县","id":"530425"},{"fullname":"峨山彝族自治县","id":"530426"},{"fullname":"新平彝族傣族自治县","id":"530427"},{"fullname":"元江哈尼族彝族傣族自治县","id":"530428"},{"fullname":"隆阳区","id":"530502"},{"fullname":"施甸县","id":"530521"},{"fullname":"龙陵县","id":"530523"},{"fullname":"昌宁县","id":"530524"},{"fullname":"腾冲市","id":"530581"},{"fullname":"昭阳区","id":"530602"},{"fullname":"鲁甸县","id":"530621"},{"fullname":"巧家县","id":"530622"},{"fullname":"盐津县","id":"530623"},{"fullname":"大关县","id":"530624"},{"fullname":"永善县","id":"530625"},{"fullname":"绥江县","id":"530626"},{"fullname":"镇雄县","id":"530627"},{"fullname":"彝良县","id":"530628"},{"fullname":"威信县","id":"530629"},{"fullname":"水富县","id":"530630"},{"fullname":"古城区","id":"530702"},{"fullname":"玉龙纳西族自治县","id":"530721"},{"fullname":"永胜县","id":"530722"},{"fullname":"华坪县","id":"530723"},{"fullname":"宁蒗彝族自治县","id":"530724"},{"fullname":"思茅区","id":"530802"},{"fullname":"宁洱哈尼族彝族自治县","id":"530821"},{"fullname":"墨江哈尼族自治县","id":"530822"},{"fullname":"景东彝族自治县","id":"530823"},{"fullname":"景谷傣族彝族自治县","id":"530824"},{"fullname":"镇沅彝族哈尼族拉祜族自治县","id":"530825"},{"fullname":"江城哈尼族彝族自治县","id":"530826"},{"fullname":"孟连傣族拉祜族佤族自治县","id":"530827"},{"fullname":"澜沧拉祜族自治县","id":"530828"},{"fullname":"西盟佤族自治县","id":"530829"},{"fullname":"临翔区","id":"530902"},{"fullname":"凤庆县","id":"530921"},{"fullname":"云县","id":"530922"},{"fullname":"永德县","id":"530923"},{"fullname":"镇康县","id":"530924"},{"fullname":"双江拉祜族佤族布朗族傣族自治县","id":"530925"},{"fullname":"耿马傣族佤族自治县","id":"530926"},{"fullname":"沧源佤族自治县","id":"530927"},{"fullname":"楚雄市","id":"532301"},{"fullname":"双柏县","id":"532322"},{"fullname":"牟定县","id":"532323"},{"fullname":"南华县","id":"532324"},{"fullname":"姚安县","id":"532325"},{"fullname":"大姚县","id":"532326"},{"fullname":"永仁县","id":"532327"},{"fullname":"元谋县","id":"532328"},{"fullname":"武定县","id":"532329"},{"fullname":"禄丰县","id":"532331"},{"fullname":"个旧市","id":"532501"},{"fullname":"开远市","id":"532502"},{"fullname":"蒙自市","id":"532503"},{"fullname":"弥勒市","id":"532504"},{"fullname":"屏边苗族自治县","id":"532523"},{"fullname":"建水县","id":"532524"},{"fullname":"石屏县","id":"532525"},{"fullname":"泸西县","id":"532527"},{"fullname":"元阳县","id":"532528"},{"fullname":"红河县","id":"532529"},{"fullname":"金平苗族瑶族傣族自治县","id":"532530"},{"fullname":"绿春县","id":"532531"},{"fullname":"河口瑶族自治县","id":"532532"},{"fullname":"文山市","id":"532601"},{"fullname":"砚山县","id":"532622"},{"fullname":"西畴县","id":"532623"},{"fullname":"麻栗坡县","id":"532624"},{"fullname":"马关县","id":"532625"},{"fullname":"丘北县","id":"532626"},{"fullname":"广南县","id":"532627"},{"fullname":"富宁县","id":"532628"},{"fullname":"景洪市","id":"532801"},{"fullname":"勐海县","id":"532822"},{"fullname":"勐腊县","id":"532823"},{"fullname":"大理市","id":"532901"},{"fullname":"漾濞彝族自治县","id":"532922"},{"fullname":"祥云县","id":"532923"},{"fullname":"宾川县","id":"532924"},{"fullname":"弥渡县","id":"532925"},{"fullname":"南涧彝族自治县","id":"532926"},{"fullname":"巍山彝族回族自治县","id":"532927"},{"fullname":"永平县","id":"532928"},{"fullname":"云龙县","id":"532929"},{"fullname":"洱源县","id":"532930"},{"fullname":"剑川县","id":"532931"},{"fullname":"鹤庆县","id":"532932"},{"fullname":"瑞丽市","id":"533102"},{"fullname":"芒市","id":"533103"},{"fullname":"梁河县","id":"533122"},{"fullname":"盈江县","id":"533123"},{"fullname":"陇川县","id":"533124"},{"fullname":"泸水市","id":"533301"},{"fullname":"福贡县","id":"533323"},{"fullname":"贡山独龙族怒族自治县","id":"533324"},{"fullname":"兰坪白族普米族自治县","id":"533325"},{"fullname":"香格里拉市","id":"533401"},{"fullname":"德钦县","id":"533422"},{"fullname":"维西傈僳族自治县","id":"533423"},{"fullname":"城关区","id":"540102"},{"fullname":"堆龙德庆区","id":"540103"},{"fullname":"林周县","id":"540121"},{"fullname":"当雄县","id":"540122"},{"fullname":"尼木县","id":"540123"},{"fullname":"曲水县","id":"540124"},{"fullname":"达孜县","id":"540126"},{"fullname":"墨竹工卡县","id":"540127"},{"fullname":"桑珠孜区","id":"540202"},{"fullname":"南木林县","id":"540221"},{"fullname":"江孜县","id":"540222"},{"fullname":"定日县","id":"540223"},{"fullname":"萨迦县","id":"540224"},{"fullname":"拉孜县","id":"540225"},{"fullname":"昂仁县","id":"540226"},{"fullname":"谢通门县","id":"540227"},{"fullname":"白朗县","id":"540228"},{"fullname":"仁布县","id":"540229"},{"fullname":"康马县","id":"540230"},{"fullname":"定结县","id":"540231"},{"fullname":"仲巴县","id":"540232"},{"fullname":"亚东县","id":"540233"},{"fullname":"吉隆县","id":"540234"},{"fullname":"聂拉木县","id":"540235"},{"fullname":"萨嘎县","id":"540236"},{"fullname":"岗巴县","id":"540237"},{"fullname":"卡若区","id":"540302"},{"fullname":"江达县","id":"540321"},{"fullname":"贡觉县","id":"540322"},{"fullname":"类乌齐县","id":"540323"},{"fullname":"丁青县","id":"540324"},{"fullname":"察雅县","id":"540325"},{"fullname":"八宿县","id":"540326"},{"fullname":"左贡县","id":"540327"},{"fullname":"芒康县","id":"540328"},{"fullname":"洛隆县","id":"540329"},{"fullname":"边坝县","id":"540330"},{"fullname":"巴宜区","id":"540402"},{"fullname":"工布江达县","id":"540421"},{"fullname":"米林县","id":"540422"},{"fullname":"墨脱县","id":"540423"},{"fullname":"波密县","id":"540424"},{"fullname":"察隅县","id":"540425"},{"fullname":"朗县","id":"540426"},{"fullname":"乃东区","id":"540502"},{"fullname":"扎囊县","id":"540521"},{"fullname":"贡嘎县","id":"540522"},{"fullname":"桑日县","id":"540523"},{"fullname":"琼结县","id":"540524"},{"fullname":"曲松县","id":"540525"},{"fullname":"措美县","id":"540526"},{"fullname":"洛扎县","id":"540527"},{"fullname":"加查县","id":"540528"},{"fullname":"隆子县","id":"540529"},{"fullname":"错那县","id":"540530"},{"fullname":"浪卡子县","id":"540531"},{"fullname":"那曲县","id":"542421"},{"fullname":"嘉黎县","id":"542422"},{"fullname":"比如县","id":"542423"},{"fullname":"聂荣县","id":"542424"},{"fullname":"安多县","id":"542425"},{"fullname":"申扎县","id":"542426"},{"fullname":"索县","id":"542427"},{"fullname":"班戈县","id":"542428"},{"fullname":"巴青县","id":"542429"},{"fullname":"尼玛县","id":"542430"},{"fullname":"双湖县","id":"542431"},{"fullname":"普兰县","id":"542521"},{"fullname":"札达县","id":"542522"},{"fullname":"噶尔县","id":"542523"},{"fullname":"日土县","id":"542524"},{"fullname":"革吉县","id":"542525"},{"fullname":"改则县","id":"542526"},{"fullname":"措勤县","id":"542527"},{"fullname":"新城区","id":"610102"},{"fullname":"碑林区","id":"610103"},{"fullname":"莲湖区","id":"610104"},{"fullname":"灞桥区","id":"610111"},{"fullname":"未央区","id":"610112"},{"fullname":"雁塔区","id":"610113"},{"fullname":"阎良区","id":"610114"},{"fullname":"临潼区","id":"610115"},{"fullname":"长安区","id":"610116"},{"fullname":"高陵区","id":"610117"},{"fullname":"蓝田县","id":"610122"},{"fullname":"周至县","id":"610124"},{"fullname":"户县","id":"610125"},{"fullname":"王益区","id":"610202"},{"fullname":"印台区","id":"610203"},{"fullname":"耀州区","id":"610204"},{"fullname":"宜君县","id":"610222"},{"fullname":"渭滨区","id":"610302"},{"fullname":"金台区","id":"610303"},{"fullname":"陈仓区","id":"610304"},{"fullname":"凤翔县","id":"610322"},{"fullname":"岐山县","id":"610323"},{"fullname":"扶风县","id":"610324"},{"fullname":"眉县","id":"610326"},{"fullname":"陇县","id":"610327"},{"fullname":"千阳县","id":"610328"},{"fullname":"麟游县","id":"610329"},{"fullname":"凤县","id":"610330"},{"fullname":"太白县","id":"610331"},{"fullname":"秦都区","id":"610402"},{"fullname":"杨陵区","id":"610403"},{"fullname":"渭城区","id":"610404"},{"fullname":"三原县","id":"610422"},{"fullname":"泾阳县","id":"610423"},{"fullname":"乾县","id":"610424"},{"fullname":"礼泉县","id":"610425"},{"fullname":"永寿县","id":"610426"},{"fullname":"彬县","id":"610427"},{"fullname":"长武县","id":"610428"},{"fullname":"旬邑县","id":"610429"},{"fullname":"淳化县","id":"610430"},{"fullname":"武功县","id":"610431"},{"fullname":"兴平市","id":"610481"},{"fullname":"临渭区","id":"610502"},{"fullname":"华州区","id":"610503"},{"fullname":"潼关县","id":"610522"},{"fullname":"大荔县","id":"610523"},{"fullname":"合阳县","id":"610524"},{"fullname":"澄城县","id":"610525"},{"fullname":"蒲城县","id":"610526"},{"fullname":"白水县","id":"610527"},{"fullname":"富平县","id":"610528"},{"fullname":"韩城市","id":"610581"},{"fullname":"华阴市","id":"610582"},{"fullname":"宝塔区","id":"610602"},{"fullname":"安塞区","id":"610603"},{"fullname":"延长县","id":"610621"},{"fullname":"延川县","id":"610622"},{"fullname":"子长县","id":"610623"},{"fullname":"志丹县","id":"610625"},{"fullname":"吴起县","id":"610626"},{"fullname":"甘泉县","id":"610627"},{"fullname":"富县","id":"610628"},{"fullname":"洛川县","id":"610629"},{"fullname":"宜川县","id":"610630"},{"fullname":"黄龙县","id":"610631"},{"fullname":"黄陵县","id":"610632"},{"fullname":"汉台区","id":"610702"},{"fullname":"南郑县","id":"610721"},{"fullname":"城固县","id":"610722"},{"fullname":"洋县","id":"610723"},{"fullname":"西乡县","id":"610724"},{"fullname":"勉县","id":"610725"},{"fullname":"宁强县","id":"610726"},{"fullname":"略阳县","id":"610727"},{"fullname":"镇巴县","id":"610728"},{"fullname":"留坝县","id":"610729"},{"fullname":"佛坪县","id":"610730"},{"fullname":"榆阳区","id":"610802"},{"fullname":"横山区","id":"610803"},{"fullname":"神木县","id":"610821"},{"fullname":"府谷县","id":"610822"},{"fullname":"靖边县","id":"610824"},{"fullname":"定边县","id":"610825"},{"fullname":"绥德县","id":"610826"},{"fullname":"米脂县","id":"610827"},{"fullname":"佳县","id":"610828"},{"fullname":"吴堡县","id":"610829"},{"fullname":"清涧县","id":"610830"},{"fullname":"子洲县","id":"610831"},{"fullname":"汉滨区","id":"610902"},{"fullname":"汉阴县","id":"610921"},{"fullname":"石泉县","id":"610922"},{"fullname":"宁陕县","id":"610923"},{"fullname":"紫阳县","id":"610924"},{"fullname":"岚皋县","id":"610925"},{"fullname":"平利县","id":"610926"},{"fullname":"镇坪县","id":"610927"},{"fullname":"旬阳县","id":"610928"},{"fullname":"白河县","id":"610929"},{"fullname":"商州区","id":"611002"},{"fullname":"洛南县","id":"611021"},{"fullname":"丹凤县","id":"611022"},{"fullname":"商南县","id":"611023"},{"fullname":"山阳县","id":"611024"},{"fullname":"镇安县","id":"611025"},{"fullname":"柞水县","id":"611026"},{"fullname":"城关区","id":"620102"},{"fullname":"七里河区","id":"620103"},{"fullname":"西固区","id":"620104"},{"fullname":"安宁区","id":"620105"},{"fullname":"红古区","id":"620111"},{"fullname":"永登县","id":"620121"},{"fullname":"皋兰县","id":"620122"},{"fullname":"榆中县","id":"620123"},{"fullname":"嘉峪关市","id":"620201"},{"fullname":"金川区","id":"620302"},{"fullname":"永昌县","id":"620321"},{"fullname":"白银区","id":"620402"},{"fullname":"平川区","id":"620403"},{"fullname":"靖远县","id":"620421"},{"fullname":"会宁县","id":"620422"},{"fullname":"景泰县","id":"620423"},{"fullname":"秦州区","id":"620502"},{"fullname":"麦积区","id":"620503"},{"fullname":"清水县","id":"620521"},{"fullname":"秦安县","id":"620522"},{"fullname":"甘谷县","id":"620523"},{"fullname":"武山县","id":"620524"},{"fullname":"张家川回族自治县","id":"620525"},{"fullname":"凉州区","id":"620602"},{"fullname":"民勤县","id":"620621"},{"fullname":"古浪县","id":"620622"},{"fullname":"天祝藏族自治县","id":"620623"},{"fullname":"甘州区","id":"620702"},{"fullname":"肃南裕固族自治县","id":"620721"},{"fullname":"民乐县","id":"620722"},{"fullname":"临泽县","id":"620723"},{"fullname":"高台县","id":"620724"},{"fullname":"山丹县","id":"620725"},{"fullname":"崆峒区","id":"620802"},{"fullname":"泾川县","id":"620821"},{"fullname":"灵台县","id":"620822"},{"fullname":"崇信县","id":"620823"},{"fullname":"华亭县","id":"620824"},{"fullname":"庄浪县","id":"620825"},{"fullname":"静宁县","id":"620826"},{"fullname":"肃州区","id":"620902"},{"fullname":"金塔县","id":"620921"},{"fullname":"瓜州县","id":"620922"},{"fullname":"肃北蒙古族自治县","id":"620923"},{"fullname":"阿克塞哈萨克族自治县","id":"620924"},{"fullname":"玉门市","id":"620981"},{"fullname":"敦煌市","id":"620982"},{"fullname":"西峰区","id":"621002"},{"fullname":"庆城县","id":"621021"},{"fullname":"环县","id":"621022"},{"fullname":"华池县","id":"621023"},{"fullname":"合水县","id":"621024"},{"fullname":"正宁县","id":"621025"},{"fullname":"宁县","id":"621026"},{"fullname":"镇原县","id":"621027"},{"fullname":"安定区","id":"621102"},{"fullname":"通渭县","id":"621121"},{"fullname":"陇西县","id":"621122"},{"fullname":"渭源县","id":"621123"},{"fullname":"临洮县","id":"621124"},{"fullname":"漳县","id":"621125"},{"fullname":"岷县","id":"621126"},{"fullname":"武都区","id":"621202"},{"fullname":"成县","id":"621221"},{"fullname":"文县","id":"621222"},{"fullname":"宕昌县","id":"621223"},{"fullname":"康县","id":"621224"},{"fullname":"西和县","id":"621225"},{"fullname":"礼县","id":"621226"},{"fullname":"徽县","id":"621227"},{"fullname":"两当县","id":"621228"},{"fullname":"临夏市","id":"622901"},{"fullname":"临夏县","id":"622921"},{"fullname":"康乐县","id":"622922"},{"fullname":"永靖县","id":"622923"},{"fullname":"广河县","id":"622924"},{"fullname":"和政县","id":"622925"},{"fullname":"东乡族自治县","id":"622926"},{"fullname":"积石山保安族东乡族撒拉族自治县","id":"622927"},{"fullname":"合作市","id":"623001"},{"fullname":"临潭县","id":"623021"},{"fullname":"卓尼县","id":"623022"},{"fullname":"舟曲县","id":"623023"},{"fullname":"迭部县","id":"623024"},{"fullname":"玛曲县","id":"623025"},{"fullname":"碌曲县","id":"623026"},{"fullname":"夏河县","id":"623027"},{"fullname":"城东区","id":"630102"},{"fullname":"城中区","id":"630103"},{"fullname":"城西区","id":"630104"},{"fullname":"城北区","id":"630105"},{"fullname":"大通回族土族自治县","id":"630121"},{"fullname":"湟中县","id":"630122"},{"fullname":"湟源县","id":"630123"},{"fullname":"乐都区","id":"630202"},{"fullname":"平安区","id":"630203"},{"fullname":"民和回族土族自治县","id":"630222"},{"fullname":"互助土族自治县","id":"630223"},{"fullname":"化隆回族自治县","id":"630224"},{"fullname":"循化撒拉族自治县","id":"630225"},{"fullname":"门源回族自治县","id":"632221"},{"fullname":"祁连县","id":"632222"},{"fullname":"海晏县","id":"632223"},{"fullname":"刚察县","id":"632224"},{"fullname":"同仁县","id":"632321"},{"fullname":"尖扎县","id":"632322"},{"fullname":"泽库县","id":"632323"},{"fullname":"河南蒙古族自治县","id":"632324"},{"fullname":"共和县","id":"632521"},{"fullname":"同德县","id":"632522"},{"fullname":"贵德县","id":"632523"},{"fullname":"兴海县","id":"632524"},{"fullname":"贵南县","id":"632525"},{"fullname":"玛沁县","id":"632621"},{"fullname":"班玛县","id":"632622"},{"fullname":"甘德县","id":"632623"},{"fullname":"达日县","id":"632624"},{"fullname":"久治县","id":"632625"},{"fullname":"玛多县","id":"632626"},{"fullname":"玉树市","id":"632701"},{"fullname":"杂多县","id":"632722"},{"fullname":"称多县","id":"632723"},{"fullname":"治多县","id":"632724"},{"fullname":"囊谦县","id":"632725"},{"fullname":"曲麻莱县","id":"632726"},{"fullname":"格尔木市","id":"632801"},{"fullname":"德令哈市","id":"632802"},{"fullname":"乌兰县","id":"632821"},{"fullname":"都兰县","id":"632822"},{"fullname":"天峻县","id":"632823"},{"fullname":"冷湖行政区","id":"632824"},{"fullname":"大柴旦行政区","id":"632825"},{"fullname":"茫崖行政区","id":"632826"},{"fullname":"兴庆区","id":"640104"},{"fullname":"西夏区","id":"640105"},{"fullname":"金凤区","id":"640106"},{"fullname":"永宁县","id":"640121"},{"fullname":"贺兰县","id":"640122"},{"fullname":"灵武市","id":"640181"},{"fullname":"大武口区","id":"640202"},{"fullname":"惠农区","id":"640205"},{"fullname":"平罗县","id":"640221"},{"fullname":"利通区","id":"640302"},{"fullname":"红寺堡区","id":"640303"},{"fullname":"盐池县","id":"640323"},{"fullname":"同心县","id":"640324"},{"fullname":"青铜峡市","id":"640381"},{"fullname":"原州区","id":"640402"},{"fullname":"西吉县","id":"640422"},{"fullname":"隆德县","id":"640423"},{"fullname":"泾源县","id":"640424"},{"fullname":"彭阳县","id":"640425"},{"fullname":"沙坡头区","id":"640502"},{"fullname":"中宁县","id":"640521"},{"fullname":"海原县","id":"640522"},{"fullname":"天山区","id":"650102"},{"fullname":"沙依巴克区","id":"650103"},{"fullname":"新市区","id":"650104"},{"fullname":"水磨沟区","id":"650105"},{"fullname":"头屯河区","id":"650106"},{"fullname":"达坂城区","id":"650107"},{"fullname":"米东区","id":"650109"},{"fullname":"乌鲁木齐县","id":"650121"},{"fullname":"独山子区","id":"650202"},{"fullname":"克拉玛依区","id":"650203"},{"fullname":"白碱滩区","id":"650204"},{"fullname":"乌尔禾区","id":"650205"},{"fullname":"高昌区","id":"650402"},{"fullname":"鄯善县","id":"650421"},{"fullname":"托克逊县","id":"650422"},{"fullname":"伊州区","id":"650502"},{"fullname":"巴里坤哈萨克自治县","id":"650521"},{"fullname":"伊吾县","id":"650522"},{"fullname":"昌吉市","id":"652301"},{"fullname":"阜康市","id":"652302"},{"fullname":"呼图壁县","id":"652323"},{"fullname":"玛纳斯县","id":"652324"},{"fullname":"奇台县","id":"652325"},{"fullname":"吉木萨尔县","id":"652327"},{"fullname":"木垒哈萨克自治县","id":"652328"},{"fullname":"博乐市","id":"652701"},{"fullname":"阿拉山口市","id":"652702"},{"fullname":"精河县","id":"652722"},{"fullname":"温泉县","id":"652723"},{"fullname":"库尔勒市","id":"652801"},{"fullname":"轮台县","id":"652822"},{"fullname":"尉犁县","id":"652823"},{"fullname":"若羌县","id":"652824"},{"fullname":"且末县","id":"652825"},{"fullname":"焉耆回族自治县","id":"652826"},{"fullname":"和静县","id":"652827"},{"fullname":"和硕县","id":"652828"},{"fullname":"博湖县","id":"652829"},{"fullname":"阿克苏市","id":"652901"},{"fullname":"温宿县","id":"652922"},{"fullname":"库车县","id":"652923"},{"fullname":"沙雅县","id":"652924"},{"fullname":"新和县","id":"652925"},{"fullname":"拜城县","id":"652926"},{"fullname":"乌什县","id":"652927"},{"fullname":"阿瓦提县","id":"652928"},{"fullname":"柯坪县","id":"652929"},{"fullname":"阿图什市","id":"653001"},{"fullname":"阿克陶县","id":"653022"},{"fullname":"阿合奇县","id":"653023"},{"fullname":"乌恰县","id":"653024"},{"fullname":"喀什市","id":"653101"},{"fullname":"疏附县","id":"653121"},{"fullname":"疏勒县","id":"653122"},{"fullname":"英吉沙县","id":"653123"},{"fullname":"泽普县","id":"653124"},{"fullname":"莎车县","id":"653125"},{"fullname":"叶城县","id":"653126"},{"fullname":"麦盖提县","id":"653127"},{"fullname":"岳普湖县","id":"653128"},{"fullname":"伽师县","id":"653129"},{"fullname":"巴楚县","id":"653130"},{"fullname":"塔什库尔干塔吉克自治县","id":"653131"},{"fullname":"和田市","id":"653201"},{"fullname":"和田县","id":"653221"},{"fullname":"墨玉县","id":"653222"},{"fullname":"皮山县","id":"653223"},{"fullname":"洛浦县","id":"653224"},{"fullname":"策勒县","id":"653225"},{"fullname":"于田县","id":"653226"},{"fullname":"民丰县","id":"653227"},{"fullname":"伊宁市","id":"654002"},{"fullname":"奎屯市","id":"654003"},{"fullname":"霍尔果斯市","id":"654004"},{"fullname":"伊宁县","id":"654021"},{"fullname":"察布查尔锡伯自治县","id":"654022"},{"fullname":"霍城县","id":"654023"},{"fullname":"巩留县","id":"654024"},{"fullname":"新源县","id":"654025"},{"fullname":"昭苏县","id":"654026"},{"fullname":"特克斯县","id":"654027"},{"fullname":"尼勒克县","id":"654028"},{"fullname":"塔城市","id":"654201"},{"fullname":"乌苏市","id":"654202"},{"fullname":"额敏县","id":"654221"},{"fullname":"沙湾县","id":"654223"},{"fullname":"托里县","id":"654224"},{"fullname":"裕民县","id":"654225"},{"fullname":"和布克赛尔蒙古自治县","id":"654226"},{"fullname":"阿勒泰市","id":"654301"},{"fullname":"布尔津县","id":"654321"},{"fullname":"富蕴县","id":"654322"},{"fullname":"福海县","id":"654323"},{"fullname":"哈巴河县","id":"654324"},{"fullname":"青河县","id":"654325"},{"fullname":"吉木乃县","id":"654326"}]]';

locations = JSON.parse(locationsJSON);

ref = locations[0];
for (index = i = 0, len = ref.length; i < len; index = ++i) {
  province = ref[index];
  province.sub = [];
  locationsFormat.push(province);
  provinceMap[province.id.substring(0, 2)] = index;
}

ref1 = locations[1];
for (index = j = 0, len1 = ref1.length; j < len1; index = ++j) {
  city = ref1[index];
  provinceIndex = provinceMap[city.id.substring(0, 2)];
  city.sub = [];
  locationsFormat[provinceIndex].sub.push(city);
  if (index) {
    if (locations[1][index - 1].id.substring(0, 2) === city.id.substring(0, 2)) {
      cityIndex++;
    } else {
      cityIndex = 0;
    }
  }
  cityMap[city.id.substring(0, 4)] = cityIndex;
}

ref2 = locations[2];
for (k = 0, len2 = ref2.length; k < len2; k++) {
  county = ref2[k];
  provinceIndex = provinceMap[county.id.substring(0, 2)];
  cityIndex = cityMap[county.id.substring(0, 4)];
  locationsFormat[provinceIndex].sub[cityIndex].sub.push(county);
}
